const DATA = [
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 1,
    "category": "ストラテジ系",
    "body": "リスクアセスメントを三つのプロセスに分けるとすると，リスクの特定，リスクの評価ともう一つはどれか。",
    "choices": {
      "ア": "リスクの移転",
      "イ": "リスクの回避",
      "ウ": "リスクの低減",
      "エ": "リスクの分析"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 2,
    "category": "ストラテジ系",
    "body": "グループウェアの機能を利用した事例のうち，ワークフロー管理機能を活用したものとして，最も適切なものはどれか。",
    "choices": {
      "ア": "営業活動に有効な提案書テンプレートの共有",
      "イ": "会議出席予定者の空き時間の確認",
      "ウ": "出張申請から交通費の精算までの承認手続の電子化",
      "エ": "ネットワーク上での本支店間会議の実施"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 3,
    "category": "ストラテジ系",
    "body": "購買，生産，販売，経理，人事などの企業の基幹業務の全体を把握し，関連する情報を一元的に管理することによって，企業全体の経営資源の最適化と経営効率の向上を図るためのシステムはどれか。",
    "choices": {
      "ア": "ERP",
      "イ": "MRP",
      "ウ": "SCM",
      "エ": "SFA"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 4,
    "category": "ストラテジ系",
    "body": "次の記述a～cのうち，勤務先の法令違反行為の通報に関して，公益通報者保護法で規定されているものだけを全て挙げたものはどれか。\na 勤務先の同業他社への転職のあっせん\nb 通報したことを理由とした解雇の無効\nc 通報の内容に応じた報奨金の授与",
    "choices": {
      "ア": "a, b",
      "イ": "b",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 5,
    "category": "ストラテジ系",
    "body": "既存市場と新市場，既存製品と新製品でできるマトリックスの四つのセルに企業の成長戦略を表す市場開発戦略，市場浸透戦略，製品開発戦略，多角化戦略を位置付けるとき，市場浸透戦略が位置付けられるのはどのセルか。\n[表: 既存市場×既存製品=A, 既存市場×新製品=B, 新市場×既存製品=C, 新市場×新製品=D]",
    "choices": {
      "ア": "A",
      "イ": "B",
      "ウ": "C",
      "エ": "D"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 6,
    "category": "ストラテジ系",
    "body": "情報システム開発の工程を，システム化構想プロセス，システム化計画プロセス，要件定義プロセス，システム開発プロセスに分けたとき，システム化計画プロセスで実施する作業として，最も適切なものはどれか。",
    "choices": {
      "ア": "業務で利用する画面の詳細を定義する。",
      "イ": "業務を実現するためのシステム機能の範囲と内容を定義する。",
      "ウ": "システム化対象業務の問題点を分析し，システムで解決する課題を定義する。",
      "エ": "情報システム戦略に連動した経営上の課題やニーズを把握する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 7,
    "category": "ストラテジ系",
    "body": "企業のビジョンや戦略を実現するために，\"財務\"，\"顧客\"，\"業務プロセス\"，\"学習と成長\"の四つの視点から，具体的に目標を設定して成果を評価する手法はどれか。",
    "choices": {
      "ア": "PPM",
      "イ": "SWOT分析",
      "ウ": "バランススコアカード",
      "エ": "マーケティングミックス"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 8,
    "category": "ストラテジ系",
    "body": "自社のWebサイトのコンテンツのバージョン管理や公開に労力が割かれている。それを改善するために導入するシステムとして，適切なものはどれか。",
    "choices": {
      "ア": "CAD",
      "イ": "CMS",
      "ウ": "CRM",
      "エ": "SFA"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 9,
    "category": "ストラテジ系",
    "body": "著作権法の保護対象として，適切なものはどれか。",
    "choices": {
      "ア": "プログラム内の情報検索機能に関するアルゴリズム",
      "イ": "プログラムの処理内容を記述したプログラム仕様書",
      "ウ": "プログラムを作成するためのコーディングルール",
      "エ": "プログラムをほかのシステムが使うためのインタフェース規約"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 10,
    "category": "ストラテジ系",
    "body": "企業経営で用いられるベンチマーキングの説明として，適切なものはどれか。",
    "choices": {
      "ア": "PDCAサイクルを適用して，ビジネスプロセスの継続的な改善を図ること",
      "イ": "改善を行う際に，比較や分析の対象とする最も優れた事例のこと",
      "ウ": "競合他社に対する優位性を確保するための独自のスキルや技術のこと",
      "エ": "自社の製品やサービスを測定し，他社の優れたそれらと比較すること"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 11,
    "category": "ストラテジ系",
    "body": "Xさんは，ディジタルカメラで撮影した画像を記録媒体に保管し，その記録媒体をプリンタに差し込んで印刷を行った。その際，ディジタルカメラのメーカを意識することなく印刷することが可能であった。このことは，画像データに関するどのような技術的前提によるものであるか。",
    "choices": {
      "ア": "コモディティ化",
      "イ": "ネットワーク化",
      "ウ": "標準化",
      "エ": "ユビキタス化"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 12,
    "category": "ストラテジ系",
    "body": "表は，シュウマイ弁当の原材料表の一部である。100個のシュウマイ弁当を製造するために必要な豚肉の量は何グラムか。ここで，このシュウマイ弁当にはシュウマイ以外に豚肉を使う料理は入っていないものとし，製造過程での原材料のロスはないものとする。\n[表: シュウマイ弁当1個(シュウマイ5個, 白飯300グラム, ...), シュウマイ1個(シュウマイの皮1枚, シュウマイの具20グラム, ...), シュウマイの具100グラム(豚肉60グラム, 玉ねぎ30グラム, ...)]",
    "choices": {
      "ア": "1,200",
      "イ": "3,000",
      "ウ": "6,000",
      "エ": "30,000"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 13,
    "category": "ストラテジ系",
    "body": "次の条件で，インターネット上にWebサイトを開設して商品販売を開始した。毎月10万円の利益を上げるためには，Webサイトへの毎月の来訪者は少なくとも何人必要か。ここで，Webサイトへの来訪者は全員がインターネット広告経由で来訪し，購入者は1人当たり1個の商品を購入するものとする。また，条件以外の費用は考慮しないものとする。\n〔条件〕①サーバのレンタル費用 5万円／月 ②インターネット広告費用 10円／来訪者 ③商品の販売による利益 400円／個 ④来訪者が商品を購入する比率 10%",
    "choices": {
      "ア": "385",
      "イ": "3,000",
      "ウ": "3,750",
      "エ": "5,000"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 14,
    "category": "ストラテジ系",
    "body": "技術と経営の両面に精通し，組織横断的な事業推進能力を兼ね備えた人材を育成するプログラムが大学などの教育機関で開講されている。このような教育プログラムの背景にある，技術に立脚する事業を行う組織が，技術がもつ可能性を見極めてイノベーションを創出し，経済的価値の最大化を目指す経営の考え方を表すものとして，最も適切なものはどれか。",
    "choices": {
      "ア": "BPR",
      "イ": "CSR",
      "ウ": "HRM",
      "エ": "MOT"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 15,
    "category": "ストラテジ系",
    "body": "ジャストインタイムやカンバンなどの生産活動を取り込んだ，多品種大量生産を効率的に行うリーン生産方式に該当するものはどれか。",
    "choices": {
      "ア": "自社で生産ラインをもたず，他の企業に生産を委託する。",
      "イ": "生産ラインが必要とする部品を必要となる際に入手できるように発注し，仕掛品の量を適正に保つ。",
      "ウ": "納品先が必要とする部品の需要を予測して多めに生産し，納品までの待ち時間の無駄をなくす。",
      "エ": "一つの製品の製造開始から完成までを全て一人が担当し，製造中の仕掛品の移動をなくす。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 16,
    "category": "ストラテジ系",
    "body": "提案依頼書について，次の記述中のa～cに入れる字句の適切な組合せはどれか。\nシステム開発に関わる提案依頼書は通常，[a]が，[b]に対して，[c]，調達条件などを提示する文書である。",
    "choices": {
      "ア": "a: 情報システム部門 / b: ベンダ / c: システム要件",
      "イ": "a: 情報システム部門 / b: 利用部門 / c: システム要件",
      "ウ": "a: ベンダ / b: 情報システム部門 / c: システム導入実績",
      "エ": "a: ベンダ / b: 利用部門 / c: システム導入実績"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 17,
    "category": "ストラテジ系",
    "body": "要件定義プロセスの不備に起因する問題はどれか。",
    "choices": {
      "ア": "システム開発案件の費用対効果の誤った評価",
      "イ": "システム開発案件の優先順位の誤った判断",
      "ウ": "システム開発作業の委託先の不適切な選定手続",
      "エ": "システムに盛り込む業務ルールの誤った解釈"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 18,
    "category": "ストラテジ系",
    "body": "貸借対照表を説明したものはどれか。",
    "choices": {
      "ア": "一定期間におけるキャッシュフローの状況を活動区分別に表示したもの",
      "イ": "一定期間に発生した収益と費用によって会社の経営成績を表示したもの",
      "ウ": "会社の純資産の各項目の前期末残高，当期変動額，当期末残高を表示したもの",
      "エ": "決算日における会社の財務状態を資産・負債・純資産の区分で表示したもの"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 19,
    "category": "ストラテジ系",
    "body": "RPA (Robotic Process Automation) に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "ホワイトカラーの定型的な事務作業を，ソフトウェアで実現されたロボットに代替させることによって，自動化と効率化を図る。",
      "イ": "システムの利用者が，主体的にシステム管理や運用を行うことによって，利用者のITリテラシの向上や，システムベンダへの依存の軽減などを実現する。",
      "ウ": "組立てや搬送などにハードウェアのロボットを用いることによって，工場の生産活動の自動化を実現する。",
      "エ": "企業の一部の業務を外部の組織に委託することによって，自社のリソースを重要な領域に集中したり，コストの最適化や業務の高効率化などを実現したりする。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 20,
    "category": "ストラテジ系",
    "body": "実用新案権の保護対象として，適切なものはどれか。",
    "choices": {
      "ア": "圧縮比率を大きくしても高い復元性を得られる工夫をした画像処理プログラム",
      "イ": "インターネットを利用し，顧客の多様な要望に対応できるビジネスモデル",
      "ウ": "岩石に含まれているレアメタルを無駄なく抽出して，資源を有効活用する方法",
      "エ": "電気スタンドと時計を組み合わせて夜間でも容易に時刻を確かめられる機器"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 21,
    "category": "ストラテジ系",
    "body": "コーポレートブランドを高める目的として，最も適切なものはどれか。",
    "choices": {
      "ア": "企業が有する独自のスキルや技術に基づいて，競合他社では提供が不可能な価値を顧客にもたらすことである。",
      "イ": "企業名などから製品やサービスの品質イメージを連想させることで競争優位性をもたらすことである。",
      "ウ": "経営者や企業が社会に対して，企業の普遍的な価値観，企業活動の基本的な考え方を公表して，ステークホルダの共感を得ることである。",
      "エ": "流通業者の主導権のもとで製造業者などと連携して開発し，生産される独自ブランドの商品を低価格で販売することである。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 22,
    "category": "ストラテジ系",
    "body": "バリューチェーン分析では，企業の活動を，企業の価値に直結する主活動と，主活動全体を支援して全社的な機能を果たす支援活動に分けて分析する。コンピュータ関連機器の製造と販売を行うA社は，部材の購買，機器の設計と製造，商品の出荷，販売とマーケティング，アフターサービスの五つの領域を主活動に，その他の活動領域を支援活動に分類した。企業活動で利用する情報システムのうち，主にA社の支援活動に利用されるものはどれか。",
    "choices": {
      "ア": "CAD/CAM (Computer Aided Design/Computer Aided Manufacturing)",
      "イ": "CRM (Customer Relationship Management)",
      "ウ": "HRM (Human Resource Management)",
      "エ": "SFA (Sales Force Automation)"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 23,
    "category": "ストラテジ系",
    "body": "プロの棋士に勝利するまでに将棋ソフトウェアの能力が向上した。この将棋ソフトウェアの能力向上の中核となった技術として，最も適切なものはどれか。",
    "choices": {
      "ア": "VR",
      "イ": "ER",
      "ウ": "EC",
      "エ": "AI"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 24,
    "category": "ストラテジ系",
    "body": "刑法には，コンピュータや電磁的記録を対象としたIT関連の行為を規制する条項がある。次の不適切な行為のうち，不正指令電磁的記録に関する罪に抵触する可能性があるものはどれか。",
    "choices": {
      "ア": "会社がライセンス購入したソフトウェアパッケージを，無断で個人所有のPCにインストールした。",
      "イ": "キャンペーンに応募した人の個人情報を，応募者に無断で他の目的に利用した。",
      "ウ": "正当な理由なく，他人のコンピュータの誤動作を引き起こすウイルスを収集し，自宅のPCに保管した。",
      "エ": "他人のコンピュータにネットワーク経由でアクセスするためのIDとパスワードを，本人に無断で第三者に教えた。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 25,
    "category": "ストラテジ系",
    "body": "企業の収益性分析を行う指標の一つに，\"利益÷資本\"で求められる資本利益率がある。資本利益率は，売上高利益率（利益÷売上高）と資本回転率（売上高÷資本）に分解して求め，それぞれの要素で分析することもできる。ここで，資本利益率が4%である企業の資本回転率が2.0回のとき，売上高利益率は何%か。",
    "choices": {
      "ア": "0.08",
      "イ": "0.5",
      "ウ": "2.0",
      "エ": "8.0"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 26,
    "category": "ストラテジ系",
    "body": "自社の商品についてPPMを作図した。\"金のなる木\"に該当するものはどれか。\n[図] PPM図。縦軸=市場占有率（高/低），横軸=市場成長率（低/高）。左上=A商品（大きい円），右上=B商品（大きい円），左下=C商品（中くらいの円），右下=D商品（中くらいの円）。注記：円の大きさは売上の規模を示す。",
    "choices": {
      "ア": "A商品",
      "イ": "B商品",
      "ウ": "C商品",
      "エ": "D商品"
    },
    "answer": "ア",
    "image": "img/2019h31h_q26.png"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 27,
    "category": "ストラテジ系",
    "body": "企業がコンプライアンスを推進する上で，配慮が必要なものだけを全て挙げたものはどれか。\na 加盟する業界団体の定めたガイドライン\nb 社会通念や慣習\nc 社内規則\nd 法律",
    "choices": {
      "ア": "a, b, c, d",
      "イ": "a, c, d",
      "ウ": "b, c, d",
      "エ": "c, d"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 28,
    "category": "ストラテジ系",
    "body": "意思決定に役立つ知見を得ることなどが期待されており，大量かつ多種多様な形式でリアルタイム性を有する情報などの意味で用いられる言葉として，最も適切なものはどれか。",
    "choices": {
      "ア": "ビッグデータ",
      "イ": "ダイバーシティ",
      "ウ": "コアコンピタンス",
      "エ": "クラウドファンディング"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 29,
    "category": "ストラテジ系",
    "body": "公開することが不適切なWebサイトa～cのうち，不正アクセス禁止法の規制対象に該当するものだけを全て挙げたものはどれか。\na スマートフォンからメールアドレスを不正に詐取するウイルスに感染させるWebサイト\nb 他の公開されているWebサイトと誤認させ，本物のWebサイトで利用するIDとパスワードの入力を求めるWebサイト\nc 本人の同意を得ることなく，病歴や身体障害の有無などの個人の健康に関する情報を一般に公開するWebサイト",
    "choices": {
      "ア": "a, b, c",
      "イ": "b",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 30,
    "category": "ストラテジ系",
    "body": "自社の情報システムを，自社が管理する設備内に導入して運用する形態を表す用語はどれか。",
    "choices": {
      "ア": "アウトソーシング",
      "イ": "オンプレミス",
      "ウ": "クラウドコンピューティング",
      "エ": "グリッドコンピューティング"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 31,
    "category": "ストラテジ系",
    "body": "EA (Enterprise Architecture) で用いられる，現状とあるべき姿を比較して課題を明確にする分析手法はどれか。",
    "choices": {
      "ア": "ギャップ分析",
      "イ": "コアコンピタンス分析",
      "ウ": "バリューチェーン分析",
      "エ": "パレート分析"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 32,
    "category": "ストラテジ系",
    "body": "ソフトウェアの開発において基本設計からシステムテストまでを一括で委託するとき，請負契約の締結に関する留意事項のうち，適切なものはどれか。",
    "choices": {
      "ア": "請負業務着手後は，仕様変更による工数の増加が起こりやすいので，詳細設計が完了するまで契約の締結を待たなければならない。",
      "イ": "開発したプログラムの著作権は，特段の定めがない限り委託者側に帰属するので，受託者の著作権を認める場合，その旨を契約で決めておかなければならない。",
      "ウ": "受託者は原則として再委託することができるので，委託者が再委託を制限するためには，契約で再委託の条件を決めておかなければならない。",
      "エ": "ソフトウェア開発委託費は開発規模によって変動するので，契約書では定めず，開発完了時に委託者と受託者双方で協議して取り決めなければならない。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 33,
    "category": "ストラテジ系",
    "body": "ポイント，バッジといったゲームの要素を駆使するゲーミフィケーションを導入する目的として，最も適切なものはどれか。",
    "choices": {
      "ア": "ゲーム内で相手の戦略に応じて自分の戦略を決定する。",
      "イ": "顧客や従業員の目標を達成できるように動機付ける。",
      "ウ": "新作ネットワークゲームに関する利用者の評価情報を収集する。",
      "エ": "大量データを分析して有用な事実や関係性を発見する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 34,
    "category": "ストラテジ系",
    "body": "商品の販売数が700個のときの営業利益は表のとおりである。拡販のために販売単価を20%値下げしたところ，販売数が20%増加した。このときの営業利益は何円か。ここで，商品1個当たりの変動費は変わらないものとする。\n[表: 売上高 700,000円, 変動費 140,000円, 固定費 300,000円, 営業利益 260,000円]",
    "choices": {
      "ア": "200,000",
      "イ": "204,000",
      "ウ": "260,000",
      "エ": "320,000"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 35,
    "category": "ストラテジ系",
    "body": "ロングテールに基づいた販売戦略の事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "売れ筋商品だけを選別して仕入れ，Webサイトにそれらの商品についての広告を長期間にわたり掲載する。",
      "イ": "多くの店舗において，購入者の長い行列ができている商品であることをWebサイトで宣伝し，期間限定で販売する。",
      "ウ": "著名人のブログに売上の一部を還元する条件で商品広告を掲載させてもらい，ブログの購読者と長期間にわたる取引を継続する。",
      "エ": "販売機会が少ない商品について品ぞろえを充実させ，Webサイトにそれらの商品を掲載し，販売する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 36,
    "category": "マネジメント系",
    "body": "社内システムの利用方法などについての問合せに対し，単一の窓口であるサービスデスクを設置する部門として，最も適切なものはどれか。",
    "choices": {
      "ア": "インシデント管理の担当",
      "イ": "構成管理の担当",
      "ウ": "変更管理の担当",
      "エ": "リリース管理の担当"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 37,
    "category": "マネジメント系",
    "body": "プロジェクトにおけるリスクマネジメントに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "プロジェクトは期限が決まっているので，プロジェクト開始時点において全てのリスクを特定しなければならない。",
      "イ": "リスクが発生するとプロジェクトに問題が生じるので，リスクは全て回避するようにリスク対応策を計画する。",
      "ウ": "リスク対応策の計画などのために，発生する確率と発生したときの影響度に基づいて，リスクに優先順位を付ける。",
      "エ": "リスクの対応に掛かる費用を抑えるために，リスク対応策はリスクが発生したときに都度計画する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 38,
    "category": "マネジメント系",
    "body": "SNSの事例におけるITサービスマネジメントの要件に関する記述のうち，機密性に該当するものはどれか。",
    "choices": {
      "ア": "24時間365日利用可能である。",
      "イ": "許可されていないユーザはデータやサービスにアクセスできない。",
      "ウ": "サーバ設置場所に地震などの災害が起こっても，1時間以内に利用が再開できる。",
      "エ": "投稿した写真の加工や他のユーザのフォローができる。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 39,
    "category": "マネジメント系",
    "body": "企業などの競争力を高めるために，情報システム戦略の策定及び実行を統制するものとして，最も適切なものはどれか。",
    "choices": {
      "ア": "ITガバナンス",
      "イ": "コンプライアンス",
      "ウ": "システム監査",
      "エ": "プロジェクトマネジメント"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 40,
    "category": "マネジメント系",
    "body": "情報システムを請負契約で海外ベンダに発注することになった。このときのプロジェクト調達マネジメントとして，適切な行動はどれか。",
    "choices": {
      "ア": "受入れ後に不良が発見された場合には，契約にはなくても，該当の箇所だけでなく類似の不良箇所を調査して対策するよう指示する。",
      "イ": "海外ベンダの能力を生かすために，知的財産権の条項は契約に含めずプログラムを自由にコーディングさせる。",
      "ウ": "開発着手後に，開発範囲，仕様，作業内容などの調達内容を文書で合意する。",
      "エ": "契約時に，納品するドキュメントや開発中の仕様変更ルールなどを文書で合意する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 41,
    "category": "マネジメント系",
    "body": "システムのテスト中に発見したバグを，原因別に集計して発生頻度の高い順に並べ，累積曲線を入れた図表はどれか。",
    "choices": {
      "ア": "散布図",
      "イ": "特性要因図",
      "ウ": "パレート図",
      "エ": "ヒストグラム"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 42,
    "category": "マネジメント系",
    "body": "プロジェクト管理におけるプロジェクトスコープの説明として，適切なものはどれか。",
    "choices": {
      "ア": "プロジェクトチームの役割や責任",
      "イ": "プロジェクトで実施すべき作業",
      "ウ": "プロジェクトで実施する各作業の開始予定日と終了予定日",
      "エ": "プロジェクトを実施するために必要な費用"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 43,
    "category": "マネジメント系",
    "body": "内部統制の考え方に関する記述a～dのうち，適切なものだけを全て挙げたものはどれか。\na 事業活動に関わる法律などを遵守し，社会規範に適合した事業活動を促進することが目的の一つである。\nb 事業活動に関わる法律などを遵守することは目的の一つであるが，社会規範に適合した事業活動を促進することまでは求められていない。\nc 内部統制の考え方は，上場企業以外にも有効であり取り組む必要がある。\nd 内部統制の考え方は，上場企業だけに必要である。",
    "choices": {
      "ア": "a, c",
      "イ": "a, d",
      "ウ": "b, c",
      "エ": "b, d"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 44,
    "category": "マネジメント系",
    "body": "情報システムに関わる業務a～cのうち，システム監査の対象となり得る業務だけを全て挙げたものはどれか。\na 情報システム戦略の立案\nb 情報システムの企画・開発\nc 情報システムの運用・保守",
    "choices": {
      "ア": "a",
      "イ": "a, b, c",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 45,
    "category": "マネジメント系",
    "body": "受託しているシステム開発プロジェクトの期間の半分を経過した時点で，委託元から開発中のシステムへの機能追加の依頼があった。プロジェクトマネージャの行動として，最も適切なものはどれか。",
    "choices": {
      "ア": "依頼を受け入れ，予算や要員を確保する。",
      "イ": "期間の半分を経過した時点での変更は一般的に受け入れられないことを理由に，依頼を断る。",
      "ウ": "コストやスケジュールなどへの影響を勘案し，変更管理の手順に従う。",
      "エ": "プロジェクトスコープだけに影響するので，速やかにスコープのベースラインを更新する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 46,
    "category": "マネジメント系",
    "body": "ユーザからの問合せに効率よく迅速に対応していくために，ユーザがWeb上の入力エリアに問合せを入力すると，システムが会話形式で自動的に問合せに応じる仕組みとして，最も適切なものはどれか。",
    "choices": {
      "ア": "レコメンデーション",
      "イ": "チャットボット",
      "ウ": "エスカレーション",
      "エ": "FAQ"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 47,
    "category": "マネジメント系",
    "body": "アジャイル開発の特徴として，適切なものはどれか。",
    "choices": {
      "ア": "大規模なプロジェクトチームによる開発に適している。",
      "イ": "設計ドキュメントを重視し，詳細なドキュメントを作成する。",
      "ウ": "顧客との関係では，協調よりも契約交渉を重視している。",
      "エ": "ウォータフォール開発と比較して，要求の変更に柔軟に対応できる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 48,
    "category": "マネジメント系",
    "body": "安価な労働力を大量に得られることを狙いに，システム開発を海外の事業者や海外の子会社に委託する開発形態として，最も適切なものはどれか。",
    "choices": {
      "ア": "ウォータフォール開発",
      "イ": "オフショア開発",
      "ウ": "プロトタイプ開発",
      "エ": "ラピッドアプリケーション開発"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 49,
    "category": "マネジメント系",
    "body": "情報システムの施設や設備を維持・保全するファシリティマネジメントの施策として，適切なものはどれか。",
    "choices": {
      "ア": "インターネットサイトへのアクセス制限",
      "イ": "コンピュータウイルスのチェック",
      "ウ": "スクリーンセーバの設定時間の標準化",
      "エ": "電力消費量のモニタリング"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 50,
    "category": "マネジメント系",
    "body": "ある事業者において，情報資産のライフサイクルに従って実施される情報セキュリティ監査を行うことになった。この対象として，最も適切なものはどれか。",
    "choices": {
      "ア": "情報資産を管理している情報システム",
      "イ": "情報システム以外で保有している情報資産",
      "ウ": "情報システムが保有している情報資産",
      "エ": "保有している全ての情報資産"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 51,
    "category": "マネジメント系",
    "body": "システムの利用者と開発者の間で，システムの設計書の記載内容が利用者の要求を満たしていることを確認するために実施するものはどれか。",
    "choices": {
      "ア": "共同レビュー",
      "イ": "結合テスト",
      "ウ": "シミュレーション",
      "エ": "進捗会議"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 52,
    "category": "マネジメント系",
    "body": "ホスティングによるアプリケーション運用サービスのSLAの項目に，サービスデスク，信頼性，データ管理があるとき，サービスレベルの具体的な指標a～cとSLAの項目の適切な組合せはどれか。\na 障害発生から修理完了までの平均時間\nb 問合せ受付業務の時間帯\nc バックアップ媒体の保管期間",
    "choices": {
      "ア": "a: サービスデスク / b: 信頼性 / c: データ管理",
      "イ": "a: サービスデスク / b: データ管理 / c: 信頼性",
      "ウ": "a: 信頼性 / b: サービスデスク / c: データ管理",
      "エ": "a: データ管理 / b: 信頼性 / c: サービスデスク"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 53,
    "category": "マネジメント系",
    "body": "50本のプログラム開発をA社又はB社に委託することにした。開発期間が短い会社と開発コストが低い会社の組合せはどれか。\n〔前提〕・A社 生産性：プログラム1本を2日で作成 コスト：4万円／日 ・B社 生産性：プログラム1本を3日で作成 コスト：3万円／日 ・プログラムは1本ずつ順に作成する。",
    "choices": {
      "ア": "開発期間が短い: A社 / 開発コストが低い: A社",
      "イ": "開発期間が短い: A社 / 開発コストが低い: B社",
      "ウ": "開発期間が短い: B社 / 開発コストが低い: A社",
      "エ": "開発期間が短い: B社 / 開発コストが低い: B社"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 54,
    "category": "マネジメント系",
    "body": "ソフトウェア保守に関する説明として，適切なものはどれか。",
    "choices": {
      "ア": "稼働後にプログラム仕様書を分かりやすくするための改善は，ソフトウェア保守である。",
      "イ": "稼働後に見つかった画面や帳票の軽微な不良対策は，ソフトウェア保守ではない。",
      "ウ": "システムテストで検出されたバグの修正は，ソフトウェア保守である。",
      "エ": "システムを全く新規のものに更改することは，ソフトウェア保守である。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 55,
    "category": "マネジメント系",
    "body": "システム監査の業務は，監査計画の立案，監査証拠の入手と評価，監査手続の実施，監査報告書の作成，フォローアップのプロセスに分けられる。これらのうち，適切な対策の実施を指導するプロセスはどれか。",
    "choices": {
      "ア": "監査証拠の入手と評価",
      "イ": "監査手続の実施",
      "ウ": "監査報告書の作成",
      "エ": "フォローアップ"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 56,
    "category": "マネジメント系",
    "body": "要件定義から導入までを行うシステム開発プロジェクトにおける，マスタスケジュールの説明として，適切なものはどれか。",
    "choices": {
      "ア": "一週間分の作業を詳細に記述したスケジュール",
      "イ": "一日分の作業とその開始時間，終了時間，担当者を記述したスケジュール",
      "ウ": "主たる工程の作業を詳細に記述したスケジュール",
      "エ": "プロジェクト全体の主要な成果物や作業を集約したスケジュール"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 57,
    "category": "テクノロジ系",
    "body": "DNSの機能に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "IPアドレスとMACアドレスを対応付ける。",
      "イ": "IPアドレスとドメイン名を対応付ける。",
      "ウ": "IPアドレスを利用してパケット転送の経路を選択する。",
      "エ": "アナログ信号とディジタル信号を相互に変換する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 58,
    "category": "テクノロジ系",
    "body": "PC1をインターネットに接続するための設定を行いたい。PC1のネットワーク設定項目の一つである\"デフォルトゲートウェイ\"に設定するIPアドレスは，どの機器のものか。\n[図] ネットワーク構成図。PC1, PC2がLAN1に接続。LAN1にはルータとDHCPサーバ。ルータからLAN2へ。LAN2にはファイアウォールとプロキシサーバ。ファイアウォールからインターネットへ接続。",
    "choices": {
      "ア": "ルータ",
      "イ": "ファイアウォール",
      "ウ": "DHCPサーバ",
      "エ": "プロキシサーバ"
    },
    "answer": "ア",
    "image": "img/2019h31h_q58.png"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 59,
    "category": "テクノロジ系",
    "body": "ログイン機能をもつWebサイトに対する，パスワードの盗聴と総当たり攻撃へのそれぞれの対策の組合せとして，最も適切なものはどれか。",
    "choices": {
      "ア": "パスワードの盗聴: 暗号化された通信でパスワードを送信する。 / 総当たり攻撃: シングルサインオンを利用する。",
      "イ": "パスワードの盗聴: 暗号化された通信でパスワードを送信する。 / 総当たり攻撃: パスワードの入力試行回数を制限する。",
      "ウ": "パスワードの盗聴: 推測が難しい文字列をパスワードに設定する。 / 総当たり攻撃: シングルサインオンを利用する。",
      "エ": "パスワードの盗聴: 推測が難しい文字列をパスワードに設定する。 / 総当たり攻撃: パスワードの入力試行回数を制限する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 60,
    "category": "テクノロジ系",
    "body": "電子メールを作成するときに指定する送信メッセージの形式のうち，テキスト形式とHTML形式に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "Webメールは，HTML形式の電子メールを送るためのものであり，テキスト形式の電子メールを送ることはできない。",
      "イ": "イラストや写真などの画像ファイルを添付できるのは，テキスト形式ではなく，HTML形式の電子メールである。",
      "ウ": "受信側で表示される文字の大きさや色などの書式を，送信側で指定できるのは，テキスト形式ではなく，HTML形式の電子メールである。",
      "エ": "ディジタル署名を付与するためには，HTML形式ではなく，テキスト形式の電子メールを使用する必要がある。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 61,
    "category": "テクノロジ系",
    "body": "ネットワークに関する次の記述中のa～cに入れる字句の適切な組合せはどれか。\n建物内などに設置される比較的狭いエリアのネットワークを[a]といい，地理的に離れた地点に設置されている[a]間を結ぶネットワークを[b]という。一般に，[a]に接続する機器に設定するIPアドレスには，組織内に閉じたネットワークであれば自由に使うことができる[c]が使われる。",
    "choices": {
      "ア": "a: LAN / b: WAN / c: グローバルIPアドレス",
      "イ": "a: LAN / b: WAN / c: プライベートIPアドレス",
      "ウ": "a: WAN / b: LAN / c: グローバルIPアドレス",
      "エ": "a: WAN / b: LAN / c: プライベートIPアドレス"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 62,
    "category": "テクノロジ系",
    "body": "複数のハードディスクを論理的に一つのものとして取り扱うための方式①～③のうち，構成するハードディスクが1台故障してもデータ復旧が可能なものだけを全て挙げたものはどれか。\n① RAID5\n② ストライピング\n③ ミラーリング",
    "choices": {
      "ア": "①, ②",
      "イ": "①, ②, ③",
      "ウ": "①, ③",
      "エ": "②, ③"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 63,
    "category": "テクノロジ系",
    "body": "PDCAモデルに基づいてISMSを運用している組織において，A (Act) で実施することの例として，適切なものはどれか。",
    "choices": {
      "ア": "業務内容の監査結果に基づいた是正処置として，サーバの監視方法を変更する。",
      "イ": "サーバ管理者の業務内容を第三者が客観的に評価する。",
      "ウ": "サーバ室内の情報資産を洗い出す。",
      "エ": "サーバの動作を定められた運用手順に従って監視する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 64,
    "category": "テクノロジ系",
    "body": "二つの拠点を専用回線で接続したWANでパケットを送受信する場合，可用性を高める例として，適切なものはどれか。",
    "choices": {
      "ア": "異なる通信事業者が提供する別回線を加え，2回線でパケットを送受信する。",
      "イ": "受信側でパケットの誤りを検知し訂正する。",
      "ウ": "送信側でウイルス検査を行い，ウイルスが含まれないパケットを送る。",
      "エ": "送信側でパケットを暗号化して送る。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 65,
    "category": "テクノロジ系",
    "body": "企業での内部不正などの不正が発生するときには，\"不正のトライアングル\"と呼ばれる3要素の全てがそろって存在すると考えられている。\"不正のトライアングル\"を構成する3要素として，最も適切なものはどれか。",
    "choices": {
      "ア": "機会, 情報, 正当化",
      "イ": "機会, 情報, 動機",
      "ウ": "機会, 正当化, 動機",
      "エ": "情報, 正当化, 動機"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 66,
    "category": "テクノロジ系",
    "body": "値の小さな数や大きな数を分かりやすく表現するために，接頭語が用いられる。例えば，10^-3と10^3を表すのに，それぞれ\"m\"と\"k\"が用いられる。10^-9と10^9を表すのに用いられる接頭語はどれか。",
    "choices": {
      "ア": "nとG",
      "イ": "nとM",
      "ウ": "pとG",
      "エ": "pとM"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 67,
    "category": "テクノロジ系",
    "body": "OSS (Open Source Software) であるDBMSはどれか。",
    "choices": {
      "ア": "Android",
      "イ": "Firefox",
      "ウ": "MySQL",
      "エ": "Thunderbird"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 68,
    "category": "テクノロジ系",
    "body": "資産A～Dの資産価値，脅威及び脆弱性の評価値が表のとおりであるとき，最優先でリスク対応すべきと評価される資産はどれか。ここで，リスク値は，表の各項目を重み付けせずに掛け合わせることによって算出した値とする。\n[表: 資産A(資産価値5, 脅威2, 脆弱性3), 資産B(資産価値6, 脅威1, 脆弱性2), 資産C(資産価値2, 脅威2, 脆弱性5), 資産D(資産価値1, 脅威5, 脆弱性3)]",
    "choices": {
      "ア": "資産A",
      "イ": "資産B",
      "ウ": "資産C",
      "エ": "資産D"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 69,
    "category": "テクノロジ系",
    "body": "PCでWebサイトを閲覧しただけで，PCにウイルスなどを感染させる攻撃はどれか。",
    "choices": {
      "ア": "DoS攻撃",
      "イ": "ソーシャルエンジニアリング",
      "ウ": "ドライブバイダウンロード",
      "エ": "バックドア"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 70,
    "category": "テクノロジ系",
    "body": "次の記憶装置のうち，アクセス時間が最も短いものはどれか。",
    "choices": {
      "ア": "HDD",
      "イ": "SSD",
      "ウ": "キャッシュメモリ",
      "エ": "主記憶"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 71,
    "category": "テクノロジ系",
    "body": "図1のように二つの正の整数A1, A2を入力すると，二つの数値B1, B2を出力するボックスがある。B1はA2と同じ値であり，B2はA1をA2で割った余りである。図2のように，このボックスを2個つないだ構成において，左側のボックスのA1として49, A2として11を入力したとき，右側のボックスから出力されるB2の値は幾らか。\n[図] 図1: 入力A1,A2 → ボックス(A2→B1, A1/A2の余り→B2) → 出力B1,B2。図2: 49,11 → ボックス1 → ボックス2 → B1,B2",
    "choices": {
      "ア": "1",
      "イ": "2",
      "ウ": "4",
      "エ": "5"
    },
    "answer": "ア",
    "image": "img/2019h31h_q71.png"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 72,
    "category": "テクノロジ系",
    "body": "ISMSの導入効果に関する次の記述中のa, bに入れる字句の適切な組合せはどれか。\n[a]マネジメントプロセスを適用することによって，情報の機密性，[b]及び可用性をバランス良く維持，改善し，[a]を適切に管理しているという信頼を利害関係者に与える。",
    "choices": {
      "ア": "a: 品質 / b: 完全性",
      "イ": "a: 品質 / b: 妥当性",
      "ウ": "a: リスク / b: 完全性",
      "エ": "a: リスク / b: 妥当性"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 73,
    "category": "テクノロジ系",
    "body": "LTEよりも通信速度が高速なだけではなく，より多くの端末が接続でき，通信の遅延も少ないという特徴をもつ移動通信システムはどれか。",
    "choices": {
      "ア": "ブロックチェーン",
      "イ": "MVNO",
      "ウ": "8K",
      "エ": "5G"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 74,
    "category": "テクノロジ系",
    "body": "無線LANの暗号化方式であり，WEPでは短い時間で暗号が解読されてしまう問題が報告されたことから，より暗号強度を高めるために利用が推奨されているものはどれか。",
    "choices": {
      "ア": "ESSID",
      "イ": "HTTPS",
      "ウ": "S/MIME",
      "エ": "WPA2"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 75,
    "category": "テクノロジ系",
    "body": "AさんはBさんだけに伝えたい内容を書いた電子メールを，公開鍵暗号方式を用いてBさんの鍵で暗号化してBさんに送った。この電子メールを復号するために必要な鍵はどれか。",
    "choices": {
      "ア": "Aさんの公開鍵",
      "イ": "Aさんの秘密鍵",
      "ウ": "Bさんの公開鍵",
      "エ": "Bさんの秘密鍵"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 76,
    "category": "テクノロジ系",
    "body": "バイオメトリクス認証に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "指紋や静脈を使用した認証は，のぞき見行為によって容易に認証情報が漏えいする。",
      "イ": "装置が大型なので，携帯電話やスマートフォンには搭載できない。",
      "ウ": "他人を本人と誤って認証してしまうリスクがない。",
      "エ": "筆跡やキーストロークなどの本人の行動的特徴を利用したものも含まれる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 77,
    "category": "テクノロジ系",
    "body": "次の条件で，インターネットに接続されたサーバから5Mバイトのファイルを PC にダウンロードするときに掛かる時間は何秒か。\n〔条件〕通信速度: 100Mビット／秒, 実効通信速度: 通信速度の20%",
    "choices": {
      "ア": "0.05",
      "イ": "0.25",
      "ウ": "0.5",
      "エ": "2"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 78,
    "category": "テクノロジ系",
    "body": "関係データベースの\"社員\"表と\"部署\"表がある。\"社員\"表と\"部署\"表を結合し，社員の住所と所属する部署の所在地が異なる社員を抽出する。抽出される社員は何人か。\n[表: 社員(H001 伊藤花子 G02 神奈川県, H002 高橋四郎 G01 神奈川県, H003 鈴木一郎 G03 三重県, H004 田中春子 G04 大阪府, H005 渡辺二郎 G03 愛知県, H006 佐藤三郎 G02 神奈川県) / 部署(G01 総務部 東京都, G02 営業部 神奈川県, G03 製造部 愛知県, G04 開発部 大阪府)]",
    "choices": {
      "ア": "1",
      "イ": "2",
      "ウ": "3",
      "エ": "4"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 79,
    "category": "テクノロジ系",
    "body": "次の記述a～cのうち，VPNの特徴として，適切なものだけを全て挙げたものはどれか。\na アクセスポイントを経由しないで，端末同士が相互に無線通信を行うことができる。\nb 公衆ネットワークなどを利用するが，あたかも自社専用ネットワークのように使うことができる。\nc ネットワークに接続することによって，PCのセキュリティ状態を検査することができる。",
    "choices": {
      "ア": "a",
      "イ": "a, c",
      "ウ": "b",
      "エ": "c"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 80,
    "category": "テクノロジ系",
    "body": "3Dプリンタの特徴として，適切なものはどれか。",
    "choices": {
      "ア": "3D効果がある画像を，平面に印刷する。",
      "イ": "3次元データを用いて，立体物を造形する。",
      "ウ": "立体物の曲面などに，画像を印刷する。",
      "エ": "レーザによって，空間に立体画像を表示する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 81,
    "category": "テクノロジ系",
    "body": "Webサイトを構築する際にスタイルシートを用いる理由として，適切なものはどれか。",
    "choices": {
      "ア": "WebサーバとWebブラウザ間で安全にデータをやり取りできるようになる。",
      "イ": "Webサイトの更新情報を利用者に知らせることができるようになる。",
      "ウ": "Webサイトの利用者を識別できるようになる。",
      "エ": "複数のWebページの見た目を統一することが容易にできるようになる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 82,
    "category": "テクノロジ系",
    "body": "PC1のメールクライアントからPC2のメールクライアントの利用者宛ての電子メールを送信するとき，①～③で使われているプロトコルの組合せとして，適切なものはどれか。\n[図] PC1 →①→ メールサーバ →②→ メールサーバ →③→ PC2",
    "choices": {
      "ア": "①: POP3 / ②: POP3 / ③: SMTP",
      "イ": "①: POP3 / ②: SMTP / ③: SMTP",
      "ウ": "①: SMTP / ②: POP3 / ③: POP3",
      "エ": "①: SMTP / ②: SMTP / ③: POP3"
    },
    "answer": "エ",
    "image": "img/2019h31h_q82.png"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 83,
    "category": "テクノロジ系",
    "body": "PoEの説明として，適切なものはどれか。",
    "choices": {
      "ア": "LANケーブルを使って電力供給する技術であり，電源コンセントがない場所に無線LANのアクセスポイントを設置する場合などで利用される。",
      "イ": "既設の電気配線を利用してLANを構築できる技術であり，新たにLANケーブルを敷設しなくてもよい。",
      "ウ": "グローバルアドレスとプライベートアドレスを自動的に変換して転送する技術であり，社内LANとインターネットとの境界部で使われる。",
      "エ": "通信速度や通信モードを自動判別する技術であり，異なるイーサネット規格が混在しているLAN環境で，ネットワーク機器の最適な通信設定を自動的に行える。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 84,
    "category": "テクノロジ系",
    "body": "オンラインストレージに関する記述のうち，適切でないものはどれか。",
    "choices": {
      "ア": "インターネットに接続していれば，PCからだけでなく，スマートフォンやタブレットからでも利用可能である。",
      "イ": "制限された容量と機能の範囲内で，無料で利用できるサービスがある。",
      "ウ": "登録された複数の利用者が同じファイルを共有して，編集できるサービスがある。",
      "エ": "利用者のPCやタブレットに内蔵された補助記憶装置の容量を増やせば，オンラインストレージの容量も自動的に増える。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 85,
    "category": "テクノロジ系",
    "body": "情報セキュリティポリシを，基本方針，対策基準及び実施手順の三つの文書で構成したとき，これらに関する説明のうち，適切なものはどれか。",
    "choices": {
      "ア": "基本方針は，経営者が作成した対策基準や実施手順に従って，従業員が策定したものである。",
      "イ": "基本方針は，情報セキュリティ事故が発生した場合に，経営者が取るべき行動を記述したマニュアルのようなものである。",
      "ウ": "実施手順は，対策基準として決められたことが担当者が実施できるように，具体的な進め方などを記述したものである。",
      "エ": "対策基準は，基本方針や実施手順に何を記述すべきかを定めて，関係者に周知しておくものである。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 86,
    "category": "テクノロジ系",
    "body": "IoT端末で用いられているLPWA (Low Power Wide Area) の特徴に関する次の記述中のa, bに入れる字句の適切な組合せはどれか。\nLPWAの技術を使った無線通信は，無線LANと比べると，通信速度は[a]，消費電力は[b]。",
    "choices": {
      "ア": "a: 速く / b: 少ない",
      "イ": "a: 速く / b: 多い",
      "ウ": "a: 遅く / b: 少ない",
      "エ": "a: 遅く / b: 多い"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 87,
    "category": "テクノロジ系",
    "body": "情報セキュリティ対策を，技術的対策，人的対策及び物理的対策の三つに分類したとき，物理的対策の例として適切なものはどれか。",
    "choices": {
      "ア": "PCの不正使用を防止するために，PCのログイン認証にバイオメトリクス認証を導入する。",
      "イ": "サーバに対する外部ネットワークからの不正侵入を防止するために，ファイアウォールを設置する。",
      "ウ": "セキュリティ管理者の不正や作業誤りを防止したり発見したりするために，セキュリティ管理者を複数名にして，互いの作業内容を相互チェックする。",
      "エ": "セキュリティ区画を設けて施錠し，鍵の貸出し管理を行って不正な立入りがないかどうかをチェックする。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 88,
    "category": "テクノロジ系",
    "body": "ウイルスの感染に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "OSやアプリケーションだけではなく，機器に組み込まれたファームウェアも感染することがある。",
      "イ": "PCをネットワークにつなげず，他のPCとのデータ授受に外部記憶媒体だけを利用すれば，感染することはない。",
      "ウ": "感染が判明したPCはネットワークにつなげたままにして，直ちにOSやセキュリティ対策ソフトのアップデート作業を実施する。",
      "エ": "電子メールの添付ファイルを開かなければ，感染することはない。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 89,
    "category": "テクノロジ系",
    "body": "スマートフォンを利用するときに，ソーシャルエンジニアリングに分類されるショルダーハックの防止策として，適切なものはどれか。",
    "choices": {
      "ア": "OSを常に最新の状態で利用する。",
      "イ": "位置情報機能をオフにする。",
      "ウ": "スクリーンにのぞき見防止フィルムを貼る。",
      "エ": "落下，盗難防止用にストラップを付ける。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 90,
    "category": "テクノロジ系",
    "body": "入力画面で数値を入力すべきところに誤って英字を入力したらエラーメッセージが表示され，再入力を求められた。このような工夫をしておく設計思想を表す用語として，適切なものはどれか。",
    "choices": {
      "ア": "フールプルーフ",
      "イ": "フェールソフト",
      "ウ": "フォールトトレランス",
      "エ": "ロールバック"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 91,
    "category": "テクノロジ系",
    "body": "E-R図で表現するものはどれか。",
    "choices": {
      "ア": "HDD内のデータの物理的な配置",
      "イ": "エンティティ同士の関係",
      "ウ": "処理の流れ",
      "エ": "入力データ及び出力データ"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 92,
    "category": "テクノロジ系",
    "body": "関係データベースを構築する際にデータの正規化を行う目的として，適切なものはどれか。",
    "choices": {
      "ア": "データに冗長性をもたせて，データ誤りを検出する。",
      "イ": "データの矛盾や重複を排除して，データの維持管理を容易にする。",
      "ウ": "データの文字コードを統一して，データの信頼性と格納効率を向上させる。",
      "エ": "データを可逆圧縮して，アクセス効率を向上させる。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 93,
    "category": "テクノロジ系",
    "body": "NFCに準拠した無線通信方式を利用したものはどれか。",
    "choices": {
      "ア": "ETC車載器との無線通信",
      "イ": "エアコンのリモートコントロール",
      "ウ": "カーナビの位置計測",
      "エ": "交通系IC乗車券による改札"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 94,
    "category": "テクノロジ系",
    "body": "ランサムウェアの説明として，適切なものはどれか。",
    "choices": {
      "ア": "PC内のファイルを暗号化して使用不能にし，復号するためのキーと引換えに金品を要求するソフトウェア",
      "イ": "キーボードの入力を不正に記録するソフトウェア",
      "ウ": "システムログを改ざんすることによって，自らを発見されにくくするソフトウェア",
      "エ": "自ら感染を広げる機能をもち，ネットワークを経由して蔓延していくソフトウェア"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 95,
    "category": "テクノロジ系",
    "body": "関係データベースの操作を行うための言語はどれか。",
    "choices": {
      "ア": "FAQ",
      "イ": "SQL",
      "ウ": "SSL",
      "エ": "UML"
    },
    "answer": "イ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 96,
    "category": "テクノロジ系",
    "body": "Webサーバ上において，図のようにディレクトリd1及びd2が配置されているとき，ディレクトリd1（カレントディレクトリ）にあるWebページファイルf1.htmlの中から，別のディレクトリd2にあるWebページファイルf2.htmlの参照を指定する記述はどれか。ここで，ファイルの指定方法は次のとおりである。\n〔指定方法〕(1) ファイルは，\"ディレクトリ名/…/ディレクトリ名/ファイル名\"のように，経路上のディレクトリを順に\"/\"で区切って並べた後に\"/\"とファイル名を指定する。(2) カレントディレクトリは\".\"で表す。(3) 1階層上のディレクトリは\"..\"で表す。(4) 始まりが\"/\"のときは，左端のルートディレクトリが省略されているものとする。\n[図] ルート → d1(f1.html), d2(f2.html)",
    "choices": {
      "ア": "./d2/f2.html",
      "イ": "./f2.html",
      "ウ": "../d2/f2.html",
      "エ": "d2/../f2.html"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 97,
    "category": "テクノロジ系",
    "body": "PCのCPUに関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "1GHzCPUの\"1GHz\"は，そのCPUが処理のタイミングを合わせるための信号を1秒間に10億回発生させて動作することを示す。",
      "イ": "32ビットCPUや64ビットCPUの\"32\"や\"64\"は，CPUの処理速度を示す。",
      "ウ": "一次キャッシュや二次キャッシュの\"一次\"や\"二次\"は，CPUがもつキャッシュメモリ容量の大きさの順位を示す。",
      "エ": "デュアルコアCPUやクアッドコアCPUの\"デュアル\"や\"クアッド\"は，CPUの消費電力を1/2，1/4の省エネモードに切り替えることができることを示す。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 98,
    "category": "テクノロジ系",
    "body": "表計算ソフトを用いて，二つの科目X, Yの成績を評価して合否を判定する。それぞれの点数はワークシートのセルA2, B2に入力する。合計点が120点以上であり，かつ，2科目とも50点以上であればセルC2に\"合格\"，それ以外は\"不合格\"と表示する。セルC2に入れる適切な計算式はどれか。\n[表: A1:科目X, B1:科目Y, C1:合否, A2:50, B2:80, C2:合格]",
    "choices": {
      "ア": "IF(論理積((A2+B2)≧120, A2≧50, B2≧50), '合格', '不合格')",
      "イ": "IF(論理積((A2+B2)≧120, A2≧50, B2≧50), '不合格', '合格')",
      "ウ": "IF(論理和((A2+B2)≧120, A2≧50, B2≧50), '合格', '不合格')",
      "エ": "IF(論理和((A2+B2)≧120, A2≧50, B2≧50), '不合格', '合格')"
    },
    "answer": "ア"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 99,
    "category": "テクノロジ系",
    "body": "外部からの不正アクセスによるコンピュータに関する犯罪の疑いが生じた。そのとき，関係する機器やデータ，ログなどの収集及び分析を行い，法的証拠性を明らかにするための手段や技術の総称はどれか。",
    "choices": {
      "ア": "ディジタルサイネージ",
      "イ": "ディジタル署名",
      "ウ": "ディジタルディバイド",
      "エ": "ディジタルフォレンジックス"
    },
    "answer": "エ"
  },
  {
    "exam": "2019h31h",
    "examLabel": "H31春",
    "number": 100,
    "category": "テクノロジ系",
    "body": "電子商取引において，注文した事実やその内容について否認されることを防止するために，取引の相手に実施を依頼することとして，最も適切なものはどれか。",
    "choices": {
      "ア": "相手が取引に使用するPCには，OSのログインパスワードを設定してもらう。",
      "イ": "相手のイントラネット内のウイルス対策を行ってもらう。",
      "ウ": "注文データにディジタル署名を付与してもらう。",
      "エ": "注文データを暗号化してから送ってもらう。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 1,
    "category": "ストラテジ系",
    "body": "労働者派遣法に基づき，A社がY氏をB社へ派遣することとなった。このときに成立する関係として，適切なものはどれか。",
    "choices": {
      "ア": "A社とB社との間の委託関係",
      "イ": "A社とY氏との間の労働者派遣契約関係",
      "ウ": "B社とY氏との間の雇用関係",
      "エ": "B社とY氏との間の指揮命令関係"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 2,
    "category": "ストラテジ系",
    "body": "あるメーカの当期損益の見込みは表のとおりであったが，その後広告宣伝費が5億円，保有株式の受取配当金が3億円増加した。このとき，最終的な営業利益と経常利益はそれぞれ何億円になるか。ここで，広告宣伝費，保有株式の受取配当金以外は全て見込みどおりであったものとする。\n[表: 売上高 1,000億円, 売上原価 780億円, 販売費及び一般管理費 130億円, 営業外収益 20億円, 営業外費用 16億円, 特別利益 2億円, 特別損失 1億円, 法人税・住民税及び事業税 50億円]",
    "choices": {
      "ア": "営業利益: 85 / 経常利益: 92",
      "イ": "営業利益: 85 / 経常利益: 93",
      "ウ": "営業利益: 220 / 経常利益: 92",
      "エ": "営業利益: 220 / 経常利益: 93"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 3,
    "category": "ストラテジ系",
    "body": "IoTの事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "オークション会場と会員のPCをインターネットで接続することによって，会員の自宅からでもオークションに参加できる。",
      "イ": "社内のサーバ上にあるグループウェアを外部のデータセンタのサーバに移すことによって，社員はインターネット経由でいつでもどこでも利用できる。",
      "ウ": "飲み薬の容器にセンサを埋め込むことによって，薬局がインターネット経由で服用履歴を管理し，服薬指導に役立てることができる。",
      "エ": "予備校が授業映像をWebサイトで配信することによって，受講者はスマートフォンやPCを用いて，いつでもどこでも授業を受けることができる。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 4,
    "category": "ストラテジ系",
    "body": "情報を縦横2次元の図形パターンに保存するコードはどれか。",
    "choices": {
      "ア": "ASCIIコード",
      "イ": "Gコード",
      "ウ": "JANコード",
      "エ": "QRコード"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 5,
    "category": "ストラテジ系",
    "body": "材料調達から商品販売までの流れを一括管理して，供給の最適化を目指すシステムはどれか。",
    "choices": {
      "ア": "ASP",
      "イ": "CRM",
      "ウ": "ERP",
      "エ": "SCM"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 6,
    "category": "ストラテジ系",
    "body": "行政機関の保有する資料について，開示を請求する権利とその手続などについて定めた法律はどれか。",
    "choices": {
      "ア": "公益通報者保護法",
      "イ": "個人情報保護法",
      "ウ": "情報公開法",
      "エ": "不正アクセス禁止法"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 7,
    "category": "ストラテジ系",
    "body": "事業環境の分析などに用いられる3C分析の説明として，適切なものはどれか。",
    "choices": {
      "ア": "顧客，競合，自社の三つの観点から分析する。",
      "イ": "最新購買日，購買頻度，購買金額の三つの観点から分析する。",
      "ウ": "時代，年齢，世代の三つの要因に分解して分析する。",
      "エ": "総売上高の高い順に三つのグループに分類して分析する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 8,
    "category": "ストラテジ系",
    "body": "人口減少や高齢化などを背景に，ICTを活用して，都市や地域の機能やサービスを効率化，高度化し，地域課題の解決や活性化を実現することが試みられている。このような街づくりのソリューションを示す言葉として，最も適切なものはどれか。",
    "choices": {
      "ア": "キャパシティ",
      "イ": "スマートシティ",
      "ウ": "ダイバーシティ",
      "エ": "ユニバーシティ"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 9,
    "category": "ストラテジ系",
    "body": "DFDにおいて，データフローや処理（機能）以外に記述されるものだけを全て挙げたものはどれか。\na データの処理に要する時間\nb データの蓄積場所\nc データの発生源や出力先",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, c",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 10,
    "category": "ストラテジ系",
    "body": "企業のアライアンス戦略のうち，ジョイントベンチャの説明として，適切なものはどれか。",
    "choices": {
      "ア": "2社以上の企業が共同出資して経営する企業のこと",
      "イ": "企業間で相互に出資や株式の持合などの協力関係を結ぶこと",
      "ウ": "企業の合併や買収によって相手企業の支配権を取得すること",
      "エ": "技術やブランド，販売活動などに関する権利の使用を認めること"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 11,
    "category": "ストラテジ系",
    "body": "情報システム戦略において定義した目標の達成状況を測定するために，重要な業績評価の指標を示す用語はどれか。",
    "choices": {
      "ア": "BPO",
      "イ": "CSR",
      "ウ": "KPI",
      "エ": "ROA"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 12,
    "category": "ストラテジ系",
    "body": "企業の経営理念を策定する意義として，最も適切なものはどれか。",
    "choices": {
      "ア": "企業の経営戦略を実現するための行動計画を具体的に示すことができる。",
      "イ": "企業の経営目標を実現するためのシナリオを明確にすることができる。",
      "ウ": "企業の存在理由や価値観を明確にすることができる。",
      "エ": "企業の到達したい将来像を示すことができる。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 13,
    "category": "ストラテジ系",
    "body": "IoTに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "人工知能における学習の仕組み",
      "イ": "センサを搭載した機器や制御装置などが直接インターネットにつながり，それらがネットワークを通じて様々な情報をやり取りする仕組み",
      "ウ": "ソフトウェアの機能の一部を，ほかのプログラムで利用できるように公開する関数や手続の集まり",
      "エ": "ソフトウェアのロボットを利用して，定型的な仕事を効率化するツール"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 14,
    "category": "ストラテジ系",
    "body": "CADの説明として，適切なものはどれか。",
    "choices": {
      "ア": "アナログ信号をディジタル信号に変換する回路のこと",
      "イ": "建築物，工業製品などの設計にコンピュータを用いること",
      "ウ": "光を電気信号に変換する撮像素子のこと",
      "エ": "文字，画像，音声などのデータを組み合わせて一つのコンテンツを作ること"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 15,
    "category": "ストラテジ系",
    "body": "自社の商品やサービスの情報を主体的に収集する見込み客の獲得を目的に，企業がSNSやブログ，検索エンジンなどを利用して商品やサービスに関連する情報を発信する。このようにして獲得した見込み客を，最終的に顧客に転換させることを目標とするマーケティング手法として，最も適切なものはどれか。",
    "choices": {
      "ア": "アウトバウンドマーケティング",
      "イ": "インバウンドマーケティング",
      "ウ": "ダイレクトマーケティング",
      "エ": "テレマーケティング"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 16,
    "category": "ストラテジ系",
    "body": "システム導入を検討している企業や官公庁などがRFIを実施する目的として，最も適切なものはどれか。",
    "choices": {
      "ア": "ベンダ企業からシステムの詳細な見積金額を入手し，契約金額を確定する。",
      "イ": "ベンダ企業から情報収集を行い，システムの技術的な課題や実現性を把握する。",
      "ウ": "ベンダ企業との認識のずれをなくし，取引を適正化する。",
      "エ": "ベンダ企業に提案書の提出を求め，発注先を決定する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 17,
    "category": "ストラテジ系",
    "body": "イノベーションのジレンマに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "最初に商品を消費したときに感じた価値や満足度が，消費する量が増えるに従い，徐々に低下していく現象",
      "イ": "自社の既存商品がシェアを占めている市場に，自社の新商品を導入することで，既存商品のシェアを奪ってしまう現象",
      "ウ": "全売上の大部分を，少数の顧客が占めている状態",
      "エ": "優良な大企業が，革新的な技術の追求よりも，既存技術の向上でシェアを確保することに注力してしまい，結果的に市場でのシェアの確保に失敗する現象"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 18,
    "category": "ストラテジ系",
    "body": "銀行などの預金者の資産を，AIが自動的に運用するサービスを提供するなど，金融業においてIT技術を活用して，これまでにない革新的なサービスを開拓する取組を示す用語はどれか。",
    "choices": {
      "ア": "FA",
      "イ": "FinTech",
      "ウ": "OA",
      "エ": "シェアリングエコノミー"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 19,
    "category": "ストラテジ系",
    "body": "特定の目的の達成や課題の解決をテーマとして，ソフトウェアの開発者や企画者などが短期集中的にアイディアを出し合い，ソフトウェアの開発などの共同作業を行い，成果を競い合うイベントはどれか。",
    "choices": {
      "ア": "コンベンション",
      "イ": "トレードフェア",
      "ウ": "ハッカソン",
      "エ": "レセプション"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 20,
    "category": "ストラテジ系",
    "body": "事業活動における重要な技術情報について，営業秘密とするための要件を定めている法律はどれか。",
    "choices": {
      "ア": "著作権法",
      "イ": "特定商取引法",
      "ウ": "不正アクセス禁止法",
      "エ": "不正競争防止法"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 21,
    "category": "ストラテジ系",
    "body": "ディープラーニングに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "営業，マーケティング，アフタサービスなどの顧客に関わる部門間で情報や業務の流れを統合する仕組み",
      "イ": "コンピュータなどのディジタル機器，通信ネットワークを利用して実施される教育，学習，研修の形態",
      "ウ": "組織内の各個人がもつ知識やノウハウを組織全体で共有し，有効活用する仕組み",
      "エ": "大量のデータを人間の脳神経回路を模したモデルで解析することによって，コンピュータ自体がデータの特徴を抽出し，学習する技術"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 22,
    "category": "ストラテジ系",
    "body": "人工知能の活用事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "運転手が関与せずに，自動車の加速，操縦，制動の全てをシステムが行う。",
      "イ": "オフィスの自席にいながら，会議室やトイレの空き状況がリアルタイムに分かる。",
      "ウ": "銀行のような中央管理者を置かなくても，分散型の合意形成技術によって，取引の承認を行う。",
      "エ": "自宅のPCから事前に入力し，窓口に行かなくても自動で振替や振込を行う。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 23,
    "category": "ストラテジ系",
    "body": "統計学や機械学習などの手法を用いて大量のデータを解析して，新たなサービスや価値を生み出すためのヒントやアイディアを抽出する役割が重要となっている。その役割を担う人材として，最も適切なものはどれか。",
    "choices": {
      "ア": "ITストラテジスト",
      "イ": "システムアーキテクト",
      "ウ": "システムアナリスト",
      "エ": "データサイエンティスト"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 24,
    "category": "ストラテジ系",
    "body": "著作権法における著作権に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "偶然に内容が類似している二つの著作物が同時期に創られた場合，著作権は一方の著作者だけに認められる。",
      "イ": "著作権は，権利を取得するための申請や登録などの手続が不要である。",
      "ウ": "著作権法の保護対象には，技術的思想も含まれる。",
      "エ": "著作物は，創作性に加え新規性も兼ね備える必要がある。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 25,
    "category": "ストラテジ系",
    "body": "経営戦略上，ITの利活用が不可欠な企業の経営者を対象として，サイバー攻撃から企業を守る観点で経営者が認識すべき原則や取り組むべき項目を記載したものはどれか。",
    "choices": {
      "ア": "IT基本法",
      "イ": "ITサービス継続ガイドライン",
      "ウ": "サイバーセキュリティ基本法",
      "エ": "サイバーセキュリティ経営ガイドライン"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 26,
    "category": "ストラテジ系",
    "body": "製品Aの生産計画量，部品Bの総所要量及び在庫量が表のとおりであるとき，第2週における部品Bの発注量aは何個か。\n[条件]\n・製品Aの生産リードタイム（着手から完成までの期間）は無視する。\n・製品Aを1個生産するためには部品Bが2個必要であり，部品Bは製品Aの生産以外には使われない。\n・部品Bの発注は，各週の生産終了後に行い，翌週の生産開始までに入荷する。\n・部品Bの安全在庫は，当該週の部品Bの総所要量の25%とする。\n・部品Bの第1週の生産開始前の在庫量を100個とする。\n[表: 第1週 製品A生産計画量40/部品B総所要量80/部品B在庫量(生産終了後)20 / 第2週 製品A生産計画量40/部品B総所要量80/部品B発注量a / 第3週 製品A生産計画量20/部品B総所要量40]",
    "choices": {
      "ア": "30",
      "イ": "40",
      "ウ": "60",
      "エ": "80"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 27,
    "category": "ストラテジ系",
    "body": "取得した個人情報の管理に関する行為a～cのうち，個人情報保護法において，本人に通知又は公表が必要となるものだけを全て挙げたものはどれか。\na 個人情報の入力業務の委託先の変更\nb 個人情報の利用目的の合理的な範囲での変更\nc 利用しなくなった個人情報の削除",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "b",
      "エ": "b, c"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 28,
    "category": "ストラテジ系",
    "body": "業務の効率化を目指すために，SFAを導入するのに適した部門はどれか。",
    "choices": {
      "ア": "営業",
      "イ": "経理・会計",
      "ウ": "資材・購買",
      "エ": "製造"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 29,
    "category": "ストラテジ系",
    "body": "SEOに関する説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "SNSに立ち上げたコミュニティの参加者に，そのコミュニティの目的に合った検索結果を表示する。",
      "イ": "自社のWebサイトのアクセスログを，検索エンジンを使って解析し，不正アクセスの有無をチェックする。",
      "ウ": "利用者が検索エンジンを使ってキーワード検索を行ったときに，自社のWebサイトを検索結果の上位に表示させるよう工夫する。",
      "エ": "利用者がどのような検索エンジンを望んでいるかを調査し，要望にあった検索エンジンを開発する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 30,
    "category": "ストラテジ系",
    "body": "デザイン思考の例として，最も適切なものはどれか。",
    "choices": {
      "ア": "Webページのレイアウトなどを定義したスタイルシートを使用し，ホームページをデザインする。",
      "イ": "アプローチの中心は常に製品やサービスの利用者であり，利用者の本質的なニーズに基づき，製品やサービスをデザインする。",
      "ウ": "業務の迅速化や効率化を図ることを目的に，業務プロセスを抜本的に再デザインする。",
      "エ": "データと手続を備えたオブジェクトの集まりとして捉え，情報システム全体をデザインする。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 31,
    "category": "ストラテジ系",
    "body": "RFIDの活用によって可能となる事柄として，適切なものはどれか。",
    "choices": {
      "ア": "移動しているタクシーの現在位置をリアルタイムで把握する。",
      "イ": "インターネット販売などで情報を暗号化して通信の安全性を確保する。",
      "ウ": "入館時に指紋や虹彩といった身体的特徴を識別して個人を認証する。",
      "エ": "本の貸出時や返却の際に複数の本を一度にまとめて処理する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 32,
    "category": "ストラテジ系",
    "body": "一般消費者向けの製品を製造しているA社では，新製品の開発に当たって，市場を取り巻くマクロ環境を政治，経済，社会，技術の観点について分析することにした。このときに収集すべき情報として，最も適切なものはどれか。",
    "choices": {
      "ア": "競合企業の経営戦略",
      "イ": "競合企業の財務状況",
      "ウ": "主要仕入先の原材料価格",
      "エ": "我が国の高齢化率"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 33,
    "category": "ストラテジ系",
    "body": "RPA（Robotic Process Automation）の事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "高度で非定型の判断だけを人間の代わりに自動で行うソフトウェアが，求人サイトにエントリーされたデータから採用候補者を選定する。",
      "イ": "人間の形をしたロボットが，銀行の窓口での接客など非定型な業務を自動で行う。",
      "ウ": "ルール化された定型的な操作を人間の代わりに自動で行うソフトウェアが，インターネットで受け付けた注文データを配送システムに転記する。",
      "エ": "ロボットが，工場の製造現場で組立てなどの定型的な作業を人間の代わりに自動で行う。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 34,
    "category": "ストラテジ系",
    "body": "売上高，変動費，固定費，営業日数が表のようなレストランで，年間400万円以上の利益を上げるためには，1営業日当たり少なくとも何人の来店客が必要か。\n[表: 客1人当たり売上高 3,000円, 客1人当たり変動費 1,000円, 年間の固定費 2,000万円, 年間の営業日数 300日]",
    "choices": {
      "ア": "14",
      "イ": "20",
      "ウ": "27",
      "エ": "40"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 35,
    "category": "ストラテジ系",
    "body": "持続可能な世界を実現するために国連が採択した，2030年までに達成されるべき開発目標を示す言葉として，最も適切なものはどれか。",
    "choices": {
      "ア": "SDGs",
      "イ": "SDK",
      "ウ": "SGA",
      "エ": "SGML"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 36,
    "category": "マネジメント系",
    "body": "システム監査の目的はどれか。",
    "choices": {
      "ア": "情報システム運用段階で，重要データのバックアップをとる。",
      "イ": "情報システム開発要員のスキルアップを図る。",
      "ウ": "情報システム企画段階で，ユーザニーズを調査し，システム化要件として文書化する。",
      "エ": "情報システムに係るリスクをコントロールし，情報システムを安全，有効かつ効率的に機能させる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 37,
    "category": "マネジメント系",
    "body": "内部統制におけるモニタリングの説明として，適切なものはどれか。",
    "choices": {
      "ア": "内部統制が有効に働いていることを継続的に評価するプロセス",
      "イ": "内部統制に関わる法令その他の規範の遵守を促進するプロセス",
      "ウ": "内部統制の体制を構築するプロセス",
      "エ": "内部統制を阻害するリスクを分析するプロセス"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 38,
    "category": "マネジメント系",
    "body": "システム開発プロジェクトの開始時に，開発途中で利用者から仕様変更要求が多く出てプロジェクトの進捗に影響が出ることが予想された。品質悪化や納期遅れにならないようにする対応策として，最も適切なものはどれか。",
    "choices": {
      "ア": "設計完了後は変更要求を受け付けないことを顧客に宣言する。",
      "イ": "途中で遅れが発生した場合にはテストを省略してテスト期間を短縮する。",
      "ウ": "変更要求が多く発生した場合には機能の実装を取りやめることを計画に盛り込む。",
      "エ": "変更要求の優先順位の決め方と対応範囲を顧客と合意しておく。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 39,
    "category": "マネジメント系",
    "body": "共通フレームの定義に含まれているものとして，適切なものはどれか。",
    "choices": {
      "ア": "各工程で作成する成果物の文書化に関する詳細な規定",
      "イ": "システムの開発や保守の各工程の作業項目",
      "ウ": "システムを構成するソフトウェアの信頼性レベルや保守性レベルなどの尺度の規定",
      "エ": "システムを構成するハードウェアの開発に関する詳細な作業項目"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 40,
    "category": "マネジメント系",
    "body": "アジャイル開発の方法論であるスクラムに関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "ソフトウェア開発組織及びプロジェクトのプロセスを改善するために，その組織の成熟度レベルを段階的に定義したものである。",
      "イ": "ソフトウェア開発とその取引において，取得者と供給者が，作業内容の共通の物差しとするために定義したものである。",
      "ウ": "複雑で変化の激しい問題に対応するためのシステム開発のフレームワークであり，反復的かつ漸進的な手法として定義したものである。",
      "エ": "プロジェクトマネジメントの知識を体系化したものであり，複数の知識エリアから定義されているものである。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 41,
    "category": "マネジメント系",
    "body": "プロジェクトマネジメントの進め方に関する説明として，適切なものはどれか。",
    "choices": {
      "ア": "企画，要件定義，システム開発，保守の順番で，開発を行う。",
      "イ": "戦略，設計，移行，運用，改善のライフサイクルで，ITサービスを維持する。",
      "ウ": "目標を達成するための計画を作成し，実行中は品質，進捗，コストなどをコントロールし，目標の達成に導く。",
      "エ": "予備調査，本調査，評価，結論の順番で，リスクの識別，コントロールが適切に実施されているかの確認を行う。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 42,
    "category": "マネジメント系",
    "body": "システム開発において使用するアローダイアグラムの説明として，適切なものはどれか。",
    "choices": {
      "ア": "業務のデータの流れを表した図である。",
      "イ": "作業の関連をネットワークで表した図である。",
      "ウ": "作業を縦軸にとって，作業の所要期間を横棒で表した図である。",
      "エ": "ソフトウェアのデータ間の関係を表した図である。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 43,
    "category": "マネジメント系",
    "body": "AIを利用したチャットボットに関する事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "あらゆる物がインターネットを介してつながることによって，外出先でスマートデバイスから自宅のエアコンのスイッチを入れることなどができるようになる。",
      "イ": "コンピュータが様々な動物の画像を大量に認識して学習することによって，犬と猫の画像が判別できるようになる。",
      "ウ": "商品の操作方法などの質問を書き込むと，詳しい知識をもった人が回答や助言を投稿してくれる。",
      "エ": "商品の販売サイトで，利用者が求める商品の機能などを入力すると，その内容に応じて推奨する商品をコンピュータが会話型で紹介してくれる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 44,
    "category": "マネジメント系",
    "body": "業務処理時間の短縮を目的として，運用中の業務システムの処理能力の改善を図った。この改善が有効であることを評価するためにシステム監査を実施するとき，システム監査人が運用部門に要求する情報として，適切なものはどれか。",
    "choices": {
      "ア": "稼働統計資料",
      "イ": "システム運用体制",
      "ウ": "システム運用マニュアル",
      "エ": "ユーザマニュアル"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 45,
    "category": "マネジメント系",
    "body": "会計システムの開発を受託した会社が，顧客と打合せを行って，必要な決算書の種類や，会計データの確定から決算書類の出力までの処理時間の目標値を明確にした。この作業を実施するのに適切な工程はどれか。",
    "choices": {
      "ア": "システムテスト",
      "イ": "システム要件定義",
      "ウ": "ソフトウェア詳細設計",
      "エ": "ソフトウェア方式設計"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 46,
    "category": "マネジメント系",
    "body": "システム開発後にプログラムの修正や変更を行うことを何というか。",
    "choices": {
      "ア": "システム化の企画",
      "イ": "システム運用",
      "ウ": "ソフトウェア保守",
      "エ": "要件定義"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 47,
    "category": "マネジメント系",
    "body": "ソフトウェアの品質を判定する指標として，機能単位の不良件数をその開発規模で割った値を\"不良密度\"と定義する。不良密度の下限値と上限値を設定し，実績値がその範囲を逸脱した場合に問題ありと判定するとき，A工程では問題がなく，B工程で問題があると判定される機能はどれか。ここで，不良密度の下限値は0.25件／KS，上限値は0.65件／KSとする。また，不良密度の下限値，上限値及び開発規模は，両工程とも同じとする。\n[表: ア 機能1 開発規模10KS A工程不良件数6 B工程不良件数3 / イ 機能2 開発規模20KS A工程不良件数14 B工程不良件数10 / ウ 機能3 開発規模50KS A工程不良件数10 B工程不良件数40 / エ 機能4 開発規模80KS A工程不良件数32 B工程不良件数8]",
    "choices": {
      "ア": "機能1: 開発規模10KS / A工程不良件数6 / B工程不良件数3",
      "イ": "機能2: 開発規模20KS / A工程不良件数14 / B工程不良件数10",
      "ウ": "機能3: 開発規模50KS / A工程不良件数10 / B工程不良件数40",
      "エ": "機能4: 開発規模80KS / A工程不良件数32 / B工程不良件数8"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 48,
    "category": "マネジメント系",
    "body": "サービスレベル管理のPDCAサイクルのうち，C（Check）で実施する内容はどれか。",
    "choices": {
      "ア": "SLAに基づくサービスを提供する。",
      "イ": "サービス提供結果の報告とレビューに基づき，サービスの改善計画を作成する。",
      "ウ": "サービス要件及びサービス改善計画を基に，目標とするサービス品質を合意し，SLAを作成する。",
      "エ": "提供したサービスを監視・測定し，サービス報告書を作成する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 49,
    "category": "マネジメント系",
    "body": "アジャイル開発の特徴として，適切なものはどれか。",
    "choices": {
      "ア": "各工程間の情報はドキュメントによって引き継がれるので，開発全体の進捗が把握しやすい。",
      "イ": "各工程でプロトタイピングを実施するので，潜在している問題や要求を見つけ出すことができる。",
      "ウ": "段階的に開発を進めるので，最後の工程で不具合が発生すると，遡って修正が発生し，手戻り作業が多くなる。",
      "エ": "ドキュメントの作成よりもソフトウェアの作成を優先し，変化する顧客の要望を素早く取り入れることができる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 50,
    "category": "マネジメント系",
    "body": "ITサービスマネジメントのフレームワークはどれか。",
    "choices": {
      "ア": "IEEE",
      "イ": "IETF",
      "ウ": "ISMS",
      "エ": "ITIL"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 51,
    "category": "マネジメント系",
    "body": "プロジェクトマネジメントにおいて，プロジェクトスコープを定義したプロジェクトスコープ記述書に関する説明として，適切なものはどれか。",
    "choices": {
      "ア": "成果物と作業の一覧及びプロジェクトからの除外事項を記述している。",
      "イ": "成果物を作るための各作業の開始予定日と終了予定日を記述している。",
      "ウ": "プロジェクトが完了するまでのコスト見積りを記述している。",
      "エ": "プロジェクトにおける役割，責任，必要なスキルを特定して記述している。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 52,
    "category": "マネジメント系",
    "body": "アジャイル開発において，短い間隔による開発工程の反復や，その開発サイクルを表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "イテレーション",
      "イ": "スクラム",
      "ウ": "プロトタイピング",
      "エ": "ペアプログラミング"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 53,
    "category": "マネジメント系",
    "body": "企業におけるITガバナンスを構築し，推進する責任者として，適切な者は誰か。",
    "choices": {
      "ア": "株主",
      "イ": "経営者",
      "ウ": "従業員",
      "エ": "情報システム部員"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 54,
    "category": "マネジメント系",
    "body": "利用者からの問合せの窓口となるサービスデスクでは，電話や電子メールに加え，自動応答技術を用いてリアルタイムで会話形式のコミュニケーションを行うツールが活用されている。このツールとして，最も適切なものはどれか。",
    "choices": {
      "ア": "FAQ",
      "イ": "RPA",
      "ウ": "エスカレーション",
      "エ": "チャットボット"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 55,
    "category": "マネジメント系",
    "body": "ソフトウェア開発におけるDevOpsに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "開発側が重要な機能のプロトタイプを作成し，顧客とともにその性能を実測して妥当性を評価する。",
      "イ": "開発側と運用側が密接に連携し，自動化ツールなどを活用して機能などの導入や更新を迅速に進める。",
      "ウ": "開発側のプロジェクトマネージャが，開発の各工程でその工程の完了を判断した上で次工程に進む方式で，ソフトウェアの開発を行う。",
      "エ": "利用者のニーズの変化に柔軟に対応するために，開発側がソフトウェアを小さな単位に分割し，固定した期間で繰り返しながら開発する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 56,
    "category": "テクノロジ系",
    "body": "次の作業a～dのうち，リスクマネジメントにおける，リスクアセスメントに含まれるものだけを全て挙げたものはどれか。\na リスク特定\nb リスク分析\nc リスク評価\nd リスク対応",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, c",
      "ウ": "b, c, d",
      "エ": "c, d"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 57,
    "category": "テクノロジ系",
    "body": "サーバの仮想化技術において，あるハードウェアで稼働している仮想化されたサーバを停止することなく別のハードウェアに移動させ，移動前の状態から引き続きサーバの処理を継続させる技術を何と呼ぶか。",
    "choices": {
      "ア": "ストリーミング",
      "イ": "ディジタルサイネージ",
      "ウ": "プラグアンドプレイ",
      "エ": "ライブマイグレーション"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 58,
    "category": "テクノロジ系",
    "body": "PCの周辺装置を利用可能にするためのデバイスドライバに関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "HDDを初期化してOSを再インストールした場合，OSとは別にインストールしていたデバイスドライバは再インストールする必要がある。",
      "イ": "新しいアプリケーションソフトウェアをインストールした場合，そのソフトウェアが使用する全てのデバイスドライバを再インストールする必要がある。",
      "ウ": "不要になったデバイスドライバであっても，一度インストールしたデバイスドライバを利用者が削除することはできない。",
      "エ": "プリンタのデバイスドライバを一つだけインストールしていれば，メーカや機種を問わず全てのプリンタが使用できる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 59,
    "category": "テクノロジ系",
    "body": "複数の取引記録をまとめたデータを順次作成するときに，そのデータに直前のデータのハッシュ値を埋め込むことによって，データを相互に関連付け，取引記録を矛盾なく改ざんすることを困難にすることで，データの信頼性を高める技術はどれか。",
    "choices": {
      "ア": "LPWA",
      "イ": "SDN",
      "ウ": "エッジコンピューティング",
      "エ": "ブロックチェーン"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 60,
    "category": "テクノロジ系",
    "body": "コンピュータの記憶階層におけるキャッシュメモリ，主記憶及び補助記憶と，それぞれに用いられる記憶装置の組合せとして，適切なものはどれか。\n[表: ア キャッシュメモリ:DRAM 主記憶:HDD 補助記憶:DVD / イ キャッシュメモリ:DRAM 主記憶:SSD 補助記憶:SRAM / ウ キャッシュメモリ:SRAM 主記憶:DRAM 補助記憶:SSD / エ キャッシュメモリ:SRAM 主記憶:HDD 補助記憶:DRAM]",
    "choices": {
      "ア": "キャッシュメモリ: DRAM / 主記憶: HDD / 補助記憶: DVD",
      "イ": "キャッシュメモリ: DRAM / 主記憶: SSD / 補助記憶: SRAM",
      "ウ": "キャッシュメモリ: SRAM / 主記憶: DRAM / 補助記憶: SSD",
      "エ": "キャッシュメモリ: SRAM / 主記憶: HDD / 補助記憶: DRAM"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 61,
    "category": "テクノロジ系",
    "body": "IPA\"組織における内部不正防止ガイドライン（第4版）\"にも記載されている，内部不正防止の取組として適切なものだけを全て挙げたものはどれか。\na システム管理者を決めるときには，高い規範意識をもつ者を一人だけ任命し，全ての権限をその管理者に集中させる。\nb 重大な不正を犯した内部不正者に対しては組織としての処罰を検討するとともに，再発防止の措置を実施する。\nc 内部不正対策は経営者の責任であり，経営者は基本となる方針を組織内外に示す\"基本方針\"を策定し，役職員に周知徹底する。",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, c",
      "ウ": "a, c",
      "エ": "b, c"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 62,
    "category": "テクノロジ系",
    "body": "下から上へ品物を積み上げて，上にある品物から順に取り出す装置がある。この装置に対する操作は，次の二つに限られる。\nPUSH x：品物xを1個積み上げる。\nPOP：一番上の品物を1個取り出す。\n[図: PUSH→箱(上から取り出し)→POP のスタック構造]\n最初は何も積まれていない状態から開始して，a, b, cの順で三つの品物が到着する。一つの装置だけを使った場合，POP操作で取り出される品物の順番としてあり得ないものはどれか。",
    "choices": {
      "ア": "a, b, c",
      "イ": "b, a, c",
      "ウ": "c, a, b",
      "エ": "c, b, a"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 63,
    "category": "テクノロジ系",
    "body": "チェーンメールの特徴として，適切なものだけを全て挙げたものはどれか。\na グループ内の連絡や情報共有目的で利用される。\nb ネットワークやサーバに，無駄な負荷をかける。\nc 返信に対する返信を，お互いに何度も繰り返す。\nd 本文中に，多数への転送を煽る文言が記されている。",
    "choices": {
      "ア": "a, c",
      "イ": "a, d",
      "ウ": "b, c",
      "エ": "b, d"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 64,
    "category": "テクノロジ系",
    "body": "データベース管理システムにおける排他制御の目的として，適切なものはどれか。",
    "choices": {
      "ア": "誤ってデータを修正したり，データを故意に改ざんされたりしないようにする。",
      "イ": "データとプログラムを相互に独立させることによって，システムの維持管理を容易にする。",
      "ウ": "データの機密のレベルに応じて，特定の人しかアクセスできないようにする。",
      "エ": "複数のプログラムが同一のデータに同時にアクセスしたときに，データの不整合が生じないようにする。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 65,
    "category": "テクノロジ系",
    "body": "NATに関する次の記述中のa，bに入れる字句の適切な組合せはどれか。\nNATは，職場や家庭のLANをインターネットへ接続するときによく利用され，[a]と[b]を相互に変換する。",
    "choices": {
      "ア": "a: プライベートIPアドレス / b: MACアドレス",
      "イ": "a: プライベートIPアドレス / b: グローバルIPアドレス",
      "ウ": "a: ホスト名 / b: MACアドレス",
      "エ": "a: ホスト名 / b: グローバルIPアドレス"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 66,
    "category": "テクノロジ系",
    "body": "関係データベースにおいて，主キーを設定する理由はどれか。",
    "choices": {
      "ア": "算術演算の対象とならないことが明確になる。",
      "イ": "主キーを設定した列が検索できるようになる。",
      "ウ": "他の表からの参照を防止できるようになる。",
      "エ": "表中のレコードを一意に識別できるようになる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 67,
    "category": "テクノロジ系",
    "body": "重要な情報を保管している部屋がある。この部屋への不正な入室及び室内での重要な情報への不正アクセスに関する対策として，最も適切なものはどれか。",
    "choices": {
      "ア": "警備員や監視カメラによって，入退室確認と室内での作業監視を行う。",
      "イ": "室内では，入室の許可証をほかの人から見えない場所に着用させる。",
      "ウ": "入退室管理は有人受付とはせず，カード認証などの電子的方法だけにする。",
      "エ": "部屋の存在とそこで保管している情報を，全社員に周知する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 68,
    "category": "テクノロジ系",
    "body": "1年前に作成した情報セキュリティポリシについて，適切に運用されていることを確認するための監査を行った。この活動はPDCAサイクルのどれに該当するか。",
    "choices": {
      "ア": "P",
      "イ": "D",
      "ウ": "C",
      "エ": "A"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 69,
    "category": "テクノロジ系",
    "body": "ブログにおけるトラックバックの説明として，適切なものはどれか。",
    "choices": {
      "ア": "一般利用者が，気になるニュースへのリンクやコメントなどを投稿するサービス",
      "イ": "ネットワーク上にブックマークを登録することによって，利用価値の高いWebサイト情報を他の利用者と共有するサービス",
      "ウ": "ブログに貼り付けたボタンをクリックすることで，SNSなどのソーシャルメディア上でリンクなどの情報を共有する機能",
      "エ": "別の利用者のブログ記事へのリンクを張ると，リンクが張られた相手に対してその旨を通知する仕組み"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 70,
    "category": "テクノロジ系",
    "body": "大文字の英字から成る文字列の暗号化を考える。暗号化の手順と例は次のとおりである。この手順で暗号化した結果が\"EGE\"であるとき，元の文字列はどれか。\n[表: 暗号化の手順と例(\"FAX\"の暗号化)]\n手順1: 表から英字を文字番号に変換する。 処理前:FAX → 処理後:5,0,23\n手順2: 1文字目に1, 2文字目に2, n文字目にnを加算する。 処理前:5,0,23 → 処理後:6,2,26\n手順3: 26で割った余りを新たな文字番号とする。 処理前:6,2,26 → 処理後:6,2,0\n手順4: 表から文字番号を英字に変換する。 処理前:6,2,0 → 処理後:GCA\n[英字-文字番号対応表: A=0, B=1, C=2, D=3, E=4, F=5, G=6, H=7, I=8, J=9, K=10, L=11, M=12, N=13, O=14, P=15, Q=16, R=17, S=18, T=19, U=20, V=21, W=22, X=23, Y=24, Z=25]",
    "choices": {
      "ア": "BED",
      "イ": "DEB",
      "ウ": "FIH",
      "エ": "HIF"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 71,
    "category": "テクノロジ系",
    "body": "複数のIoTデバイスとそれらを管理するIoTサーバで構成されるIoTシステムにおける，エッジコンピューティングに関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "IoTサーバ上のデータベースの複製を別のサーバにも置き，両者を常に同期させて運用する。",
      "イ": "IoTデバイス群の近くにコンピュータを配置して，IoTサーバの負荷低減とIoTシステムのリアルタイム性向上に有効な処理を行わせる。",
      "ウ": "IoTデバイスとIoTサーバ間の通信負荷の状況に応じて，ネットワークの構成を自動的に最適化する。",
      "エ": "IoTデバイスを少ない電力で稼働させて，一般的な電池で長期間の連続運用を行う。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 72,
    "category": "テクノロジ系",
    "body": "3人の候補者の中から兼任も許す方法で委員長と書記を1名ずつ選ぶ場合，3人の中から委員長1名の選び方が3通りで，3人の中から書記1名の選び方が3通りであるので，委員長と書記の選び方は全部で9通りある。5人の候補者の中から兼任も許す方法で委員長と書記を1名ずつ選ぶ場合，選び方は何通りあるか。",
    "choices": {
      "ア": "5",
      "イ": "10",
      "ウ": "20",
      "エ": "25"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 73,
    "category": "テクノロジ系",
    "body": "IoT機器やPCに保管されているデータを暗号化するためのセキュリティチップであり，暗号化に利用する鍵などの情報をチップの内部に記憶しており，外部から内部の情報の取出しが困難な構造をもつものはどれか。",
    "choices": {
      "ア": "GPU",
      "イ": "NFC",
      "ウ": "TLS",
      "エ": "TPM"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 74,
    "category": "テクノロジ系",
    "body": "サーバ仮想化の特長として，適切なものはどれか。",
    "choices": {
      "ア": "1台のコンピュータを複数台のサーバであるかのように動作させることができるので，物理的資源を需要に応じて柔軟に配分することができる。",
      "イ": "コンピュータの機能をもったブレードを必要な数だけ筐体に差し込んでサーバを構成するので，柔軟に台数を増減することができる。",
      "ウ": "サーバを構成するコンピュータを他のサーバと接続せずに利用するので，セキュリティを向上させることができる。",
      "エ": "サーバを構成する複数のコンピュータが同じ処理を実行して処理結果を照合するので，信頼性を向上させることができる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 75,
    "category": "テクノロジ系",
    "body": "アクティビティトラッカの説明として，適切なものはどれか。",
    "choices": {
      "ア": "PCやタブレットなどのハードウェアのROMに組み込まれたソフトウェア",
      "イ": "一定期間は無料で使用できるが，継続して使用する場合は，著作権者が金銭などの対価を求めるソフトウェアの配布形態の一つ，又はそのソフトウェア",
      "ウ": "ソーシャルメディアで提供される，友人や知人の活動状況や更新履歴を配信する機能",
      "エ": "歩数や運動時間，睡眠時間などを，搭載された各種センサによって計測するウェアラブル機器"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 76,
    "category": "テクノロジ系",
    "body": "ある商品の月別の販売数を基に売上に関する計算を行う。セルB1に商品の単価が，セルB3～B7に各月の商品の販売数が入力されている。セルC3に計算式\"B$1*合計(B$3:B3)／個数(B$3:B3)\"を入力して，セルC4～C7に複写したとき，セルC5に表示される値は幾らか。\n[表: A1:単価 B1:1,000 / A2:月 B2:販売数 C2:計算結果 / A3:4月 B3:10 / A4:5月 B4:8 / A5:6月 B5:0 / A6:7月 B6:4 / A7:8月 B7:5]",
    "choices": {
      "ア": "6",
      "イ": "6,000",
      "ウ": "9,000",
      "エ": "18,000"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 77,
    "category": "テクノロジ系",
    "body": "無線LANに関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "アクセスポイントの不正利用対策が必要である。",
      "イ": "暗号化の規格はWPA2に限定されている。",
      "ウ": "端末とアクセスポイント間の距離に関係なく通信できる。",
      "エ": "無線LANの規格は複数あるが，全て相互に通信できる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 78,
    "category": "テクノロジ系",
    "body": "部外秘とすべき電子ファイルがある。このファイルの機密性を確保するために使用するセキュリティ対策技術として，適切なものはどれか。",
    "choices": {
      "ア": "アクセス制御",
      "イ": "タイムスタンプ",
      "ウ": "ディジタル署名",
      "エ": "ホットスタンバイ"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 79,
    "category": "テクノロジ系",
    "body": "Aさんが，Pさん，Qさん及びRさんの3人に電子メールを送信した。Toの欄にはPさんのメールアドレスを，Ccの欄にはQさんのメールアドレスを，Bccの欄にはRさんのメールアドレスをそれぞれ指定した。電子メールを受け取ったPさん，Qさん及びRさんのうち，同じ内容の電子メールがPさん，Qさん及びRさんの3人に送られていることを知ることができる人だけを全て挙げたものはどれか。",
    "choices": {
      "ア": "Pさん，Qさん，Rさん",
      "イ": "Pさん，Rさん",
      "ウ": "Qさん，Rさん",
      "エ": "Rさん"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 80,
    "category": "テクノロジ系",
    "body": "パスワードの解読方法の一つとして，全ての文字の組合せを試みる総当たり攻撃がある。\"A\"から\"Z\"の26種類の文字を使用できるパスワードにおいて，文字数を4文字から6文字に増やすと，総当たり攻撃でパスワードを解読するための最大の試行回数は何倍になるか。",
    "choices": {
      "ア": "2",
      "イ": "24",
      "ウ": "52",
      "エ": "676"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 81,
    "category": "テクノロジ系",
    "body": "IoTシステム向けに使われる無線ネットワークであり，一般的な電池で数年以上の運用が可能な省電力性と，最大で数十kmの通信が可能な広域性を有するものはどれか。",
    "choices": {
      "ア": "LPWA",
      "イ": "MDM",
      "ウ": "SDN",
      "エ": "WPA2"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 82,
    "category": "テクノロジ系",
    "body": "次の体系をもつ電話番号において，80億個の番号を創出したい。番号の最低限必要な桁数は幾つか。ここで，桁数には\"020\"を含むこととする。\n[図: 020□□…□ の形式。\"020\"の直後の桁は1～3及び5～9のいずれかを指定。それ以降の各桁に0～9のいずれかを指定]",
    "choices": {
      "ア": "11",
      "イ": "12",
      "ウ": "13",
      "エ": "14"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 83,
    "category": "テクノロジ系",
    "body": "ファイルの階層構造に関する次の記述中のa，bに入れる字句の適切な組合せはどれか。\n階層型ファイルシステムにおいて，最上位の階層のディレクトリを[a]ディレクトリという。ファイルの指定方法として，カレントディレクトリを基点として目的のファイルまでのすべてのパスを記述する方法と，ルートディレクトリを基点として目的のファイルまでの全てのパスを記述する方法がある。ルートディレクトリを基点としたファイルの指定方法を[b]パス指定という。",
    "choices": {
      "ア": "a: カレント / b: 絶対",
      "イ": "a: カレント / b: 相対",
      "ウ": "a: ルート / b: 絶対",
      "エ": "a: ルート / b: 相対"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 84,
    "category": "テクノロジ系",
    "body": "内外に宣言する最上位の情報セキュリティポリシに記載することとして，最も適切なものはどれか。",
    "choices": {
      "ア": "経営陣が情報セキュリティに取り組む姿勢",
      "イ": "情報資産を守るための具体的で詳細な手順",
      "ウ": "セキュリティ対策に掛ける費用",
      "エ": "守る対象とする具体的な個々の情報資産"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 85,
    "category": "テクノロジ系",
    "body": "電子メールの内容が改ざんされていないことの確認に利用するものはどれか。",
    "choices": {
      "ア": "IMAP",
      "イ": "SMTP",
      "ウ": "情報セキュリティポリシ",
      "エ": "ディジタル署名"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 86,
    "category": "テクノロジ系",
    "body": "情報セキュリティのリスクマネジメントにおけるリスク対応を，リスクの移転，回避，受容及び低減の四つに分類するとき，リスクの低減の例として，適切なものはどれか。",
    "choices": {
      "ア": "インターネット上で，特定利用者に対して，機密に属する情報の提供サービスを行っていたが，情報漏えいのリスクを考慮して，そのサービスから撤退する。",
      "イ": "個人情報が漏えいした場合に備えて，保険に加入する。",
      "ウ": "サーバ室には限られた管理者しか入室できず，機器盗難のリスクは低いので，追加の対策は行わない。",
      "エ": "ノートPCの紛失，盗難による情報漏えいに備えて，ノートPCのHDDに保存する情報を暗号化する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 87,
    "category": "テクノロジ系",
    "body": "売上伝票のデータを関係データベースの表で管理することを考える。売上伝票の表を設計するときに，表を構成するフィールドの関連性を分析し，データの重複及び不整合が発生しないように，複数の表に分ける作業はどれか。",
    "choices": {
      "ア": "結合",
      "イ": "射影",
      "ウ": "正規化",
      "エ": "排他制御"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 88,
    "category": "テクノロジ系",
    "body": "バイオメトリクス認証の例として，適切なものはどれか。",
    "choices": {
      "ア": "本人の手の指の静脈の形で認証する。",
      "イ": "本人の電子証明書で認証する。",
      "ウ": "読みにくい文字列が写った画像から文字を正確に読み取れるかどうかで認証する。",
      "エ": "ワンタイムパスワードを用いて認証する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 89,
    "category": "テクノロジ系",
    "body": "OSS（Open Source Software）に関する記述のうち，適切なものだけを全て挙げたものはどれか。\n① Webサーバとして広く用いられているApache HTTP ServerはOSSである。\n② WebブラウザであるInternet ExplorerはOSSである。\n③ ワープロソフトや表計算ソフト，プレゼンテーションソフトなどを含むビジネス統合パッケージは開発されていない。",
    "choices": {
      "ア": "①",
      "イ": "①, ②",
      "ウ": "②, ③",
      "エ": "③"
    },
    "answer": "ア"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 90,
    "category": "テクノロジ系",
    "body": "交通機関，店頭，公共施設などの場所で，ネットワークに接続したディスプレイなどの電子的な表示機器を使って情報を発信するシステムはどれか。",
    "choices": {
      "ア": "cookie",
      "イ": "RSS",
      "ウ": "ディジタルサイネージ",
      "エ": "ディジタルデバイド"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 91,
    "category": "テクノロジ系",
    "body": "ネットワークにおけるDNSの役割として，適切なものはどれか。",
    "choices": {
      "ア": "クライアントからのIPアドレス割当て要求に対し，プールされたIPアドレスの中から未使用のIPアドレスを割り当てる。",
      "イ": "クライアントからのファイル転送要求を受け付け，クライアントへファイルを転送したり，クライアントからのファイルを受け取って保管したりする。",
      "ウ": "ドメイン名とIPアドレスの対応付けを行う。",
      "エ": "メール受信者からの読出し要求に対して，メールサーバが受信したメールを転送する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 92,
    "category": "テクノロジ系",
    "body": "外部と通信するメールサーバをDMZに設置する理由として，適切なものはどれか。",
    "choices": {
      "ア": "機密ファイルが添付された電子メールが，外部に送信されるのを防ぐため",
      "イ": "社員が外部の取引先へ送信する際に電子メールの暗号化を行うため",
      "ウ": "メーリングリストのメンバのメールアドレスが外部に漏れないようにするため",
      "エ": "メールサーバを踏み台にして，外部から社内ネットワークに侵入させないため"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 93,
    "category": "テクノロジ系",
    "body": "ディジタル署名やブロックチェーンなどで利用されているハッシュ関数の特徴に関する，次の記述中のa，bに入れる字句の適切な組合せはどれか。\nハッシュ関数によって，同じデータは，[a]ハッシュ値に変換され，変換後のハッシュ値から元のデータを復元することが[b]。",
    "choices": {
      "ア": "a: 都度異なる / b: できない",
      "イ": "a: 都度異なる / b: できる",
      "ウ": "a: 常に同じ / b: できない",
      "エ": "a: 常に同じ / b: できる"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 94,
    "category": "テクノロジ系",
    "body": "NTPの利用によって実現できることとして，適切なものはどれか。",
    "choices": {
      "ア": "OSの自動バージョンアップ",
      "イ": "PCのBIOSの設定",
      "ウ": "PCやサーバなどの時刻合わせ",
      "エ": "ネットワークに接続されたPCの遠隔起動"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 95,
    "category": "テクノロジ系",
    "body": "プロセッサに関する次の記述中のa，bに入れる字句の適切な組合せはどれか。\n[a]は[b]処理用に開発されたプロセッサである。CPUに内蔵されている場合も多いが，より高度な[b]処理を行う場合には，高性能な[a]を搭載した拡張ボードを用いることもある。",
    "choices": {
      "ア": "a: GPU / b: 暗号化",
      "イ": "a: GPU / b: 画像",
      "ウ": "a: VGA / b: 暗号化",
      "エ": "a: VGA / b: 画像"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 96,
    "category": "テクノロジ系",
    "body": "販売管理システムに関する記述のうち，TCOに含まれる費用だけを全て挙げたものはどれか。\n① 販売管理システムで扱う商品の仕入高\n② 販売管理システムで扱う商品の配送費\n③ 販売管理システムのソフトウェア保守費\n④ 販売管理システムのハードウェア保守費",
    "choices": {
      "ア": "①, ②",
      "イ": "①, ④",
      "ウ": "②, ③",
      "エ": "③, ④"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 97,
    "category": "テクノロジ系",
    "body": "情報セキュリティの三大要素である機密性，完全性及び可用性に関する記述のうち，最も適切なものはどれか。",
    "choices": {
      "ア": "可用性を確保することは，利用者が不用意に情報漏えいをしてしまうリスクを下げることになる。",
      "イ": "完全性を確保する方法の例として，システムや設備を二重化して利用者がいつでも利用できるような環境を維持することがある。",
      "ウ": "機密性と可用性は互いに反する側面をもっているので，実際の運用では両者をバランスよく確保することが求められる。",
      "エ": "機密性を確保する方法の例として，データの滅失を防ぐためのバックアップや誤入力を防ぐための入力チェックがある。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 98,
    "category": "テクノロジ系",
    "body": "攻撃者が他人のPCにランサムウェアを感染させる狙いはどれか。",
    "choices": {
      "ア": "PC内の個人情報をネットワーク経由で入手する。",
      "イ": "PC内のファイルを使用不能にし，解除と引換えに金銭を得る。",
      "ウ": "PCのキーボードで入力された文字列を，ネットワーク経由で入手する。",
      "エ": "PCへの動作指示をネットワーク経由で送り，PCを不正に操作する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 99,
    "category": "テクノロジ系",
    "body": "ワイルドカードに関する次の記述中のa，bに入れる字句の適切な組合せはどれか。\n任意の1文字を表す\"?\"と，長さゼロ以上の任意の文字列を表す\"*\"を使った文字列の検索について考える。[a]では，\"データ\"を含む全ての文字列が該当する。また，[b]では，\"データ\"で終わる全ての文字列が該当する。",
    "choices": {
      "ア": "a: ?データ* / b: ?データ",
      "イ": "a: ?データ* / b: *データ",
      "ウ": "a: *データ* / b: ?データ",
      "エ": "a: *データ* / b: *データ"
    },
    "answer": "エ"
  },
  {
    "exam": "2019r01a",
    "examLabel": "R01秋",
    "number": 100,
    "category": "テクノロジ系",
    "body": "脆弱性のあるIoT機器が幾つかの企業に多数設置されていた。その機器の1台にマルウェアが感染し，他の多数のIoT機器にマルウェア感染が拡大した。ある日のある時刻に，マルウェアに感染した多数のIoT機器が特定のWebサイトへ一斉に大量のアクセスを行い，Webサイトのサービスを停止に追い込んだ。このWebサイトが受けた攻撃はどれか。",
    "choices": {
      "ア": "DDoS攻撃",
      "イ": "クロスサイトスクリプティング",
      "ウ": "辞書攻撃",
      "エ": "ソーシャルエンジニアリング"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 1,
    "category": "ストラテジ系",
    "body": "情報システムの調達の際に作成される文書に関して，次の記述中のa, bに入れる字句の適切な組合せはどれか。\n調達する情報システムの概要や提案依頼事項，調達条件などを明示して提案書の提出を依頼する文書は a である。また，システム化の目的や業務概要などを示すことによって，関連する情報の提供を依頼する文書は b である。",
    "choices": {
      "ア": "a: RFI / b: RFP",
      "イ": "a: RFI / b: SLA",
      "ウ": "a: RFP / b: RFI",
      "エ": "a: RFP / b: SLA"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 2,
    "category": "ストラテジ系",
    "body": "企業が社会の信頼に応えていくために，法令を遵守することはもちろん，社会的規範などの基本的なルールに従って活動する，いわゆるコンプライアンスが求められている。a～dのうち，コンプライアンスとして考慮しなければならないものだけを全て挙げたものはどれか。\na 交通ルールの遵守\nb 公務員接待の禁止\nc 自社の就業規則の遵守\nd 他者の知的財産権の尊重",
    "choices": {
      "ア": "a, b, c",
      "イ": "a, b, c, d",
      "ウ": "a, c, d",
      "エ": "b, c, d"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 3,
    "category": "ストラテジ系",
    "body": "技術経営における新事業創出のプロセスを，研究，開発，事業化，産業化の四つに分類したとき，事業化から産業化を達成し，企業の業績に貢献するためには，新市場の立上げや競合製品の登場などの障壁がある。この障壁を意味する用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "囚人のジレンマ",
      "イ": "ダーウィンの海",
      "ウ": "ファイアウォール",
      "エ": "ファイブフォース"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 4,
    "category": "ストラテジ系",
    "body": "コンビニエンスストアを全国にチェーン展開するA社では，過去10年間にわたる各店舗の詳細な販売データが本部に蓄積されている。これらの販売データと，過去10年間の気象データ，及び各店舗近隣のイベント情報との関係を分析して，気象条件，イベント情報と商品の販売量との関連性を把握し，1週間先までの天気予報とイベント情報から店舗ごとの販売予想をより高い精度で行うシステムを構築したい。このとき活用する技術として，最も適切なものはどれか。",
    "choices": {
      "ア": "IoTを用いたセンサなどからの自動データ収集技術",
      "イ": "仮想空間で現実のような体験を感じることができる仮想現実技術",
      "ウ": "ディープラーニングなどのAI技術",
      "エ": "表計算ソフトを用いて統計分析などを行う技術"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 5,
    "category": "ストラテジ系",
    "body": "製造業における標準化の事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "作業負荷の均衡を図り，かつ，前工程から引き取る部品の種類と量を平準化した。",
      "イ": "生産活動を合理化するために，製造に必要な部品や手順を統一した。",
      "ウ": "生産管理プログラムの実行速度を向上させるために，最適なアルゴリズムを選択した。",
      "エ": "製品の種類の削減や作業内容の見直しを通じて，生産計画，生産工程，作業方法を簡素化した。"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 6,
    "category": "ストラテジ系",
    "body": "BSC（Balanced Scorecard）に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "企業や組織のビジョンと戦略を，四つの視点（\"財務の視点\"，\"顧客の視点\"，\"業務プロセスの視点\"，\"成長と学習の視点\"）から具体的な行動へと変換して計画・管理し，戦略の立案と実行・評価を支援するための経営管理手法である。",
      "イ": "製品やサービスを顧客に提供するという企業活動を，調達，開発，製造，販売，サービスといったそれぞれの業務が，一連の流れの中で順次，価値とコストを付加・蓄積していくものと捉え，この連鎖的な活動によって顧客に向けた最終的な\"価値\"が生み出されるとする考え方のことである。",
      "ウ": "多種類の製品を生産・販売したり，複数の事業を行ったりしている企業が，戦略的観点から経営資源の配分が最も効率的・効果的となる製品・事業相互の組合せを決定するための経営分析手法のことである。",
      "エ": "目標を達成するために意思決定を行う組織や個人の，プロジェクトやベンチャービジネスなどにおける，強み，弱み，機会，脅威を評価するのに用いられる経営戦略手法のことである。"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 7,
    "category": "ストラテジ系",
    "body": "蓄積されている会計，販売，購買，顧客などの様々なデータを，迅速かつ効果的に検索，分析する機能をもち，経営者などの意思決定を支援することを目的としたものはどれか。",
    "choices": {
      "ア": "BIツール",
      "イ": "POSシステム",
      "ウ": "電子ファイリングシステム",
      "エ": "ワークフローシステム"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 8,
    "category": "ストラテジ系",
    "body": "電力会社において，人による検針の代わりに，インターネットに接続された電力メータと通信することで，各家庭の電力使用量を遠隔計測するといったことが行われている。この事例のように，様々な機器をインターネットに接続して情報を活用する仕組みを表す用語はどれか。",
    "choices": {
      "ア": "EDI",
      "イ": "IoT",
      "ウ": "ISP",
      "エ": "RFID"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 9,
    "category": "ストラテジ系",
    "body": "国連が中心となり，持続可能な世界を実現するために設定した17のゴールから成る国際的な開発目標はどれか。",
    "choices": {
      "ア": "COP21",
      "イ": "SDGs",
      "ウ": "UNESCO",
      "エ": "WHO"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 10,
    "category": "ストラテジ系",
    "body": "IoTに関する事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "インターネット上に自分のプロファイルを公開し，コミュニケーションの輪を広げる。",
      "イ": "インターネット上の店舗や通信販売のWebサイトにおいて，ある商品を検索すると，類似商品の広告が表示される。",
      "ウ": "学校などにおける授業や講義をあらかじめ録画し，インターネットで配信する。",
      "エ": "発電設備の運転状況をインターネット経由で遠隔監視し，発電設備の性能管理，不具合の予兆検知及び補修対応に役立てる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 11,
    "category": "ストラテジ系",
    "body": "あるレストランでは，受付時に来店した客の名前を来店客リストに記入し，座席案内時に来店客リストと空席状況の両方を参照している。この一連の業務をDFDで表現したものとして，最も適切なものはどれか。（図についてはPDFを参照。選択肢はDFD図である。）",
    "choices": {
      "ア": "受付→来店客リスト, 来店客リスト→座席案内, 空席状況→座席案内",
      "イ": "受付→来店客リスト, 来店客リスト→座席案内, 座席案内→空席状況",
      "ウ": "受付→来店客リスト, 来店客リスト→座席案内, 空席状況→座席案内（受付と座席案内間にもフローあり）",
      "エ": "受付→来店客リスト, 来店客リスト→座席案内, 空席状況→座席案内（全データストアから座席案内へフロー）"
    },
    "answer": "エ",
    "image": "img/2020r02o_q11.png"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 12,
    "category": "ストラテジ系",
    "body": "A社では，設計までをA社で行ったプログラムの開発を，請負契約に基づきB社に委託して行う形態と，B社から派遣契約に基づき派遣されたC氏が行う形態を比較検討している。開発されたプログラムの著作権の帰属に関する規定が会社間の契約で定められていないとき，著作権の帰属先はどれか。",
    "choices": {
      "ア": "請負契約ではA社に帰属し，派遣契約ではA社に帰属する。",
      "イ": "請負契約ではA社に帰属し，派遣契約ではC氏に帰属する。",
      "ウ": "請負契約ではB社に帰属し，派遣契約ではA社に帰属する。",
      "エ": "請負契約ではB社に帰属し，派遣契約ではC氏に帰属する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 13,
    "category": "ストラテジ系",
    "body": "情報の取扱いに関する不適切な行為a～cのうち，不正アクセス禁止法で定められている禁止行為に該当するものだけを全て挙げたものはどれか。\na オフィス内で拾った手帳に記載されていた他人のIDとパスワードを無断で使い，ネットワークを介して自社のサーバにログインし，サーバに格納されていた人事評価情報を閲覧した。\nb 自分には閲覧権限のない人事評価情報を盗み見するために，他人のネットワークIDとパスワードを無断で入手し，自分の手帳に記録した。\nc 部門の保管庫に保管されていた人事評価情報が入ったUSBメモリを上司に無断で持ち出し，自分のPCに直接接続してその人事評価情報をコピーした。",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "a, b, c",
      "エ": "b, c"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 14,
    "category": "ストラテジ系",
    "body": "ウェアラブルデバイスを用いている事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "PCやタブレット端末を利用して，ネットワーク経由で医師の診療を受ける。",
      "イ": "スマートウォッチで血圧や体温などの測定データを取得し，異常を早期に検知する。",
      "ウ": "複数の病院のカルテを電子化したデータをクラウドサーバで管理し，データの共有を行う。",
      "エ": "ベッドに人感センサを設置し，一定期間センサに反応がない場合に通知を行う。"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 15,
    "category": "ストラテジ系",
    "body": "SCMの説明として，適切なものはどれか。",
    "choices": {
      "ア": "営業，マーケティング，アフターサービスなど，部門間で情報や業務の流れを統合し，顧客満足度と自社利益を最大化する。",
      "イ": "調達，生産，流通を経て消費者に至るまでの一連の業務を，取引先を含めて全体最適の視点から見直し，納期短縮や在庫削減を図る。",
      "ウ": "顧客ニーズに適合した製品及びサービスを提供することを目的として，業務全体を最適な形に革新・再設計する。",
      "エ": "調達，生産，販売，財務・会計，人事などの基幹業務を一元的に管理し，経営資源の最適化と経営の効率化を図る。"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 16,
    "category": "ストラテジ系",
    "body": "新製品の開発に当たって生み出される様々な成果a～cのうち，特許法による保護の対象となり得るものだけを全て挙げたものはどれか。\na 機能を実現するために考え出された独創的な発明\nb 新製品の形状，模様，色彩など，斬新的な発想で創作されたデザイン\nc 新製品発表に向けて考え出された新製品のブランド名",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "a, b, c",
      "エ": "a, c"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 17,
    "category": "ストラテジ系",
    "body": "複数の企業が，研究開発を共同で行って新しい事業を展開したいと思っている。共同出資によって，新しい会社を組織する形態として，適切なものはどれか。",
    "choices": {
      "ア": "M&A",
      "イ": "クロスライセンス",
      "ウ": "ジョイントベンチャ",
      "エ": "スピンオフ"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 18,
    "category": "ストラテジ系",
    "body": "UX（User Experience）の説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "主に高齢者や障害者などを含め，できる限り多くの人が等しく利用しやすいように配慮したソフトウェア製品の設計",
      "イ": "顧客データの分析を基に顧客を識別し，コールセンタやインターネットなどのチャネルを用いて顧客との関係を深める手法",
      "ウ": "指定された条件の下で，利用者が効率よく利用できるソフトウェア製品の能力",
      "エ": "製品，システム，サービスなどの利用場面を想定したり，実際に利用したりすることによって得られる人の感じ方や反応"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 19,
    "category": "ストラテジ系",
    "body": "ディープラーニングを構成する技術の一つであり，人間の脳内にある神経回路を数学的なモデルで表現したものはどれか。",
    "choices": {
      "ア": "コンテンツデリバリネットワーク",
      "イ": "ストレージエリアネットワーク",
      "ウ": "ニューラルネットワーク",
      "エ": "ユビキタスネットワーク"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 20,
    "category": "ストラテジ系",
    "body": "労働者派遣は，通常の派遣と，将来の雇用を想定した紹介予定派遣の二つに分けられる。前者の労働者派遣の契約に当たり，派遣先が派遣元に要求する派遣労働者の受入条件として，適切なものはどれか。",
    "choices": {
      "ア": "候補者が備えるべきスキルの指定",
      "イ": "候補者の年齢及び性別の指定",
      "ウ": "候補者の派遣先による事前面接",
      "エ": "候補者の履歴書の派遣先への事前提出"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 21,
    "category": "ストラテジ系",
    "body": "横軸に相対マーケットシェア，縦軸に市場成長率を用いて自社の製品や事業の戦略的位置付けを分析する手法はどれか。",
    "choices": {
      "ア": "ABC分析",
      "イ": "PPM分析",
      "ウ": "SWOT分析",
      "エ": "バリューチェーン分析"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 22,
    "category": "ストラテジ系",
    "body": "AIの活用領域には音声認識，画像認識，自然言語処理などがある。音声認識と自然言語処理の両方が利用されているシステムの事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "ドアをノックする音を検知して，カメラの前に立っている人の顔を認識し，ドアのロックを解除する。",
      "イ": "人から話しかけられた天気や交通情報などの質問を解釈して，ふさわしい内容を回答する。",
      "ウ": "野外コンサートに来場する人の姿や話し声を検知して，会場の入り口を通過する人数を記録する。",
      "エ": "洋書に記載されている英文をカメラで読み取り，要約された日本文として編集する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 23,
    "category": "ストラテジ系",
    "body": "経営戦略と情報システム戦略の関係性の説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "経営戦略と情報システム戦略は，それぞれが相互に独立したものとして策定される。",
      "イ": "経営戦略の内容を踏まえて情報システム戦略が策定される。",
      "ウ": "情報システム戦略の内容を踏まえて経営戦略が策定される。",
      "エ": "情報システム戦略はIT部門の戦略であり，経営戦略は経営企画部門の戦略である。"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 24,
    "category": "ストラテジ系",
    "body": "CADの導入効果として，適切なものはどれか。",
    "choices": {
      "ア": "資材の所要量を把握して最適な発注ができる。",
      "イ": "生産工程の自動化と作業の無人化ができる。",
      "ウ": "生産に関連する一連のプロセスを統合的に管理できる。",
      "エ": "設計データを再利用して作業を効率化しやすくする。"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 25,
    "category": "ストラテジ系",
    "body": "サイバーセキュリティ基本法は，サイバーセキュリティに関する施策に関し，基本理念を定め，国や地方公共団体の責務などを定めた法律である。記述a～dのうち，この法律が国の基本的施策として定めているものだけを全て挙げたものはどれか。\na 国の行政機関等におけるサイバーセキュリティの確保\nb サイバーセキュリティ関連産業の振興及び国際競争力の強化\nc サイバーセキュリティ関連犯罪の取締り及び被害の拡大の防止\nd サイバーセキュリティに係る人材の確保",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "a, b, c",
      "エ": "a, b, c, d"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 26,
    "category": "ストラテジ系",
    "body": "全国に複数の支社をもつ大企業のA社は，大規模災害によって本社建物の全壊を想定したBCPを立案した。BCPの目的に照らし，A社のBCPとして，最も適切なものはどれか。",
    "choices": {
      "ア": "被災後に発生する火事による被害を防ぐために，カーテンなどの燃えやすいものを防炎品に取り替え，定期的な防火設備の点検を計画する。",
      "イ": "被災時に本社からの指示に対して迅速に対応するために，全支社の業務を停止して，本社から指示があるまで全社員を待機させる手順を整備する。",
      "ウ": "被災時にも事業を継続するために，本社機能を代替する支社を規定し，限られた状況で対応すべき重要な業務に絞り，その業務の実施手順を整備する。",
      "エ": "毎年の予算に本社建物への保険料を組み込み，被災前の本社建物と同規模の建物への移転に備える。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 27,
    "category": "ストラテジ系",
    "body": "企業間で商取引の情報の書式や通信手順を統一し，電子的に情報交換を行う仕組みはどれか。",
    "choices": {
      "ア": "EDI",
      "イ": "EIP",
      "ウ": "ERP",
      "エ": "ETC"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 28,
    "category": "ストラテジ系",
    "body": "新しい概念やアイディアの実証を目的とした，開発の前段階における検証を表す用語はどれか。",
    "choices": {
      "ア": "CRM",
      "イ": "KPI",
      "ウ": "PoC",
      "エ": "SLA"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 29,
    "category": "ストラテジ系",
    "body": "人間が行っていた定型的な事務作業を，ソフトウェアのロボットに代替させることによって，自動化や効率化を図る手段を表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "ROA",
      "イ": "RPA",
      "ウ": "SFA",
      "エ": "SOA"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 30,
    "category": "ストラテジ系",
    "body": "企業の収益性を測る指標の一つであるROEの\"E\"が表すものはどれか。",
    "choices": {
      "ア": "Earnings（所得）",
      "イ": "Employee（従業員）",
      "ウ": "Enterprise（企業）",
      "エ": "Equity（自己資本）"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 31,
    "category": "ストラテジ系",
    "body": "利用者と提供者をマッチングさせることによって，個人や企業が所有する自動車，住居，衣服などの使われていない資産を他者に貸与したり，提供者の空き時間に買い物代行，語学レッスンなどの役務を提供したりするサービスや仕組みはどれか。",
    "choices": {
      "ア": "クラウドコンピューティング",
      "イ": "シェアリングエコノミー",
      "ウ": "テレワーク",
      "エ": "ワークシェアリング"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 32,
    "category": "ストラテジ系",
    "body": "ある会社のECサイトでは，利用者からのチャットでの多様な問合せについて，オペレータが対応する仕組みから，ソフトウェアによる自動対応に変更した。このとき，利用者の過去のチャットの内容などを学習して，会話の流れから適切な回答を推測できる仕組みに変更するために使われた技術として，最も適切なものはどれか。",
    "choices": {
      "ア": "AI",
      "イ": "AR",
      "ウ": "CRM",
      "エ": "ERP"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 33,
    "category": "ストラテジ系",
    "body": "インターネット上で通信販売を行っているA社は，販売促進策として他社が発行するメールマガジンに自社商品Yの広告を出すことにした。広告は，メールマガジンの購読者が広告中のURLをクリックすると，その商品ページが表示される仕組みになっている。この販売促進策の前提を表のとおりとしたとき，この販売促進策での収支がマイナスとならないようにするためには，商品Yの販売価格は少なくとも何円以上である必要があるか。ここで，購入者による商品Yの購入は1人1個に限定されるものとする。また，他のコストは考えないものとする。\n[表: ①メールマガジンの購読者数 100,000人 / ②①のうち，広告中のURLをクリックする割合 2% / ③②のうち，商品Yを購入する割合 10% / ④商品Yの1個当たりの原価 1,000円 / ⑤販売促進策に掛かる費用の総額 200,000円]",
    "choices": {
      "ア": "1,020",
      "イ": "1,100",
      "ウ": "1,500",
      "エ": "2,000"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 34,
    "category": "ストラテジ系",
    "body": "営業利益を求める計算式はどれか。",
    "choices": {
      "ア": "（売上総利益）－（販売費及び一般管理費）",
      "イ": "（売上高）－（売上原価）",
      "ウ": "（経常利益）＋（特別利益）－（特別損失）",
      "エ": "（税引前当期純利益）－（法人税，住民税及び事業税）"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 35,
    "category": "ストラテジ系",
    "body": "ある企業が，フィンテックを活用した新サービスを実現するためのプログラムを開発しようとしている。そこで，デザイナ，プログラマなどを集めてチームを編成し，数日を掛けて集中的にプログラム開発作業に取り組み，その成果を競い合うイベントを企画した。このようなイベントを表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "ウォークスルー",
      "イ": "ゲーミフィケーション",
      "ウ": "ハッカソン",
      "エ": "ブレーンストーミング"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 36,
    "category": "マネジメント系",
    "body": "納入されたソフトウェアの一連のテストの中で，開発を発注した利用者が主体となって実施するテストはどれか。",
    "choices": {
      "ア": "受入れテスト",
      "イ": "結合テスト",
      "ウ": "システムテスト",
      "エ": "単体テスト"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 37,
    "category": "マネジメント系",
    "body": "開発対象のソフトウェアを，比較的短い期間で開発できる小さな機能の単位に分割しておき，各機能の開発が終了するたびにそれをリリースすることを繰り返すことで，ソフトウェアを完成させる。一つの機能の開発終了時に，次の開発対象とする機能の優先順位や内容を見直すことで，ビジネス環境の変化や利用者からの要望に対して，迅速に対応できることに主眼を置く開発手法はどれか。",
    "choices": {
      "ア": "アジャイル",
      "イ": "ウォータフォール",
      "ウ": "構造化",
      "エ": "リバースエンジニアリング"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 38,
    "category": "マネジメント系",
    "body": "サービス提供者と顧客双方の観点から，提供されるITサービスの品質の継続的な測定と改善に焦点を当てているベストプラクティスをまとめたものはどれか。",
    "choices": {
      "ア": "ITIL",
      "イ": "共通フレーム",
      "ウ": "システム管理基準",
      "エ": "内部統制"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 39,
    "category": "マネジメント系",
    "body": "A社のIT部門では，ヘルプデスクの可用性の向上を図るために，対応時間を24時間に拡大することを検討している。ヘルプデスク業務をA社から委託しているB社は，これを実現するためにチャットボットをB社が導入し，活用することによって，深夜時間帯は自動応答で対応する旨を提案したところ，A社は24時間対応が可能であるのでこれに合意した。合意に用いる文書として，適切なものはどれか。",
    "choices": {
      "ア": "BCP",
      "イ": "NDA",
      "ウ": "RFP",
      "エ": "SLA"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 40,
    "category": "マネジメント系",
    "body": "プロジェクトマネジメントの活動には，プロジェクト統合マネジメント，プロジェクトスコープマネジメント，プロジェクトスケジュールマネジメント，プロジェクトコストマネジメントなどがある。プロジェクト統合マネジメントの活動には，資源配分を決め，競合する目標や代替案間のトレードオフを調整することが含まれる。システム開発プロジェクトにおいて，当初の計画にない機能の追加を行う場合のプロジェクト統合マネジメントの活動として，適切なものはどれか。",
    "choices": {
      "ア": "機能追加に掛かる費用を見積もり，必要な予算を確保する。",
      "イ": "機能追加に対応するために，納期を変更するか要員を追加するかを検討する。",
      "ウ": "機能追加のために必要な作業や成果物を明確にし，WBSを更新する。",
      "エ": "機能追加のための所要期間を見積もり，スケジュールを変更する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 41,
    "category": "マネジメント系",
    "body": "システム監査の目的に関して，次の記述中のa, bに入れる字句の適切な組合せはどれか。\n情報システムに関わるリスクに対するコントロールの適切な整備・運用について，a のシステム監査人が b することによって，ITガバナンスの実現に寄与する。",
    "choices": {
      "ア": "a: 業務に精通した主管部門 / b: 構築",
      "イ": "a: 業務に精通した主管部門 / b: 評価",
      "ウ": "a: 独立かつ専門的な立場 / b: 構築",
      "エ": "a: 独立かつ専門的な立場 / b: 評価"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 42,
    "category": "マネジメント系",
    "body": "情報システム開発の詳細設計が終了し，プログラミングを外部のベンダに委託することにした。仕様，成果物及び作業の範囲を明確に定義した上で，プログラミングを委託先に請負契約で発注することにした。発注元のプロジェクトマネージャのマネジメント活動として，最も適切なものはどれか。",
    "choices": {
      "ア": "委託先に定期的な進捗報告を求めるとともに，完成したプログラムの品質を確認する。",
      "イ": "委託先の作業内容を詳細に確認し，生産性の低い要員の交代を指示する。",
      "ウ": "委託先の作業場所で，要員の出退勤を管理し，稼働状況を確認する。",
      "エ": "委託先の要員に余力がある場合，仕様変更に伴うプログラミングの作業を担当者に直接指示する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 43,
    "category": "マネジメント系",
    "body": "あるコールセンタでは，顧客からの電話による問合せに対応するオペレータを支援するシステムとして，顧客とオペレータの会話の音声を認識し，顧客の問合せに対する回答の候補をオペレータのPCの画面に表示するAIを導入した。1日の対応件数は1,000件であり，問合せ内容によって二つのグループA, Bに分けた。AI導入前後の各グループの対応件数，対応時間が表のとおりであるとき，AI導入後に，1日分の1,000件に対応する時間は何％短縮できたか。\n[表: グループA - AI導入前: 対応件数500件, 対応時間 全体の80% / AI導入後: 対応件数500件, 対応時間 AI導入前と比べて30%短縮 / グループB - AI導入前: 対応件数500件, 対応時間 全体の20% / AI導入後: 対応件数500件, 対応時間 AI導入前と同じ時間]",
    "choices": {
      "ア": "15",
      "イ": "16",
      "ウ": "20",
      "エ": "24"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 44,
    "category": "マネジメント系",
    "body": "次の作業はシステム開発プロセスのどの段階で実施されるか。\n実務に精通している利用者に参画してもらい，開発するシステムの具体的な利用方法について分析を行う。",
    "choices": {
      "ア": "システム要件定義",
      "イ": "システム設計",
      "ウ": "テスト",
      "エ": "プログラミング"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 45,
    "category": "マネジメント系",
    "body": "ITガバナンスの説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "企業が競争優位性構築を目的に，IT戦略の策定・実行をコントロールし，あるべき方向へ導く組織能力のこと",
      "イ": "事業のニーズを満たす良質のITサービスを実施すること",
      "ウ": "情報システムにまつわるリスクに対するコントロールが，適切に整備，運用されていることを第三者が評価すること",
      "エ": "情報セキュリティを確保，維持するために，技術的，物理的，人的，組織的な視点からの対策を，経営層を中心とした体制で組織的に行うこと"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 46,
    "category": "マネジメント系",
    "body": "開発担当者と運用担当者がお互いに協調し合い，バージョン管理や本番移行に関する自動化のツールなどを積極的に取り入れることによって，仕様変更要求などに対して迅速かつ柔軟に対応できるようにする取組を表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "DevOps",
      "イ": "WBS",
      "ウ": "プロトタイピング",
      "エ": "ペアプログラミング"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 47,
    "category": "マネジメント系",
    "body": "システム障害が発生した際，インシデント管理を担当するサービスデスクの役割として，適切なものはどれか。",
    "choices": {
      "ア": "既知の障害事象とその回避策の利用者への紹介",
      "イ": "システム障害対応後の利用者への教育",
      "ウ": "障害が発生している業務の代行処理",
      "エ": "障害の根本原因調査"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 48,
    "category": "マネジメント系",
    "body": "委託に基づき他社のシステム監査を実施するとき，システム監査人の行動として，適切なものはどれか。",
    "choices": {
      "ア": "委託元の経営者にとって不利にならないように監査を実施する。",
      "イ": "システム監査を実施する上で知り得た情報は，全て世間へ公開する。",
      "ウ": "指摘事項の多寡によって報酬を確定できる契約を結び監査を実施する。",
      "エ": "十分かつ適切な監査証拠を基に判断する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 49,
    "category": "マネジメント系",
    "body": "ある会社ではサービスデスクのサービス向上のために，チャットボットを導入することにした。チャットボットに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "PCでの定型的な入力作業を，ソフトウェアのロボットによって代替することができる仕組み",
      "イ": "人の会話の言葉を聞き取り，リアルタイムに文字に変換する仕組み",
      "ウ": "頻繁に寄せられる質問とそれに対する回答をまとめておき，利用者が自分で検索できる仕組み",
      "エ": "文字や音声による問合せ内容に対して，会話形式でリアルタイムに自動応答する仕組み"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 50,
    "category": "マネジメント系",
    "body": "プロジェクトメンバ間のコミュニケーションのルールを明確にするための施策として，適切なものはどれか。",
    "choices": {
      "ア": "作成すべき成果物を定義する。",
      "イ": "実際に使った費用を把握し，計画とのずれがあれば対策を講じる。",
      "ウ": "スケジュールを作成し，進捗管理を行う。",
      "エ": "プロジェクト情報の作成や配布の方法を明確にする。"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 51,
    "category": "マネジメント系",
    "body": "リバースエンジニアリングで実施する作業として，最も適切なものはどれか。",
    "choices": {
      "ア": "開発中のソフトウェアに対する変更要求などに柔軟に対応するために，短い期間の開発を繰り返す。",
      "イ": "試作品のソフトウェアを作成して，利用者による評価をフィードバックして開発する。",
      "ウ": "ソフトウェア開発において，上流から下流までを順番に実施する。",
      "エ": "プログラムを解析することで，ソフトウェアの仕様を調査して設計情報を抽出する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 52,
    "category": "マネジメント系",
    "body": "情報システム部門が受注システム及び会計システムの開発・運用業務を実施している。受注システムの利用者は営業部門であり，会計システムの利用者は経理部門である。財務報告に係る内部統制に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "内部統制は会計システムに係る事項なので，営業部門は関与せず，経理部門と情報システム部門が関与する。",
      "イ": "内部統制は経理業務に係る事項なので，経理部門だけが関与する。",
      "ウ": "内部統制は財務諸表などの外部報告に影響を与える業務に係る事項なので，営業部門，経理部門，情報システム部門が関与する。",
      "エ": "内部統制は手作業の業務に係る事項なので，情報システム部門は関与せず，営業部門と経理部門が関与する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 53,
    "category": "マネジメント系",
    "body": "プロジェクトのゴールなどを検討するに当たり，集団でアイディアを出し合った結果をグループ分けして体系的に整理する手法はどれか。",
    "choices": {
      "ア": "インタビュー",
      "イ": "親和図法",
      "ウ": "ブレーンストーミング",
      "エ": "プロトタイプ"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 54,
    "category": "マネジメント系",
    "body": "システム開発プロジェクトにおいて，テスト工程で使用するPCの納入が遅れることでテスト工程の終了が遅れるリスクがあり，対応策を決めた。リスク対応を回避，軽減，受容，転嫁の四つに分類するとき，受容に該当する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "全体のスケジュール遅延を防止するために，テスト要員を増員する。",
      "イ": "テスト工程の終了が遅れても本番稼働に影響を与えないように，プロジェクトに予備の期間を設ける。",
      "ウ": "テスト工程の遅延防止対策を実施する費用を納入業者が補償する契約を業者と結ぶ。",
      "エ": "テスト工程用のPCがなくてもテストを行える方法を準備する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 55,
    "category": "マネジメント系",
    "body": "図のアローダイアグラムにおいて，作業A（所要日数30～35日）と作業B（所要日数50～60日）が直列で，作業C（所要日数70～100日）が並列の工程を示している。図の工程の最短所要日数及び最長所要日数は何日か。",
    "choices": {
      "ア": "最短所要日数: 70 / 最長所要日数: 95",
      "イ": "最短所要日数: 70 / 最長所要日数: 100",
      "ウ": "最短所要日数: 80 / 最長所要日数: 95",
      "エ": "最短所要日数: 80 / 最長所要日数: 100"
    },
    "answer": "エ",
    "image": "img/2020r02o_q55.png"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 56,
    "category": "テクノロジ系",
    "body": "HTML形式の電子メールの特徴を悪用する攻撃はどれか。",
    "choices": {
      "ア": "DoS攻撃",
      "イ": "SQLインジェクション",
      "ウ": "悪意のあるスクリプトの実行",
      "エ": "辞書攻撃"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 57,
    "category": "テクノロジ系",
    "body": "次に示す項目を使って関係データベースで管理する\"社員\"表を設計する。他の項目から導出できる，冗長な項目はどれか。\n[表: 社員（社員番号, 社員名, 生年月日, 現在の満年齢, 住所, 趣味）]",
    "choices": {
      "ア": "生年月日",
      "イ": "現在の満年齢",
      "ウ": "住所",
      "エ": "趣味"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 58,
    "category": "テクノロジ系",
    "body": "受信した電子メールに添付されていた文書ファイルを開いたところ，PCの挙動がおかしくなった。疑われる攻撃として，適切なものはどれか。",
    "choices": {
      "ア": "SQLインジェクション",
      "イ": "クロスサイトスクリプティング",
      "ウ": "ショルダーハッキング",
      "エ": "マクロウイルス"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 59,
    "category": "テクノロジ系",
    "body": "仮想記憶を利用したコンピュータで，主記憶と補助記憶の間で内容の入替えが頻繁に行われていることが原因で処理性能が低下していることが分かった。この処理性能が低下している原因を除去する対策として，最も適切なものはどれか。ここで，このコンピュータの補助記憶装置は1台だけである。",
    "choices": {
      "ア": "演算能力の高いCPUと交換する。",
      "イ": "仮想記憶の容量を増やす。",
      "ウ": "主記憶装置の容量を増やす。",
      "エ": "補助記憶装置を大きな容量の装置に交換する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 60,
    "category": "テクノロジ系",
    "body": "暗号資産（仮想通貨）を入手するためのマイニングと呼ばれる作業を，他人のコンピュータを使って気付かれないように行うことを何と呼ぶか。",
    "choices": {
      "ア": "クリプトジャッキング",
      "イ": "ソーシャルエンジニアリング",
      "ウ": "バッファオーバフロー",
      "エ": "フィッシング"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 61,
    "category": "テクノロジ系",
    "body": "サーバの性能向上策に関する次の記述中のa, bに入れる字句の適切な組合せはどれか。\nあるシステムで，処理件数の増加に伴い，サーバの処理時間の増大が問題となっている。サーバの処理性能の向上策として，サーバの台数を増やして並行処理させて対応することを a という。サーバ自体を高性能のものに交換したり，CPUや主記憶などをより性能の良いものに替えたりなどして対応することを b という。",
    "choices": {
      "ア": "a: スケールアウト / b: スケールアップ",
      "イ": "a: スケールアップ / b: スケールアウト",
      "ウ": "a: スケールアップ / b: ダウンサイジング",
      "エ": "a: ダウンサイジング / b: スケールアップ"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 62,
    "category": "テクノロジ系",
    "body": "10進数155を2進数で表したものはどれか。",
    "choices": {
      "ア": "10011011",
      "イ": "10110011",
      "ウ": "11001101",
      "エ": "11011001"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 63,
    "category": "テクノロジ系",
    "body": "記述a～dのうち，クライアントサーバシステムの応答時間を短縮するための施策として，適切なものだけを全て挙げたものはどれか。\na クライアントとサーバ間の回線を高速化し，データの送受信時間を短くする。\nb クライアントの台数を増やして，クライアントの利用待ち時間を短くする。\nc クライアントの入力画面で，利用者がデータを入力する時間を短くする。\nd サーバを高性能化して，サーバの処理時間を短くする。",
    "choices": {
      "ア": "a, b, c",
      "イ": "a, d",
      "ウ": "b, c",
      "エ": "c, d"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 64,
    "category": "テクノロジ系",
    "body": "データ処理に関する記述a～cのうち，DBMSを導入することによって得られる効果だけを全て挙げたものはどれか。\na 同じデータに対して複数のプログラムから同時にアクセスしても，一貫性が保たれる。\nb 各トランザクションの優先度に応じて，処理する順番をDBMSが決めるので，リアルタイム処理の応答時間が短くなる。\nc 仮想記憶のページ管理の効率が良くなるので，データ量にかかわらずデータへのアクセス時間が一定になる。",
    "choices": {
      "ア": "a",
      "イ": "a, c",
      "ウ": "b",
      "エ": "b, c"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 65,
    "category": "テクノロジ系",
    "body": "PCやスマートフォンなどの表示画面の画像処理用のチップとして用いられているほか，AIにおける膨大な計算処理にも利用されているものはどれか。",
    "choices": {
      "ア": "AR",
      "イ": "DVI",
      "ウ": "GPU",
      "エ": "MPEG"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 66,
    "category": "テクノロジ系",
    "body": "バイオメトリクス認証で利用する身体的特徴に関する次の記述中のa, bに入れる字句の適切な組合せはどれか。\nバイオメトリクス認証における本人の身体的特徴としては，a が難しく，b が小さいものが優れている。",
    "choices": {
      "ア": "a: 偽造 / b: 経年変化",
      "イ": "a: 偽造 / b: 個人差",
      "ウ": "a: 判別 / b: 経年変化",
      "エ": "a: 判別 / b: 個人差"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 67,
    "category": "テクノロジ系",
    "body": "TCP/IPにおけるポート番号によって識別されるものはどれか。",
    "choices": {
      "ア": "LANに接続されたコンピュータや通信機器のLANインタフェース",
      "イ": "インターネットなどのIPネットワークに接続したコンピュータや通信機器",
      "ウ": "コンピュータ上で動作している通信アプリケーション",
      "エ": "無線LANのネットワーク"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 68,
    "category": "テクノロジ系",
    "body": "リスク対応を，移転，回避，低減及び保有に分類するとき，次の対応はどれに分類されるか。\n【対応】職場における机上の書類からの情報漏えい対策として，退社時のクリアデスクを導入した。",
    "choices": {
      "ア": "移転",
      "イ": "回避",
      "ウ": "低減",
      "エ": "保有"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 69,
    "category": "テクノロジ系",
    "body": "ISMSの確立，実施，維持及び継続的改善における次の実施項目のうち，最初に行うものはどれか。",
    "choices": {
      "ア": "情報セキュリティリスクアセスメント",
      "イ": "情報セキュリティリスク対応",
      "ウ": "内部監査",
      "エ": "利害関係者のニーズと期待の理解"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 70,
    "category": "テクノロジ系",
    "body": "LPWAの特徴として，適切なものはどれか。",
    "choices": {
      "ア": "AIに関する技術であり，ルールなどを明示的にプログラミングすることなく，入力されたデータからコンピュータが新たな知識やルールなどを獲得できる。",
      "イ": "低消費電力型の広域無線ネットワークであり，通信速度は携帯電話システムと比較して低速なものの，一般的な電池で数年以上の運用が可能な省電力性と，最大で数十kmの通信が可能な広域性を有している。",
      "ウ": "分散型台帳技術の一つであり，複数の取引記録をまとめたデータを順次作成し，直前のデータのハッシュ値を埋め込むことによって，データを相互に関連付け，矛盾なく改ざんすることを困難にして，データの信頼性を高めている。",
      "エ": "無線LANの暗号化方式であり，脆弱性が指摘されているWEPに代わって利用が推奨されている。"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 71,
    "category": "テクノロジ系",
    "body": "表計算ソフトを用いて，ワークシートに示す各商品の月別売上額データを用いた計算を行う。セルE2に式\"条件付個数(B2:D2,＞15000)\"を入力した後，セルE3とE4に複写したとき，セルE4に表示される値はどれか。\n[表: A列:商品名, B列:1月売上額, C列:2月売上額, D列:3月売上額, E列:条件付個数 / 2行目:商品A, 10000, 15000, 20000 / 3行目:商品B, 5000, 10000, 5000 / 4行目:商品C, 10000, 20000, 30000]",
    "choices": {
      "ア": "0",
      "イ": "1",
      "ウ": "2",
      "エ": "3"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 72,
    "category": "テクノロジ系",
    "body": "2台のPCから一つのファイルを並行して更新した。ファイル中のデータnに対する処理が①～④の順に行われたとき，データnは最後にどの値になるか。ここで，データnの初期値は10であった。（図についてはPDFを参照。PC-Aの処理内容: ①データnを読み込み，5を引く。③処理①の結果を，データnに書き込む。PC-Bの処理内容: ②データnを読み込み，7を足す。④処理②の結果を，データnに書き込む。）",
    "choices": {
      "ア": "5",
      "イ": "10",
      "ウ": "12",
      "エ": "17"
    },
    "answer": "エ",
    "image": "img/2020r02o_q72.png"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 73,
    "category": "テクノロジ系",
    "body": "関係データベースにおいて，表Aと表Bの積集合演算を実行した結果はどれか。\n[表A: (ガム,100), (せんべい,250), (チョコレート,150) / 表B: (せんべい,250), (チョコレート,150), (どら焼き,100)]",
    "choices": {
      "ア": "品名:ガム,せんべい,チョコレート,どら焼き / 価格:100,250,150,100",
      "イ": "品名:ガム,せんべい,チョコレート,どら焼き / 価格:100,500,300,100",
      "ウ": "品名:せんべい,チョコレート / 価格:500,300",
      "エ": "品名:せんべい,チョコレート / 価格:250,150"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 74,
    "category": "テクノロジ系",
    "body": "IoTデバイスへの電力供給でも用いられ，周りの環境から光や熱（温度差）などの微小なエネルギーを集めて，電力に変換する技術はどれか。",
    "choices": {
      "ア": "PLC",
      "イ": "PoE",
      "ウ": "エネルギーハーベスティング",
      "エ": "スマートグリッド"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 75,
    "category": "テクノロジ系",
    "body": "PCに設定するIPv4のIPアドレスの表記の例として，適切なものはどれか。",
    "choices": {
      "ア": "00.00.11.aa.bb.cc",
      "イ": "050-1234-5678",
      "ウ": "10.123.45.67",
      "エ": "http://www.example.co.jp/"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 76,
    "category": "テクノロジ系",
    "body": "従業員に貸与するスマートフォンなどのモバイル端末を遠隔から統合的に管理する仕組みであり，セキュリティの設定や，紛失時にロックしたり初期化したりする機能をもつものはどれか。",
    "choices": {
      "ア": "DMZ",
      "イ": "MDM",
      "ウ": "SDN",
      "エ": "VPN"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 77,
    "category": "テクノロジ系",
    "body": "IP電話で使用されている技術に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "インターネットだけでなく，企業内LANのような閉じたネットワーク上にも構築することができる。",
      "イ": "音声をIPパケットに変換する技術としてIP-VPNを使用している。",
      "ウ": "公衆電話網への発信を行うことはできない。",
      "エ": "利用するにはISDN回線が引かれていることが前提となる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 78,
    "category": "テクノロジ系",
    "body": "通信プロトコルとしてTCP/IPを用いるVPNには，インターネットを使用するインターネットVPNや通信事業者の独自ネットワークを使用するIP-VPNなどがある。インターネットVPNではできないが，IP-VPNではできることはどれか。",
    "choices": {
      "ア": "IP電話を用いた音声通話",
      "イ": "帯域幅などの通信品質の保証",
      "ウ": "盗聴，改ざんの防止",
      "エ": "動画の配信"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 79,
    "category": "テクノロジ系",
    "body": "次の①～④のうち，電源供給が途絶えると記憶内容が消える揮発性のメモリだけを全て挙げたものはどれか。\n①DRAM\n②ROM\n③SRAM\n④SSD",
    "choices": {
      "ア": "①, ②",
      "イ": "①, ③",
      "ウ": "②, ④",
      "エ": "③, ④"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 80,
    "category": "テクノロジ系",
    "body": "HyperTextの特徴を説明したものはどれか。",
    "choices": {
      "ア": "いろいろな数式を作成・編集できる機能をもっている。",
      "イ": "いろいろな図形を作成・編集できる機能をもっている。",
      "ウ": "多様なテンプレートが用意されており，それらを利用できるようにしている。",
      "エ": "文中の任意の場所にリンクを埋め込むことで関連した情報をたどれるようにした仕組みをもっている。"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 81,
    "category": "テクノロジ系",
    "body": "Webサイトに関する記述中のa, bに入れる字句の適切な組合せはどれか。\nWebサイトの提供者が，Webブラウザを介して利用者のPCに一時的にデータを保存させる仕組みを a という。これを用いて，利用者の識別が可能となる。Webサイトの見出しや要約などのメタデータを構造化して記述するフォーマットを b という。これを用いて，利用者にWebサイトの更新情報を知らせることができる。",
    "choices": {
      "ア": "a: CGI / b: CSS",
      "イ": "a: CGI / b: RSS",
      "ウ": "a: cookie / b: CSS",
      "エ": "a: cookie / b: RSS"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 82,
    "category": "テクノロジ系",
    "body": "情報セキュリティの物理的対策として，取り扱う情報の重要性に応じて，オフィスなどの空間を物理的に区切り，オープンエリア，セキュリティエリア，受渡しエリアなどに分離することを何と呼ぶか。",
    "choices": {
      "ア": "サニタイジング",
      "イ": "ソーシャルエンジニアリング",
      "ウ": "ゾーニング",
      "エ": "ハッキング"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 83,
    "category": "テクノロジ系",
    "body": "建物や物体などの立体物に，コンピュータグラフィックスを用いた映像などを投影し，様々な視覚効果を出す技術を何と呼ぶか。",
    "choices": {
      "ア": "ディジタルサイネージ",
      "イ": "バーチャルリアリティ",
      "ウ": "プロジェクションマッピング",
      "エ": "ポリゴン"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 84,
    "category": "テクノロジ系",
    "body": "ISMSの情報セキュリティリスク対応における，人的資源に関するセキュリティ管理策の記述として，適切でないものはどれか。",
    "choices": {
      "ア": "雇用する候補者全員に対する経歴などの確認は，関連する法令，規制及び倫理に従って行う。",
      "イ": "情報セキュリティ違反を犯した従業員に対する正式な懲戒手続を定めて，周知する。",
      "ウ": "組織の確立された方針及び手順に従った情報セキュリティの適用を自社の全ての従業員に要求するが，業務を委託している他社には要求しないようにする。",
      "エ": "退職する従業員に対し，退職後も有効な情報セキュリティに関する責任事項及び義務を定めてその従業員に伝え，退職後もそれを守らせる。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 85,
    "category": "テクノロジ系",
    "body": "ファイルサーバに保存されている文書ファイルの内容をPCで直接編集した後，上書き保存しようとしたら\"権限がないので保存できません\"というメッセージが表示された。この文書ファイルとそれが保存されているフォルダに設定されていた権限の組合せとして，適切なものはどれか。",
    "choices": {
      "ア": "ファイル読取り権限: あり / ファイル書込み権限: あり / フォルダ読取り権限: なし",
      "イ": "ファイル読取り権限: あり / ファイル書込み権限: なし / フォルダ読取り権限: あり",
      "ウ": "ファイル読取り権限: なし / ファイル書込み権限: あり / フォルダ読取り権限: なし",
      "エ": "ファイル読取り権限: なし / ファイル書込み権限: なし / フォルダ読取り権限: あり"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 86,
    "category": "テクノロジ系",
    "body": "二要素認証の説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "所有物，記憶及び生体情報の3種類のうちの2種類を使用して認証する方式",
      "イ": "人間の生体器官や筆跡などを使った認証で，認証情報の2か所以上の特徴点を使用して認証する方式",
      "ウ": "文字，数字及び記号のうち2種類以上を組み合わせたパスワードを用いて利用者を認証する方式",
      "エ": "利用者を一度認証することで二つ以上のシステムやサービスなどを利用できるようにする方式"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 87,
    "category": "テクノロジ系",
    "body": "ISMSにおける情報セキュリティに関する次の記述中のa, bに入れる字句の適切な組合せはどれか。\n情報セキュリティとは，情報の機密性，a 及び可用性を維持することである。さらに，b，責任追跡性，否認防止，信頼性などの特性を維持することを含める場合もある。",
    "choices": {
      "ア": "a: 完全性 / b: 真正性",
      "イ": "a: 完全性 / b: 保守性",
      "ウ": "a: 保全性 / b: 真正性",
      "エ": "a: 保全性 / b: 保守性"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 88,
    "category": "テクノロジ系",
    "body": "無線LANに関する記述のうち，適切なものだけを全て挙げたものはどれか。\na 使用する暗号化技術によって，伝送速度が決まる。\nb 他の無線LANとの干渉が起こると，伝送速度が低下したり通信が不安定になったりする。\nc 無線LANでTCP/IPの通信を行う場合，IPアドレスの代わりにESSIDが使われる。",
    "choices": {
      "ア": "a, b",
      "イ": "b",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 89,
    "category": "テクノロジ系",
    "body": "PDCAモデルに基づいてISMSを運用している組織の活動において，PDCAモデルのA（Act）に相当するプロセスで実施するものとして，適切なものはどれか。",
    "choices": {
      "ア": "運用状況の監視や運用結果の測定及び評価で明らかになった不備などについて，見直しと改善策を決定する。",
      "イ": "運用状況の監視や運用結果の測定及び評価を行う。",
      "ウ": "セキュリティポリシの策定や組織内の体制の確立，セキュリティポリシで定めた目標を達成するための手順を策定する。",
      "エ": "セキュリティポリシの周知徹底やセキュリティ装置の導入などを行い，具体的に運用する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 90,
    "category": "テクノロジ系",
    "body": "ハードウェアなどに対して外部から不正に行われる内部データの改ざんや解読，取出しなどがされにくくなっている性質を表すものはどれか。",
    "choices": {
      "ア": "可用性",
      "イ": "信頼性",
      "ウ": "責任追跡性",
      "エ": "耐タンパ性"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 91,
    "category": "テクノロジ系",
    "body": "IoT機器やスマートフォンなどの端末に搭載されているGPS機能を利用して，この端末が自らの位置情報を得る仕組みとして，適切なものはどれか。",
    "choices": {
      "ア": "端末の位置情報の通知要求を電波に乗せて人工衛星に送信し，これに対する応答を受信することによって位置情報を得る。",
      "イ": "端末の位置情報の通知要求を電波に乗せて地上の無線基地局に送信し，これに対する応答を受信することによって位置情報を得る。",
      "ウ": "三つ以上の人工衛星が発信している電波を受信して，電波の発信時刻と受信時刻の差などから端末の位置情報を得る。",
      "エ": "三つ以上の地上の無線基地局が発信している電波を受信して，電波の発信時刻と受信時刻の差などから端末の位置情報を得る。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 92,
    "category": "テクノロジ系",
    "body": "AさんがXさん宛ての電子メールを送るときに，参考までにYさんとZさんにも送ることにした。ただし，Zさんに送ったことは，XさんとYさんには知られたくない。このときに指定する宛先として，適切な組合せはどれか。",
    "choices": {
      "ア": "To: X / Cc: Y / Bcc: Z",
      "イ": "To: X / Cc: Y, Z / Bcc: Z",
      "ウ": "To: X / Cc: Z / Bcc: Y",
      "エ": "To: X, Y, Z / Cc: Y / Bcc: Z"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 93,
    "category": "テクノロジ系",
    "body": "無線LANにおいて，PCとアクセスポイント間の電波傍受による盗聴の対策として，適切なものはどれか。",
    "choices": {
      "ア": "MACアドレスフィルタリングを設定する。",
      "イ": "アクセスポイントからのESSID通知を停止する。",
      "ウ": "アクセスポイントのESSIDを推定しにくい値に設定する。",
      "エ": "セキュリティの設定で，WPA2を選択する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 94,
    "category": "テクノロジ系",
    "body": "IoTデバイス群とそれらを管理するIoTサーバで構成されるIoTシステムがある。このシステムの情報セキュリティにおける①～③のインシデントと，それによって損なわれる，機密性，完全性及び可用性との組合せとして，適切なものはどれか。\n【インシデント】\n①IoTデバイスが，電池切れによって動作しなくなった。\n②IoTデバイスとIoTサーバ間の通信を暗号化していなかったので，情報が漏えいした。\n③システムの不具合によって，誤ったデータが記録された。",
    "choices": {
      "ア": "①: 可用性 / ②: 完全性 / ③: 機密性",
      "イ": "①: 可用性 / ②: 機密性 / ③: 完全性",
      "ウ": "①: 完全性 / ②: 可用性 / ③: 機密性",
      "エ": "①: 機密性 / ②: 可用性 / ③: 完全性"
    },
    "answer": "イ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 95,
    "category": "テクノロジ系",
    "body": "伝送速度が20Mbps（ビット／秒），伝送効率が80％である通信回線において，1Gバイトのデータを伝送するのに掛かる時間は何秒か。ここで，1Gバイト＝10³Mバイトとする。",
    "choices": {
      "ア": "0.625",
      "イ": "50",
      "ウ": "62.5",
      "エ": "500"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 96,
    "category": "テクノロジ系",
    "body": "OSS（Open Source Software）に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "製品によっては，企業の社員が業務として開発に参加している。",
      "イ": "ソースコードだけが公開されており，実行形式での配布は禁じられている。",
      "ウ": "どの製品も，ISOで定められたオープンソースライセンスによって同じ条件で提供されている。",
      "エ": "ビジネス用途での利用は禁じられている。"
    },
    "answer": "ア"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 97,
    "category": "テクノロジ系",
    "body": "公開鍵暗号方式では，暗号化のための鍵と復号のための鍵が必要となる。4人が相互に通信内容を暗号化して送りたい場合は，全部で8個の鍵が必要である。このうち，非公開にする鍵は何個か。",
    "choices": {
      "ア": "1",
      "イ": "2",
      "ウ": "4",
      "エ": "6"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 98,
    "category": "テクノロジ系",
    "body": "IoTエリアネットワークの構築に当たり，①～③の通信規格の使用を検討している。これらの通信規格を有線と無線に分類したとき，無線ネットワークに分類されるものだけを全て挙げたものはどれか。\n①BLE\n②PLC\n③ZigBee",
    "choices": {
      "ア": "①, ②",
      "イ": "①, ②, ③",
      "ウ": "①, ③",
      "エ": "②, ③"
    },
    "answer": "ウ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 99,
    "category": "テクノロジ系",
    "body": "IoTデバイスとIoTサーバで構成され，IoTデバイスが計測した外気温をIoTサーバへ送り，IoTサーバからの指示でIoTデバイスに搭載されたモータが窓を開閉するシステムがある。このシステムにおけるアクチュエータの役割として，適切なものはどれか。",
    "choices": {
      "ア": "IoTデバイスから送られてくる外気温のデータを受信する。",
      "イ": "IoTデバイスに対して窓の開閉指示を送信する。",
      "ウ": "外気温を電気信号に変換する。",
      "エ": "窓を開閉する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2020r02o",
    "examLabel": "R02(10月)",
    "number": 100,
    "category": "テクノロジ系",
    "body": "電子メールにディジタル署名を付与して送信するとき，信頼できる認証局から発行された電子証明書を使用することに比べて，送信者が自分で作成した電子証明書を使用した場合の受信側のリスクとして，適切なものはどれか。",
    "choices": {
      "ア": "電子メールが正しい相手から送られてきたかどうかが確認できなくなる。",
      "イ": "電子メールが途中で盗み見られている危険性が高まる。",
      "ウ": "電子メールが途中で紛失する危険性が高まる。",
      "エ": "電子メールに文字化けが途中で発生しやすくなる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 1,
    "category": "ストラテジ系",
    "body": "AIの活用領域には音声認識，画像認識，自然言語処理などがある。音声認識と画像認識の応用事例の組合せとして，最も適切なものはどれか。",
    "choices": {
      "ア": "音声認識の応用事例＝スマートスピーカに音声で質問をしてその回答を得る / 画像認識の応用事例＝カメラで撮影した画像から不良品を検出する",
      "イ": "音声認識の応用事例＝スマートスピーカに音声で質問をしてその回答を得る / 画像認識の応用事例＝日本語で入力した文章を英語に翻訳する",
      "ウ": "音声認識の応用事例＝テキストを音声に変換して読み上げる / 画像認識の応用事例＝カメラで撮影した画像から不良品を検出する",
      "エ": "音声認識の応用事例＝テキストを音声に変換して読み上げる / 画像認識の応用事例＝日本語で入力した文章を英語に翻訳する"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 2,
    "category": "ストラテジ系",
    "body": "農業についてのITの活用事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "工場における製品の組立作業に産業用ロボットを導入する。",
      "イ": "自宅のPCからインターネット経由で銀行の振込を行う。",
      "ウ": "電子商取引サイトで注文された商品を段ボール箱に詰め込み，自動化されたベルトコンベアで出荷する。",
      "エ": "ドローンを利用して農薬散布を行う。"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 3,
    "category": "ストラテジ系",
    "body": "企業が社会の信頼に応えていくために，法令を遵守することはもとより，社会的規範などの基本的なルールに従って活動する，いわゆるコンプライアンスが求められている。a～dのうち，コンプライアンスとして，最も適切な行動だけを全て挙げたものはどれか。\na 競合他社との間で，シェアを維持するために互いに出荷量を制限する取決めを行った。\nb 個人情報保護法における個人情報取扱事業者の義務を遵守した。\nc 自社の労働基準についてまとめ，関係法令に適合するかどうか確認した。\nd 他社の知的財産権に関する権利侵害がないかどうかを確認した。",
    "choices": {
      "ア": "a, b, c, d",
      "イ": "a, d",
      "ウ": "b, c",
      "エ": "b, c, d"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 4,
    "category": "ストラテジ系",
    "body": "令和元年5月に経済産業省が公表した\"DX推進指標\"は，DXの推進状況を自己診断するための指標である。この指標に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "DXの推進状況の自己診断結果は非公開のままであり，社外のステークホルダに公開されることはない。",
      "イ": "DX推進指標を用いた自己診断結果を独立行政法人情報処理推進機構（IPA）に提出すると，他社との比較ができるベンチマークの提供を受けることができる。",
      "ウ": "業種ごとに固有の指標が策定されている。",
      "エ": "自己診断における回答は，定量的なデータに限られる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 5,
    "category": "ストラテジ系",
    "body": "サブスクリプションの説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "商品の企画，生産，流通，販売という一連の過程を，部門間又は企業間で共有された情報を活用して全体最適化し，顧客満足を高めつつ，リードタイムの短縮やコストの削減を実現する。",
      "イ": "事業活動で生じた利益を，社会貢献に結び付けるような事業に投資する。",
      "ウ": "提供する商品やサービスの種類にかかわらず，利用期間に応じた利用料金を，利用者が支払う方式である。",
      "エ": "特定の商品やサービスについて，利用者が評価した情報を基に，別の利用者に対して，関連する商品やサービスを推薦する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 6,
    "category": "ストラテジ系",
    "body": "企業のビジネスモデルにおいて，販売した製品やサービスによる売上をメインの収益とするのではなく，それらを利用するユーザの規模を拡大することを最優先して投資を行い，利用者数が十分拡大した時点でユーザに関するデータやプラットフォームとしての価値をビジネスの収益とするモデルはどれか。",
    "choices": {
      "ア": "エコシステム",
      "イ": "クロスセル",
      "ウ": "ニッチャ",
      "エ": "フリーミアム"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 7,
    "category": "ストラテジ系",
    "body": "企業間の取引において，実店舗ではなくオンライン上で行われる取引の特徴を表すものとして，最も適切なものはどれか。",
    "choices": {
      "ア": "BtoB",
      "イ": "EDI",
      "ウ": "MRP",
      "エ": "O2O"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 8,
    "category": "ストラテジ系",
    "body": "ある製品において1日当たり10個の需要がある。この製品の発注から納品までのリードタイムは3日である。発注点を50個としたとき，安全在庫は何個か。",
    "choices": {
      "ア": "10",
      "イ": "20",
      "ウ": "30",
      "エ": "50"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 9,
    "category": "ストラテジ系",
    "body": "サービスデスクに対して，ITILで定義される管理プロセスのうち，インシデント管理が主として関わるものはどれか。",
    "choices": {
      "ア": "計画されたITサービスの変更に関する連絡窓口",
      "イ": "サービスの中断を引き起こしている問題の根本原因の特定",
      "ウ": "できるだけ早く正常なサービス運用を復帰させること",
      "エ": "変更内容の確認のためにテスト環境で動作を確認すること"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 10,
    "category": "ストラテジ系",
    "body": "売上高が100百万円のとき，変動費が40百万円，固定費が50百万円掛かる商品がある。この商品の損益分岐点売上高は何百万円か。ここで，売上高に対する変動費の割合は一定とする。",
    "choices": {
      "ア": "33",
      "イ": "50",
      "ウ": "83",
      "エ": "90"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 11,
    "category": "ストラテジ系",
    "body": "ソフトウェアのライセンスに関する説明のうち，アクティベーションの説明として適切なものはどれか。",
    "choices": {
      "ア": "ソフトウェアに対する利用者の権利を含めた使用許諾条件に同意することで，ソフトウェアを利用できるようにすること",
      "イ": "ソフトウェアの購入後に，自分のPCにインストールして使用を開始すること",
      "ウ": "ソフトウェアの利用権を持っていることを確認する仕組みのこと",
      "エ": "他者が所有するソフトウェアを利用するために，利用者と所有者の間で利用許諾契約を結ぶこと"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 12,
    "category": "ストラテジ系",
    "body": "ロングテールの説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "インターネットショッピングなどで，売上の全体に対する割合が低い商品の売上の合計が，無視できない割合になっていること",
      "イ": "店舗での売上の多くが，全商品の2割程度の商品から生み出されていること",
      "ウ": "売場の陳列棚にある商品が少なくなったとき，倉庫から補充するのではなく，メーカーに補充を任せること",
      "エ": "利用者が多くなるほど，利用者がそのネットワークから得る利益が増していくこと"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 13,
    "category": "ストラテジ系",
    "body": "日本の中小企業の経営における問題点のうち，IoTを導入することで，他のどの問題点よりも効果的に解決が図れるものはどれか。",
    "choices": {
      "ア": "コア技術及び優れたノウハウをもった従業員の高齢化への対処",
      "イ": "原材料費の低減",
      "ウ": "設備の稼働率の見える化",
      "エ": "他社との競合"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 14,
    "category": "ストラテジ系",
    "body": "バリューエンジニアリングにおける価値を，\"価値＝機能÷コスト\"と定義したとき，価値を高める事例はどれか。ここで，機能とコストは現在の値よりも変化させるものとする。",
    "choices": {
      "ア": "コストを下げ，機能も下げる。",
      "イ": "コストを下げ，機能を上げる。",
      "ウ": "コストを上げ，機能も上げる。",
      "エ": "コストを上げ，機能を下げる。"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 15,
    "category": "ストラテジ系",
    "body": "AIを利用したチャットボットに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "あらかじめ登録されたFAQの中から，利用者が選択することによって回答を得る仕組み",
      "イ": "業務システムなどのソフトウェアの操作についての質問に，画像や動画を用いた操作ガイドで回答する仕組み",
      "ウ": "テキストや音声などによる利用者からの問合せに対して，会話形式で自動的に応答する仕組み",
      "エ": "利用者が入力したキーワードに基づいて全文検索を行い，その結果を回答として返す仕組み"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 16,
    "category": "ストラテジ系",
    "body": "RPA(Robotic Process Automation)の事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "FAXで届いた手書きの注文書をOCRで読み取り，潜在のパターンから文字をAIが判定する。",
      "イ": "あらかじめ定めた条件に合致するWebサイトから商品の情報を取得して，一覧表にまとめる。",
      "ウ": "業務が変更されたとき，プログラムの処理ロジックを見直して修正する。",
      "エ": "対話型のユーザインタフェースを利用して，利用者にFAQの中からキーワードに一致したものを提示する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 17,
    "category": "ストラテジ系",
    "body": "技術と経営の両面を理解し，組織横断的な活動を推進して，技術の事業化や技術開発の方向付けに責任をもつ役割の人はどれか。",
    "choices": {
      "ア": "CIO",
      "イ": "CMO",
      "ウ": "CTO",
      "エ": "MOT"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 18,
    "category": "ストラテジ系",
    "body": "コストプラス法の説明として，適切なものはどれか。",
    "choices": {
      "ア": "一般の消費者を対象にして，見た目の印象で端数のある価格にする方法",
      "イ": "市場や競合他社の動向から，市場価格を基準にして価格を決定する方法",
      "ウ": "製品のコストに対して一定の利益を上乗せして価格を決定する方法",
      "エ": "販売効果を期待して，通常の販売価格よりも安い価格にする方法"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 19,
    "category": "ストラテジ系",
    "body": "3Dプリンタの活用事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "コンピュータ上で作成した設計データを基に，試作品を作成する。",
      "イ": "生体に流れる微弱な電流を計測して，その計測結果を画像として出力する。",
      "ウ": "大量の紙文書をまとめてディジタル化して，電子文書を作成する。",
      "エ": "放射線や磁気を用いて人体の内部を撮影して，その結果を画像として出力する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 20,
    "category": "ストラテジ系",
    "body": "市場を消費者の属性，行動などの特性で分類し，同じニーズをもつグループに分割することを何というか。",
    "choices": {
      "ア": "CRM",
      "イ": "セグメンテーション",
      "ウ": "マーチャンダイジング",
      "エ": "マーケットバスケット分析"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 21,
    "category": "ストラテジ系",
    "body": "IoTのエリアネットワークにおいてデバイスとの通信に用いられる技術のうち，数十mの通信距離であり，免許不要の周波数帯を使って通信ができるものとして，最も適切なものはどれか。",
    "choices": {
      "ア": "BLE",
      "イ": "HEMS",
      "ウ": "LTE",
      "エ": "PLC"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 22,
    "category": "ストラテジ系",
    "body": "CAMの説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "コンピュータによる設計支援ツール",
      "イ": "コンピュータによる生産支援ツール",
      "ウ": "コンピュータによるソフトウェアエンジニアリング支援ツール",
      "エ": "コンピュータによるテスト支援ツール"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 23,
    "category": "ストラテジ系",
    "body": "マネジメントサイクルの一つであるOODAループの説明として，適切なものはどれか。",
    "choices": {
      "ア": "改善活動のために，計画，実行，チェック，改善のサイクルを回し，業務プロセスの確実な実施を確保する。",
      "イ": "監視，情報確認，意思決定，行動のサイクルによって，状況の変化に速やかに対応する。",
      "ウ": "現場の改善において，整理，整頓，清掃，清潔，躾のサイクルを回し，業務の効率や品質を向上させる。",
      "エ": "品質管理を行うために，特性要因図を用いた原因分析から対策実行までのサイクルを回す。"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 24,
    "category": "ストラテジ系",
    "body": "企業の経営において，ステークホルダに該当するものはどれか。",
    "choices": {
      "ア": "株主",
      "イ": "顧客",
      "ウ": "従業員",
      "エ": "株主，顧客，従業員及びそれ以外の利害関係者全員"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 25,
    "category": "ストラテジ系",
    "body": "企業が活用する情報システムの形態に関する記述a～cのうち，SaaSの特徴として，適切なものだけを全て挙げたものはどれか。\na インターネットを経由して，必要な機能を必要なだけ，サービスとして利用する。\nb 利用者は，自分自身が使うアプリケーションソフトウェアのカスタマイズのほか，プラットフォームやインフラについても柔軟にカスタマイズすることができる。\nc 利用者は，アプリケーションソフトウェアの管理やメンテナンスの必要がない。",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "a, c",
      "エ": "b, c"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 26,
    "category": "ストラテジ系",
    "body": "系統図法の説明として，適切なものはどれか。",
    "choices": {
      "ア": "結果（特性）とそれに影響を及ぼしていると思われる要因（原因）の関係を，魚の骨のような形態として体系的に整理する手法",
      "イ": "事態の進展とともに様々な結果が想定される問題について，対処の仕方を決めていくために，決定していく段階を追って樹木状の図に展開して表す手法",
      "ウ": "複雑な要因の絡み合う事象について，その事象間の因果関係を矢印で結ぶことで，問題の構造を明らかにする手法",
      "エ": "目的を達成するための手段を導き出し，更にその手段を実施するための幾つかの手段を考えるという作業を繰り返し，細分化していく手法"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 27,
    "category": "ストラテジ系",
    "body": "SCMの説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "営業や保守サービスの担当者が顧客情報やサポート履歴を共有し，管理することによって，顧客との良好な関係を維持していく取組",
      "イ": "各工程における製造の着手と完成の時期を棒状に図示し，工程ごとの前後関係や所要期間を管理する取組",
      "ウ": "企業が顧客，競合他社，市場の動向などを調査して分析し，事業戦略，マーケティング戦略を策定する取組",
      "エ": "部品や資材の調達から製品の生産，流通，販売までの，企業間を含めたモノの流れを効率化し最適化する取組"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 28,
    "category": "ストラテジ系",
    "body": "表に示すような損益計算資料がある。損益分岐点は何百万円か。\n[表: 売上高 500百万円, 変動費 200百万円, 固定費 150百万円, 営業利益 150百万円]",
    "choices": {
      "ア": "150",
      "イ": "200",
      "ウ": "250",
      "エ": "350"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 29,
    "category": "ストラテジ系",
    "body": "一般の利用者がブラウザを用いてアクセスするWebサイトに，検索エンジンの検索結果の上位に表示されるよう工夫することを何というか。",
    "choices": {
      "ア": "CMS",
      "イ": "EC",
      "ウ": "RPA",
      "エ": "SEO"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 30,
    "category": "ストラテジ系",
    "body": "国際標準化の動向に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "ISO規格には，プログラム言語に関する規格はあるが，文字コードに関する規格はない。",
      "イ": "ISO規格は，任意の国際規格であり，それぞれの国の規格に優先するものではない。",
      "ウ": "JIS規格とISO規格が対応関係にあることはない。",
      "エ": "W3Cは，ISO規格のうちネットワーク分野を担当する組織である。"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 31,
    "category": "ストラテジ系",
    "body": "IoTに関連する技術であるエッジコンピューティングの説明として，適切なものはどれか。",
    "choices": {
      "ア": "一般の通信機器で扱うデータよりも少ないデータ量で通信する技術",
      "イ": "演算処理のリソースを端末の近傍に置くことによって，アプリケーション処理の低遅延化や通信トラフィックの最適化を行う技術",
      "ウ": "利用者のPCやスマートフォンなどからの問合せに対して，コンピュータが会話形式で自動応答する仕組み",
      "エ": "利用者の体の動きをコンピュータに認識させ，機械の制御に活用する技術"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 32,
    "category": "ストラテジ系",
    "body": "あるプロジェクトでは，システムの機能追加を次のア～エの作業で行う。全ての作業を終えるために必要な期間は最少で何日間か。ここで，各作業の前後関係と所要期間は表のとおりであり，並行して行える作業はそれぞれ同時に開始し，両方の作業が終了するのを待って後続作業を開始する。\n[表: 作業A 前の作業:なし 所要5日 / 作業B 前の作業:なし 所要3日 / 作業C 前の作業:AとB 所要4日 / 作業D 前の作業:AとB 所要3日]",
    "choices": {
      "ア": "8",
      "イ": "9",
      "ウ": "12",
      "エ": "15"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 33,
    "category": "ストラテジ系",
    "body": "デジタルトランスフォーメーション（DX）を推進している組織で実施された取組の事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "IRとして財務状況や経営状況を投資家に対して発信した。",
      "イ": "ITリテラシの向上を目的として，従業員にパソコンの操作研修を実施した。",
      "ウ": "社屋に災害に強い免震構造を採用した。",
      "エ": "収集した大量の顧客の購買データをAIで分析し，分析結果に基づいて販売促進活動を実施した。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 34,
    "category": "ストラテジ系",
    "body": "BYOD(Bring Your Own Device)の事例として，適切なものはどれか。",
    "choices": {
      "ア": "会社から貸与されたスマートフォンを業務のほかプライベートでも使用する。",
      "イ": "会社のPCをテレワーク時に自宅に持ち帰って使用する。",
      "ウ": "従業員が個人で契約したクラウドサービスを業務で使用する。",
      "エ": "従業員が個人で所有するスマートフォンを業務で使用する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 35,
    "category": "ストラテジ系",
    "body": "国際的な標準化の一つとして，環境に関するISO 14000シリーズがある。その対象はどれか。",
    "choices": {
      "ア": "環境マネジメントシステム",
      "イ": "食品安全マネジメントシステム",
      "ウ": "品質マネジメントシステム",
      "エ": "リスクマネジメント"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 36,
    "category": "マネジメント系",
    "body": "ある開発プロジェクトにおいて，テスト工程で使用するPCの台数を見積もりたい。このプロジェクトのテスト工程は20日間を予定している。テスト要員1人当たりPCが1台必要である。テスト工程のうち10日間は5人で作業し，残りの10日間は3人で作業する予定である。PCの最大利用期間は15日間であるとき，PCは最少で何台必要か。",
    "choices": {
      "ア": "5",
      "イ": "6",
      "ウ": "7",
      "エ": "8"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 37,
    "category": "マネジメント系",
    "body": "エンタープライズアーキテクチャの参照モデルのうち，BRM（Business Reference Model）として提供されるものはどれか。",
    "choices": {
      "ア": "アプリケーションの論理的な構成の見本",
      "イ": "業務を分類・体系化した見本",
      "ウ": "セキュリティ基準の見本",
      "エ": "データの標準的な構造の見本"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 38,
    "category": "マネジメント系",
    "body": "システム監査人が確認した次の事項のうち，情報セキュリティ管理体制が適切であると判断できるものはどれか。\n[表: a 情報セキュリティ管理を行う対象範囲に関する取決め → 取引先との守秘義務契約書がある。/ b 情報セキュリティの責任と権限 → 情報セキュリティの管理責任者は，システム部門のフロアの施錠を管理している。/ c 情報セキュリティを維持するための手続 → 情報セキュリティに関する事故が発生したときの報告先や対応体制が文書で定められている。/ d 社内のセキュリティリスクの分析 → 扱う情報の重要性やリスクの大きさに基づく情報のランク付けが行われている。]",
    "choices": {
      "ア": "a, b",
      "イ": "a, c, d",
      "ウ": "b, c",
      "エ": "c, d"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 39,
    "category": "マネジメント系",
    "body": "ある金融機関において，システム障害が発生した際に，顧客の届出印と届出住所を用いて窓口における預金の引出しに対応するようにした。この対応はBCPに基づいた行動として解釈できる。BCPの説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "企業が事業の継続のために，事業のリスク分析に基づいて策定する計画",
      "イ": "企業が社会的責任を果たすために，環境対策として策定する計画",
      "ウ": "企業が情報を適切に管理するために，情報資産のリスク分析に基づいて策定する計画",
      "エ": "企業のサービスの品質を適正に保つために，サービスレベルの基準として策定する計画"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 40,
    "category": "マネジメント系",
    "body": "内部統制において，業務の実施者とは別の者が，成果物についてその正確性を検証するコントロールはどれか。",
    "choices": {
      "ア": "アクセス制御",
      "イ": "教育・訓練",
      "ウ": "職務分掌",
      "エ": "モニタリング"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 41,
    "category": "マネジメント系",
    "body": "開発するソフトウェアに対する要件を分析し，定義する工程において，デベロッパが実施する作業として，最も適切なものはどれか。",
    "choices": {
      "ア": "ソフトウェアのユーザインタフェースの開発",
      "イ": "ソフトウェアの利用者用文書の作成",
      "ウ": "ソフトウェア要件の評価",
      "エ": "ソフトウェア要件のレビュー"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 42,
    "category": "マネジメント系",
    "body": "ITサービスマネジメントの管理プロセスの一つである変更管理として実施するものはどれか。",
    "choices": {
      "ア": "アプリケーションのソースコードのバージョン管理",
      "イ": "サービスの変更に伴うリスクの管理",
      "ウ": "ハードウェアの導入，設定及び管理",
      "エ": "ユーザからのサービスに関する質問の管理"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 43,
    "category": "マネジメント系",
    "body": "プロジェクトのスケジュール管理で使用する\"マイルストーン\"の説明として，適切なものはどれか。",
    "choices": {
      "ア": "各作業の開始時点と終了時点を棒状に図示したもの",
      "イ": "各作業の順序関係と所要期間を矢線で表し，結合点を丸印で示したもの",
      "ウ": "プロジェクトにおける各工程の作業見積りと実績を対比するもの",
      "エ": "プロジェクトにおける主要な節目のこと"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 44,
    "category": "マネジメント系",
    "body": "ソフトウェア開発のプロセスモデルのうち，ウォータフォールモデルの特徴はどれか。",
    "choices": {
      "ア": "開発する機能を分割し，開発する機能の優先度を決めて，優先度が高い機能から順に，機能の開発を繰り返す。",
      "イ": "開発を上流工程から下流工程へと順番に進める。",
      "ウ": "開発をペアで行うことによって，効率よく品質を高める。",
      "エ": "対象とするソフトウェアの代わりに試作品を作り，機能のフィードバックを得る。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 45,
    "category": "マネジメント系",
    "body": "ITサービスの安定的な提供において，計画外のサービスの中断やサービスの品質低下に関連する事象を管理するITILの管理プロセスはどれか。",
    "choices": {
      "ア": "インシデント管理",
      "イ": "サービスレベル管理",
      "ウ": "変更管理",
      "エ": "リリース及び展開管理"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 46,
    "category": "マネジメント系",
    "body": "システムの利用者認証に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "あるシステムの利用者認証に使われるパスワードは，他のシステムの利用者認証にも使い回してよい。",
      "イ": "システムが利用者のアクセス権限を確認するために，利用者認証が行われる。",
      "ウ": "利用者認証にバイオメトリクス認証を導入すると，利用者がパスワードを忘れたことによるシステム管理者の負担が軽減される。",
      "エ": "利用者認証は，システムの利用者だけが行う。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 47,
    "category": "マネジメント系",
    "body": "ソフトウェアの受入れテストに関する適切な記述はどれか。",
    "choices": {
      "ア": "ソフトウェアの機能が要件を満たしていることを，取得者が確認する。",
      "イ": "ソフトウェアの機能が要件を満たしていることを，供給者が確認する。",
      "ウ": "ソフトウェアのユーザインタフェースの使いやすさを，供給者が確認する。",
      "エ": "ソフトウェアのユーザインタフェースの使いやすさを，第三者機関が確認する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 48,
    "category": "マネジメント系",
    "body": "ある企業で実施した社員のITリテラシに関するテスト結果の分析に際し，テスト結果と社員の属性の相関関係を調べたい。このとき利用する分析法として，最も適切なものはどれか。",
    "choices": {
      "ア": "回帰分析",
      "イ": "クロスセクション分析",
      "ウ": "時系列分析",
      "エ": "モンテカルロ分析"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 49,
    "category": "マネジメント系",
    "body": "情報システムの調達の際に作成されるRFPの説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "調達の対象となる情報システムに関する情報を，ベンダに求めるための文書",
      "イ": "調達の対象となる情報システムを，発注先としての候補のベンダに対して具体的に示す文書",
      "ウ": "提案されたシステムとその金額が妥当であるか，社内の稟議にかける文書",
      "エ": "発注先のベンダと取り交わす契約書"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 50,
    "category": "マネジメント系",
    "body": "自分のデスクにあるPCと共有スペースにあるプリンタの起動を1人で行う。PCとプリンタの起動は図の条件で行い，それぞれの作業・処理は逐次実行する必要がある。自動処理の間は，移動やもう片方の作業を並行して行うことができる。自分のデスクにいる状態でPCの起動を開始し，移動してプリンタを起動した上で自分のデスクに戻り，PCの起動を終了するまでに必要な時間は，最短で何秒か。（図を参照）",
    "choices": {
      "ア": "223",
      "イ": "256",
      "ウ": "286",
      "エ": "406"
    },
    "answer": "ア",
    "image": "img/2021r03_q50.png"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 51,
    "category": "マネジメント系",
    "body": "システム開発において使用するテスト方法に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "テストで検出された不具合に対する修正の確認を行うために，前回のテストで実施したテストケースのうち，修正部分を確認するテストケースだけでテストした。",
      "イ": "ブラックボックステストでは，プログラムの内部構造に着目してテストデータを作成した。",
      "ウ": "ホワイトボックステストでは，プログラムの外部仕様に着目してテストデータを作成した。",
      "エ": "リグレッションテスト（退行テスト）では，プログラムの変更によって，以前は正常に動作していた部分に影響がないかどうかを確認した。"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 52,
    "category": "マネジメント系",
    "body": "労働者派遣法に基づく，派遣先の企業と派遣労働者の関係（図中のc）として，適切なものはどれか。",
    "choices": {
      "ア": "請負契約関係",
      "イ": "雇用関係",
      "ウ": "指揮命令関係",
      "エ": "労働者派遣契約関係"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 53,
    "category": "マネジメント系",
    "body": "プロジェクトマネジメントにおけるファストトラッキングの説明はどれか。",
    "choices": {
      "ア": "開始当初に先行して実施する予定だった作業の一部又は全部を，後続作業と並行して実施する。",
      "イ": "クリティカルパス上の作業に資源を追加投入して，所要期間を短縮する。",
      "ウ": "プロジェクトにおいて全体スケジュールを作成する前に，その時点で入手可能な情報を使って，ボトムアップで作業期間を見積もる。",
      "エ": "プロジェクトの進捗管理において，EVM (Earned Value Management)を用いる。"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 54,
    "category": "マネジメント系",
    "body": "次の処理についてITサービスマネジメントにおけるイベント管理の活動として，適切なものはどれか。",
    "choices": {
      "ア": "イベント発生に備えた対応策を事前に計画する。",
      "イ": "サービスに影響するイベントの予兆を検出し，インシデントとして分類する。",
      "ウ": "発生したイベントの根本原因を分析する。",
      "エ": "利用者からのサービスに関する要求を受け付ける。"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 55,
    "category": "マネジメント系",
    "body": "ITサービスの利用者が，インシデント発生時にサービスデスクへ連絡する方法の一つとして，チャットボットを用いることがある。チャットボットを用いることによる利用者にとってのメリットの記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "オペレータのシフトを意識することなくインシデントの状況を伝え，迅速な対応を期待することができる。",
      "イ": "オペレータの対応が適切であるかを確認するための記録を残すことができる。",
      "ウ": "音声通話に比べ，テキスト情報のやり取りのほうが親しみを感じることができる。",
      "エ": "電話回線の混雑にかかわらず，電話での対応を受けることができる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 56,
    "category": "テクノロジ系",
    "body": "情報セキュリティの三大要素である機密性，完全性及び可用性に関する記述のうち，完全性が保たれなくなった事例はどれか。",
    "choices": {
      "ア": "暗号化して送信した電子メールが，第三者によって解読された。",
      "イ": "企業の公開Webサイトが攻撃され，サイトが停止した。",
      "ウ": "社内システムのデータが改ざんされた。",
      "エ": "通信回線が故障して，データを送信できなかった。"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 57,
    "category": "テクノロジ系",
    "body": "関係データベースにおける結合演算を説明したものはどれか。",
    "choices": {
      "ア": "二つの表に対して，指定した条件に合致するレコードだけを取り出して新しい表を返す演算",
      "イ": "一つの表に対して，指定した条件に合致するレコードだけを取り出して新しい表を返す演算",
      "ウ": "一つの表に対して，指定した属性だけを取り出して新しい表を返す演算",
      "エ": "二つの表の全てのレコードの組合せを求め，新しい表を返す演算"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 58,
    "category": "テクノロジ系",
    "body": "人間の脳神経の仕組みをモデルにして，コンピュータプログラムで作られた，パターン認識やデータの分類を行うための仕組みはどれか。",
    "choices": {
      "ア": "エキスパートシステム",
      "イ": "ニューラルネットワーク",
      "ウ": "バーチャルリアリティ",
      "エ": "ベンチマークテスト"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 59,
    "category": "テクノロジ系",
    "body": "情報セキュリティにおけるソーシャルエンジニアリングの例として，適切なものはどれか。",
    "choices": {
      "ア": "ウイルスに感染したコンピュータに対して，遠隔操作で他のコンピュータへの攻撃を行わせる。",
      "イ": "コンピュータの操作画面の覗き見や，ごみ箱に捨てられた資料から情報を収集する。",
      "ウ": "総当たり攻撃ツールを用いて，パスワードを解析する。",
      "エ": "ネットワークの途中でパケットを横取りし，内容を解析する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 60,
    "category": "テクノロジ系",
    "body": "通信プロトコルとしてTCP/IPを用いるとき，IPの上位層のプロトコルとしてTCPではなくUDPを用いるものはどれか。",
    "choices": {
      "ア": "FTP",
      "イ": "NTP",
      "ウ": "POP3",
      "エ": "SMTP"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 61,
    "category": "テクノロジ系",
    "body": "電子メールの内容が改ざんされていないことの確認に利用するものはどれか。",
    "choices": {
      "ア": "IMAP",
      "イ": "SMTP",
      "ウ": "ディジタル署名",
      "エ": "パスワード認証"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 62,
    "category": "テクノロジ系",
    "body": "ディレクトリトラバーサル攻撃の説明はどれか。",
    "choices": {
      "ア": "Webアプリケーションの入力データとしてデータベースの操作命令を構成するデータを入力し，想定外のSQL文を実行させることによって，データベースを破壊したり，データを不正に取得したりする攻撃",
      "イ": "Webサイトに対して，他のサイトを経由した大量のリクエストを繰り返し送ることによって，そのWebサイトのサービスを妨害する攻撃",
      "ウ": "Webサイトの入力項目にスクリプトを埋め込むデータを入力し，そのスクリプトを閲覧者のWebブラウザで実行させることによって，クッキーなどのデータを盗み出す攻撃",
      "エ": "攻撃対象のWebサーバに対して，ファイル名の一部としてファイルシステムの親ディレクトリを示す文字列を入力し，公開されていないファイルに不正アクセスする攻撃"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 63,
    "category": "テクノロジ系",
    "body": "ISMSの管理策に従って，情報の取扱いに関する責任を全うするための施策のうち，適切なものはどれか。",
    "choices": {
      "ア": "情報資産管理台帳に基づき，各情報資産の管理責任者が，自らの管理する情報資産についての説明責任を負う。",
      "イ": "情報資産を幾つかのレベルで格付けし，最も高いレベルの管理策を全ての情報資産に一律に適用する。",
      "ウ": "全ての情報資産を一人の管理者の下で一元的に管理する。",
      "エ": "不正利用のリスクがある情報は，誰でもアクセスできる場所に配置することによって，不正の監視を容易にする。"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 64,
    "category": "テクノロジ系",
    "body": "暗号化や認証の仕組みを利用して，通信内容の漏えいやなりすましに対する安全性を高めた電子メールの規格はどれか。",
    "choices": {
      "ア": "IMAP",
      "イ": "POP3",
      "ウ": "S/MIME",
      "エ": "SMTP"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 65,
    "category": "テクノロジ系",
    "body": "WAFの説明として，適切なものはどれか。",
    "choices": {
      "ア": "Webアプリケーションの通信内容を検査して，不正と判断した通信を遮断する。",
      "イ": "外部から組織内部のネットワークへの不正侵入を検知して，管理者に通報する。",
      "ウ": "外部のネットワークから組織内部のネットワークへの不正なパケットの侵入を防ぐ。",
      "エ": "電子メールの添付ファイルにマルウェアがないかを検査して，マルウェアを検出した場合は削除する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 66,
    "category": "テクノロジ系",
    "body": "無線LANに関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "アクセスポイントの不正利用対策として，ESSIDのステルス化が有効である。",
      "イ": "同一フロアでの無線LANの同時利用による電波干渉が起こった場合は，電波出力の設定を上げて対処する。",
      "ウ": "無線LANで使用する暗号化方式のうち，WPA2による暗号化の強度はWEPと同じである。",
      "エ": "無線LANの通信は電波によるものであるが，有線LANと同レベルの暗号化を実現することは不可能である。"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 67,
    "category": "テクノロジ系",
    "body": "ISMSにおける情報セキュリティの三大要素の一つである\"完全性\"に該当する事象として，最も適切なものはどれか。",
    "choices": {
      "ア": "格納されているデータが，同一のものであることが保証されている。",
      "イ": "許可された利用者が，必要なときにデータにアクセスできることが保証されている。",
      "ウ": "データの作成者が確認され，第三者によるなりすましがないことが保証されている。",
      "エ": "データを暗号化し，権限のない者からの不正なアクセスを防止している。"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 68,
    "category": "テクノロジ系",
    "body": "発信者がメッセージのハッシュ値からディジタル署名を生成するのに使う鍵はどれか。",
    "choices": {
      "ア": "受信者の公開鍵",
      "イ": "受信者の秘密鍵",
      "ウ": "発信者の公開鍵",
      "エ": "発信者の秘密鍵"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 69,
    "category": "テクノロジ系",
    "body": "バイオメトリクス認証に関する記述として，適切なものだけを全て挙げたものはどれか。\n[表: a 指紋認証では，指紋の特徴点を抽出して登録する。 / b 声紋認証では，あらかじめ設定したパスフレーズを使う。 / c 虹彩認証では，眼球内の血管の分岐パターンを読み取る。 / d 静脈認証では，赤外線を利用して皮膚の下を流れる血管のパターンを読み取る。]",
    "choices": {
      "ア": "a, b",
      "イ": "a, d",
      "ウ": "b, c",
      "エ": "c, d"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 70,
    "category": "テクノロジ系",
    "body": "条件①～④を全て満たすとき，出版社と著者と本の関係を示すE-R図はどれか。ここで，E-R図の表記法は次のとおりとする。\n[表記法] a→b: aとbが，1対多の関係であることを表す。\n[条件] ①出版社は，複数の著者と契約している。②著者は，一つの出版社とだけ契約している。③著者は，複数の本を書いている。④1冊の本は，1人の著者が書いている。",
    "choices": {
      "ア": "出版社→著者→本",
      "イ": "出版社→著者←本",
      "ウ": "出版社←著者→本",
      "エ": "出版社←著者←本"
    },
    "answer": "ア",
    "image": "img/2021r03_q70.png"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 71,
    "category": "テクノロジ系",
    "body": "無線LANのセキュリティにおいて，アクセスポイントがPCなどの端末から接続要求があった場合に，接続を要求してきた端末固有の情報を基にアクセス制御を行うものはどれか。",
    "choices": {
      "ア": "ANY接続拒否",
      "イ": "ESSIDステルス",
      "ウ": "MACアドレスフィルタリング",
      "エ": "WPA2"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 72,
    "category": "テクノロジ系",
    "body": "二つの2進数01011010と01101011を加算して得られる2進数はどれか。ここで，2進数は値が正の8ビットで表現するものとする。",
    "choices": {
      "ア": "10000101",
      "イ": "10110101",
      "ウ": "11000101",
      "エ": "11010100"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 73,
    "category": "テクノロジ系",
    "body": "スマートフォンに内蔵されているGPS機能の説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "近くにある無線LANのアクセスポイントの位置情報を使って現在地を求める機能",
      "イ": "地球上空の衛星からの電波を受信して，現在地を求める機能",
      "ウ": "地球上空の衛星を通じてインターネットに接続して，データ通信を行う機能",
      "エ": "モバイル通信網の基地局の位置情報を使って現在地を求める機能"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 74,
    "category": "テクノロジ系",
    "body": "流れ図Xで示す処理では，変数iの値が，1→3→7→13と変化し，流れ図Yで示す処理では，変数iの値が，1→5→13→25と変化した。図中のa, bに入れる字句の適切な組合せはどれか。",
    "choices": {
      "ア": "a=2i+k, b=k:1,3,7",
      "イ": "a=2i+k, b=k:2,2,6",
      "ウ": "a=i+2k, b=k:1,3,7",
      "エ": "a=i+2k, b=k:2,2,6"
    },
    "answer": "エ",
    "image": "img/2021r03_q74.png"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 75,
    "category": "テクノロジ系",
    "body": "二つの事象AとBが互いに排反であるとき，事象Aまたは事象Bが発生する確率P(A∪B)を求める式はどれか。ここで，P(A)は事象Aが発生する確率，P(B)は事象Bが発生する確率，P(A∩B)は事象Aと事象Bが同時に発生する確率を表す。",
    "choices": {
      "ア": "P(A) + P(B)",
      "イ": "P(A) + P(B) - P(A∩B)",
      "ウ": "P(A) × P(B)",
      "エ": "1 - P(A) × P(B)"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 76,
    "category": "テクノロジ系",
    "body": "音声のサンプリングに関する次の記述中のa, bに入れる字句の適切な組合せはどれか。\nアナログ音声をディジタル化するために，アナログ信号の振幅を一定周期でサンプリング（標本化）し，振幅を離散的なデータに( a )する。このとき，元のアナログ信号の最大周波数の( b )のサンプリング周波数でサンプリングすれば，元の信号を復元できる。",
    "choices": {
      "ア": "a=量子化 b=2倍以上",
      "イ": "a=量子化 b=半分以下",
      "ウ": "a=符号化 b=2倍以上",
      "エ": "a=符号化 b=半分以下"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 77,
    "category": "テクノロジ系",
    "body": "マルウェアに関する説明a～cとマルウェアの名称の適切な組合せはどれか。\na ネットワークなどを介してコンピュータ間を自己複製しながら移動し，自律的に拡散するもの\nb 偽のWebサイトに誘導するなどの方法で，クレジットカード番号やパスワードなどの機密情報を不正に取得するもの\nc 利用者の意図に反してインストールされ，利用者の個人情報やアクセス履歴などの情報を収集するもの",
    "choices": {
      "ア": "a=ボット b=フィッシング c=スパイウェア",
      "イ": "a=ボット b=フィッシング c=トロイの木馬",
      "ウ": "a=ワーム b=フィッシング c=スパイウェア",
      "エ": "a=ワーム b=スパイウェア c=トロイの木馬"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 78,
    "category": "テクノロジ系",
    "body": "次の記述a～cのうち，フィッシングへの対策として，適切なものだけを全て挙げたものはどれか。\na Webサイトなどで個人情報を入力する場合は，送信先のWebサイトが信頼できるかどうかを確認する。\nb 電子メールが正しい相手先から送信されていることを保証するために，ディジタル署名を利用する。\nc 電子メールの本文中のURLリンク先が正しいかどうかを確認する。",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, c",
      "ウ": "a, c",
      "エ": "b, c"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 79,
    "category": "テクノロジ系",
    "body": "CAPTCHAの目的として，適切なものはどれか。",
    "choices": {
      "ア": "Webサーバの利用者認証において，人間がアクセスしていることを確認する。",
      "イ": "Webページでの個人データ入力において，データの暗号化を行う。",
      "ウ": "ブラウザのセッション管理において，セッションIDの漏えいを防止する。",
      "エ": "メールの送信において，送信者が実在することを確認する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 80,
    "category": "テクノロジ系",
    "body": "OSS(Open Source Software)に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "OSSのソースコードは公開されているが，商用システムの開発に利用することはできない。",
      "イ": "OSSのソースコードを改良したプログラムを，OSSとして公開することができる。",
      "ウ": "OSSの利用者は，OSSの開発者にソースコードの維持・管理を依頼することができる。",
      "エ": "業務システムの開発においてOSSを利用した場合は，利用者はソースコードの開示を求められることがある。"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 81,
    "category": "テクノロジ系",
    "body": "情報セキュリティ上の脅威であるゼロデイ攻撃の説明として，適切なものはどれか。",
    "choices": {
      "ア": "IDとパスワードの組合せリストを用いて，ログインを試行する攻撃",
      "イ": "SNSやメール等，人の心理の隙を突いた方法で，秘密情報を入手する攻撃",
      "ウ": "セキュリティパッチが公開される前の脆弱性を悪用して行われる攻撃",
      "エ": "マルウェアに感染した多数のPCからの一斉攻撃"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 82,
    "category": "テクノロジ系",
    "body": "ある商品の月別の販売数を基に売上に関する計算を行う。セルB1に商品の単価が，セルA3～A14に1月～12月の各月の販売数が入力されている。セルC3に式\"$B$1*A3\"を入力した後，セルC4～C14に複写したとき，セルC5に表示される値は何を示すか。",
    "choices": {
      "ア": "1月の売上",
      "イ": "3月の売上",
      "ウ": "5月の売上",
      "エ": "12月の売上"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 83,
    "category": "テクノロジ系",
    "body": "無線LANの暗号化方式であり，WEPでは短い固定長の暗号鍵しか扱えなかった問題を改善した暗号化方式はどれか。",
    "choices": {
      "ア": "ESSID",
      "イ": "HTTPS",
      "ウ": "S/MIME",
      "エ": "WPA2"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 84,
    "category": "テクノロジ系",
    "body": "1から6までの六つの目をもつサイコロを4回投げたとき，1の目が2回以上出る確率は幾らか。ここで，サイコロの各目が出る確率は全て等しいものとする。",
    "choices": {
      "ア": "19/144",
      "イ": "25/216",
      "ウ": "1/6",
      "エ": "19/216"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 85,
    "category": "テクノロジ系",
    "body": "情報を取得した時点とその情報を使用する時点が異なるために，取得した情報がその間に更新されてしまい，使用する時点では古くなっている可能性があるという特性を何というか。",
    "choices": {
      "ア": "一意性",
      "イ": "揮発性",
      "ウ": "属人性",
      "エ": "流動性"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 86,
    "category": "テクノロジ系",
    "body": "アプリケーションソフトウェアの変更や機能追加に柔軟に対応するために，アプリケーションソフトウェアが利用するOSやDBMSなどのソフトウェアにアプリケーションの実行基盤（プラットフォーム）をクラウド上で提供するサービスはどれか。",
    "choices": {
      "ア": "IaaS",
      "イ": "MaaS",
      "ウ": "PaaS",
      "エ": "SaaS"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 87,
    "category": "テクノロジ系",
    "body": "図に示すネットワーク構成において，ハブ1とハブ2の間の回線が不通になった場合に通信できなくなる組合せはどれか。ここで，図中のPCn(n=1,2,…,6)は各PCの名前を表す。\n（ハブ1にPC1,PC2,PC3が接続、ハブ2にPC4,PC5,PC6が接続、ハブ1とハブ2は回線で接続）",
    "choices": {
      "ア": "PC1とPC2",
      "イ": "PC2とPC3",
      "ウ": "PC3とPC4",
      "エ": "PC5とPC6"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 88,
    "category": "テクノロジ系",
    "body": "自然災害などによる被害からデータを保護するための対策として，遠隔地にあるデータセンターにデータをバックアップしておくことがある。このとき利用されるネットワークを介してデータを保管するサービスとして，最も適切なものはどれか。",
    "choices": {
      "ア": "ISP",
      "イ": "SaaS",
      "ウ": "オンラインストレージ",
      "エ": "ミラーリング"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 89,
    "category": "テクノロジ系",
    "body": "情報のディジタル化に関する記述のうち，アナログデータをディジタル化する例として，最も適切なものはどれか。",
    "choices": {
      "ア": "アナログの音声を標本化して量子化したデータ",
      "イ": "キーボードから入力した文字コードのデータ",
      "ウ": "マウスでクリックして入力された座標データ",
      "エ": "利用者が入力したYes又はNoのデータ"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 90,
    "category": "テクノロジ系",
    "body": "CPUのクロックに関する説明のうち，適切なものはどれか。",
    "choices": {
      "ア": "USB接続された周辺機器とCPUの間のデータ転送速度は，クロックの周波数によって決まる。",
      "イ": "クロックの間隔が短いほど命令実行に時間が掛かる。",
      "ウ": "クロックは，次に実行すべき命令の格納位置を記録する。",
      "エ": "クロックは，命令実行のタイミングを調整する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 91,
    "category": "テクノロジ系",
    "body": "次の作業a～dのうち，リスクマネジメントにおける，リスクアセスメントに含まれるものだけを全て挙げたものはどれか。\na 脅威や脆弱性などを使って，リスクレベルを決定する。\nb リスクとなる要因を特定する。\nc リスクに対してどのように対応するかを決定する。\nd リスクについて対応する優先順位を決定する。",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, d",
      "ウ": "a, c, d",
      "エ": "c, d"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 92,
    "category": "テクノロジ系",
    "body": "IoT機器からのデータ収集などを行う際の通信に用いられる，数十kmまでの範囲で無線通信が可能な広域性と省電力性を備えるものはどれか。",
    "choices": {
      "ア": "BLE",
      "イ": "LPWA",
      "ウ": "MDM",
      "エ": "MVNO"
    },
    "answer": "イ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 93,
    "category": "テクノロジ系",
    "body": "ブログのサービスで使用されるRSSリーダが表示する内容として，最も適切なものはどれか。",
    "choices": {
      "ア": "ブログから収集した記事の情報",
      "イ": "ブログにアクセスした利用者の数",
      "ウ": "ブログに投稿した記事の管理画面",
      "エ": "ブログ用のデザインテンプレート"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 94,
    "category": "テクノロジ系",
    "body": "特定のPCから重要情報を不正に入手するといった標的型攻撃に利用され，攻撃対象のPCに対して遠隔から操作を行って，ファイルの送受信やコマンドなどを実行させるものはどれか。",
    "choices": {
      "ア": "RAT",
      "イ": "VPN",
      "ウ": "デバイスドライバ",
      "エ": "ランサムウェア"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 95,
    "category": "テクノロジ系",
    "body": "関係データベースで管理された\"商品\"表，\"売上\"表から売上日が5月中で，かつ，商品ごとの合計額が20,000円以上になっている商品だけを全て挙げたものはどれか。\n[表: 商品テーブル（商品コード/商品名/単価）と売上テーブル（売上番号/商品コード/個数/売上日/配達日）]",
    "choices": {
      "ア": "商品A, 商品B, 商品C",
      "イ": "商品A, 商品B, 商品C, 商品D",
      "ウ": "商品B, 商品C",
      "エ": "商品C"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 96,
    "category": "テクノロジ系",
    "body": "情報セキュリティ方針に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "一度定めた内容は，運用が定着するまで変更してはいけない。",
      "イ": "企業が目指す情報セキュリティの理想像を記載し，その理想像に近づくための活動を促す。",
      "ウ": "企業の情報資産を保護するための重要な事項を記載しているので，社外に非公開として厳重に管理する。",
      "エ": "自社の事業内容，組織の特性及び所有する情報資産の特徴を考慮して策定する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 97,
    "category": "テクノロジ系",
    "body": "複数のコンピュータが同じ内容のデータを保持し，各コンピュータがデータの正当性を検証して担保することによって，矛盾なくデータを改ざんすることが困難となる，暗号資産の基盤技術として利用されている分散型台帳を実現したものはどれか。",
    "choices": {
      "ア": "クラウドコンピューティング",
      "イ": "ディープラーニング",
      "ウ": "ブロックチェーン",
      "エ": "リレーショナルデータベース"
    },
    "answer": "ウ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 98,
    "category": "テクノロジ系",
    "body": "インターネットで用いるドメイン名に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "ドメイン名には，アルファベット，数字，ハイフンを使うことができるが，漢字，平仮名を使うことはできない。",
      "イ": "ドメイン名は，Webサーバを指定するときのURLで使用されるものであり，電子メールアドレスには使用できない。",
      "ウ": "ドメイン名は，個人で取得することはできず，企業や団体だけが取得できる。",
      "エ": "ドメイン名は，接続先を人が識別しやすい文字列で表したものであり，IPアドレスの代わりに用いる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 99,
    "category": "テクノロジ系",
    "body": "情報セキュリティのリスクマネジメントにおいて，リスク移転，リスク回避，リスク低減，リスク保有などが分類に用いられることがある。これらに関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "リスク対応において，リスクへの対応策を分類したものであり，リスクの顕在化に備えて保険を掛けることは，リスク移転に分類される。",
      "イ": "リスク特定において，保有資産の使用目的を分類したものであり，マルウェア対策ソフトのような情報セキュリティ対策で使用される資産は，リスク低減に分類される。",
      "ウ": "リスク評価において，リスクの評価方法を分類したものであり，管理対象の資産がもつリスクについて，それを回避することが可能かどうかで評価することは，リスク回避に分類される。",
      "エ": "リスク分析において，リスクの分析手法を分類したものであり，管理対象の資産がもつ脆弱性を客観的な数値で表す手法は，リスク保有に分類される。"
    },
    "answer": "ア"
  },
  {
    "exam": "2021r03",
    "examLabel": "R03",
    "number": 100,
    "category": "テクノロジ系",
    "body": "システムの経済性の評価において，TCOの概念が重要視されるようになった理由として，最も適切なものはどれか。",
    "choices": {
      "ア": "システムの総コストにおいて，運用費に比べて初期費用の割合が増大した。",
      "イ": "システムの総コストにおいて，初期費用に比べて運用費の割合が増大した。",
      "ウ": "システムの総コストにおいて，初期費用に占めるソフトウェア費用の割合が増大した。",
      "エ": "システムの総コストにおいて，初期費用に占めるハードウェア費用の割合が増大した。"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 1,
    "category": "ストラテジ系",
    "body": "著作権及び特許権に関する記述a～cのうち，適切なものだけを全て挙げたものはどれか。\na 偶然二つの同じようなものが生み出された場合，発明に伴う特許権は両方に認められるが，著作権は一方の著作者にだけ認められる。\nb ソフトウェアの場合，特許権も著作権もソースプログラムリストに対して認められる。\nc 特許権の取得には出願と登録が必要だが，著作権は出願や登録の必要はない。",
    "choices": {
      "ア": "a, b",
      "イ": "b",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 2,
    "category": "ストラテジ系",
    "body": "年齢，性別，家族構成などによって顧客を分類し，それぞれのグループの購買行動を分析することによって，集中すべき顧客層を絞り込むマーケティング戦略として，最も適切なものはどれか。",
    "choices": {
      "ア": "サービスマーケティング",
      "イ": "セグメントマーケティング",
      "ウ": "ソーシャルマーケティング",
      "エ": "マスマーケティング"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 3,
    "category": "ストラテジ系",
    "body": "ゲーム機，家電製品などに搭載されている，ハードウェアの基本的な制御を行うためのソフトウェアはどれか。",
    "choices": {
      "ア": "グループウェア",
      "イ": "シェアウェア",
      "ウ": "ファームウェア",
      "エ": "ミドルウェア"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 4,
    "category": "ストラテジ系",
    "body": "ITの活用によって，個人の学習履歴を蓄積，解析し，学習者一人一人の学習進行度や理解度に応じて最適なコンテンツを提供することによって，学習の効率と効果を高める仕組みとして，最も適切なものはどれか。",
    "choices": {
      "ア": "アダプティブラーニング",
      "イ": "タレントマネジメント",
      "ウ": "ディープラーニング",
      "エ": "ナレッジマネジメント"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 5,
    "category": "ストラテジ系",
    "body": "NDAに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "企業などにおいて，情報システムへの脅威の監視や分析を行う専門組織",
      "イ": "契約当事者がもつ営業秘密などを特定し，相手の秘密情報を管理する意思を合意する契約",
      "ウ": "提供するサービス内容に関して，サービスの提供者と利用者が合意した，客観的な品質基準の取決め",
      "エ": "プロジェクトにおいて実施する作業を細分化し，階層構造で整理したもの"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 6,
    "category": "ストラテジ系",
    "body": "自社開発した技術の特許化に関する記述a～cのうち，直接的に得られることが期待できる効果として，適切なものだけを全て挙げたものはどれか。\na 当該技術に関連した他社とのアライアンスの際に，有利な条件を設定できる。\nb 当該技術の開発費用の一部をライセンスによって回収できる。\nc 当該技術を用いた商品や事業に対して，他社の参入を阻止できる。",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "a, b, c",
      "エ": "b, c"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 7,
    "category": "ストラテジ系",
    "body": "業務と情報システムを最適にすることを目的に，例えばビジネス，データ，アプリケーション及び技術の四つの階層において，まず現状を把握し，目標とする理想像を設定する。次に現状と理想との乖離を明確にし，目標とする理想像に向けた改善活動を移行計画として定義する。このような最適化の手法として，最も適切なものはどれか。",
    "choices": {
      "ア": "BI (Business Intelligence)",
      "イ": "EA (Enterprise Architecture)",
      "ウ": "MOT (Management of Technology)",
      "エ": "SOA (Service Oriented Architecture)"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 8,
    "category": "ストラテジ系",
    "body": "ある業務システムの再構築に関して，複数のベンダにその新システムの実現イメージの提出を求めるRFIを予定している。その際，同時にベンダからの提出を求める情報として，適切なものはどれか。",
    "choices": {
      "ア": "現行システムの概要",
      "イ": "システム再構築の狙い",
      "ウ": "新システムに求める要件",
      "エ": "適用可能な技術とその動向"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 9,
    "category": "ストラテジ系",
    "body": "不適切な行為a～cのうち，不正アクセス禁止法において規制されている行為だけを全て挙げたものはどれか。\na 他人の電子メールの利用者IDとパスワードを，正当な理由なく本人に無断で第三者に提供する。\nb 他人の電子メールの利用者IDとパスワードを本人に無断で使用して，ネットワーク経由でメールサーバ上のその人の電子メールを閲覧する。\nc メールサーバにアクセスできないよう，電子メールの利用者IDとパスワードを無効にするマルウェアを作成する。",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, c",
      "ウ": "b",
      "エ": "b, c"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 10,
    "category": "ストラテジ系",
    "body": "特許戦略を策定する上で重要な\"特許ポートフォリオ\"について述べたものはどれか。",
    "choices": {
      "ア": "企業が保有や出願している特許を，事業への貢献や特許間のシナジー，今後適用が想定される分野などを分析するためにまとめたもの",
      "イ": "技術イノベーションが発生した当初は特許出願が多くなる傾向だが，市場に支配的な製品の出現によって工程イノベーションにシフトし，特許出願が減少すること",
      "ウ": "自社製品のシェアと市場の成長率を軸にしたマトリックスに，市場における自社や競争相手の位置付けを示したもの",
      "エ": "複数の特許権者同士が，それぞれの保有する特許の実施権を相互に許諾すること"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 11,
    "category": "ストラテジ系",
    "body": "与信限度額が3,000万円に設定されている取引先の5月31日業務終了時までの全取引が表のとおりであるとき，その時点での取引先の与信の余力は何万円か。ここで，受注分も与信に含めるものとし，満期日前の手形回収は回収とはみなさないものとする。\n[表: 取引①: 4/2 売上計上 400万円, 5/31 現金回収 400万円 / 取引②: 4/10 売上計上 300万円, 5/10 手形回収 300万円（満期日:6/10） / 取引③: 5/15 売上計上 600万円 / 取引④: 5/20 受注 200万円]",
    "choices": {
      "ア": "1,100",
      "イ": "1,900",
      "ウ": "2,200",
      "エ": "2,400"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 12,
    "category": "ストラテジ系",
    "body": "クラウドファンディングは，資金提供の形態や対価の受領の仕方の違いによって，貸付型，寄付型，購入型，投資型などの種類に分けられる。A社は新規事業の資金調達を行うために，クラウドファンディングを通じて資金提供者と匿名組合契約を締結し，利益の一部を配当金として資金提供者に支払うことにした。A社が利用したクラウドファンディングの種類として，最も適切なものはどれか。",
    "choices": {
      "ア": "貸付型クラウドファンディング",
      "イ": "寄付型クラウドファンディング",
      "ウ": "購入型クラウドファンディング",
      "エ": "投資型クラウドファンディング"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 13,
    "category": "ストラテジ系",
    "body": "情報公開法に基づいて公開請求することができる文書として，適切なものはどれか。",
    "choices": {
      "ア": "国会などの立法機関が作成，保有する立法文書",
      "イ": "最高裁判所などの司法機関が作成，保有する司法文書",
      "ウ": "証券取引所に上場している企業が作成，保有する社内文書",
      "エ": "総務省などの行政機関が作成，保有する行政文書"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 14,
    "category": "ストラテジ系",
    "body": "市販のソフトウェアパッケージなどにおけるライセンス契約の一つであるシュリンクラップ契約に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "ソフトウェアパッケージの包装を開封してしまうと，使用許諾条件を理解していなかったとしても，契約は成立する。",
      "イ": "ソフトウェアパッケージの包装を開封しても，一定期間内であれば，契約を無効にできる。",
      "ウ": "ソフトウェアパッケージの包装を開封しても，購入から一定期間ソフトウェアの利用を開始しなければ，契約は無効になる。",
      "エ": "ソフトウェアパッケージの包装を開封しなくても，購入から一定期間が経過すると，契約は成立する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 15,
    "category": "ストラテジ系",
    "body": "業務プロセスを，例示するUMLのアクティビティ図を使ってモデリングしたとき，表現できるものはどれか。\n[図: 業務群A（X行: ●→◇→業務a, Y行: 業務b→◇[YES]→業務群B 業務c→●）]",
    "choices": {
      "ア": "業務で必要となるコスト",
      "イ": "業務で必要となる時間",
      "ウ": "業務で必要となる成果物の品質指標",
      "エ": "業務で必要となる人の役割"
    },
    "answer": "エ",
    "image": "img/2022r04_q15.png"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 16,
    "category": "ストラテジ系",
    "body": "マイナンバーに関する説明のうち，適切なものはどれか。",
    "choices": {
      "ア": "海外居住者を含め，日本国籍を有する者だけに付与される。",
      "イ": "企業が従業員番号として利用しても構わない。",
      "ウ": "申請をすれば，希望するマイナンバーを取得できる。",
      "エ": "付与されたマイナンバーを，自由に変更することはできない。"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 17,
    "category": "ストラテジ系",
    "body": "BYODの事例として，適切なものはどれか。",
    "choices": {
      "ア": "会社から貸与されたスマートフォンを業務中に私的に使用する。",
      "イ": "会社から貸与されたスマートフォンを業務で使用する。",
      "ウ": "会社が利用を許可した私物のスマートフォンを業務で使用する。",
      "エ": "私物のスマートフォンを業務中に私的に使用する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 18,
    "category": "ストラテジ系",
    "body": "インダストリー4.0から顕著になった取組に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "顧客ごとに異なる個別仕様の製品の，多様なITによるコスト低減と短納期での提供",
      "イ": "蒸気機関という動力を獲得したことによる，軽工業における，手作業による製品の生産から，工場制機械工業による生産への移行",
      "ウ": "製造工程のコンピュータ制御に基づく自動化による，大量生産品の更なる低コストでの製造",
      "エ": "動力の電力や石油への移行とともに，統計的手法を使った科学的生産管理による，同一規格の製品のベルトコンベア方式での大量生産"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 19,
    "category": "ストラテジ系",
    "body": "製造販売業A社は，バランススコアカードの考え方を用いて戦略テーマを設定した。業務プロセス（内部ビジネスプロセス）の視点に基づく戦略テーマとして，最も適切なものはどれか。",
    "choices": {
      "ア": "売上高の拡大",
      "イ": "顧客ロイヤルティの拡大",
      "ウ": "従業員の技術力強化",
      "エ": "部品の共有化比率の向上"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 20,
    "category": "ストラテジ系",
    "body": "あるデータを表現するために，1個のJANコードか1個のQRコードのどちらかの利用を検討する。表現できる最大のデータ量の大きい方を採用する場合，検討結果として，適切なものはどれか。",
    "choices": {
      "ア": "JANコードを採用する。",
      "イ": "QRコードを採用する。",
      "ウ": "表現する内容によって最大のデータ量は変化するので決められない。",
      "エ": "表現できる最大のデータ量は同じなので決められない。"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 21,
    "category": "ストラテジ系",
    "body": "政府が定める\"人間中心のAI社会原則\"では，三つの価値を理念として尊重し，その実現を追求する社会を構築していくべきとしている。実現を追求していくべき社会の姿だけを全て挙げたものはどれか。\na 持続性ある社会\nb 多様な背景を持つ人々が多様な幸せを追求できる社会\nc 人間があらゆる労働から解放される社会\nd 人間の尊厳が尊重される社会",
    "choices": {
      "ア": "a, b, c",
      "イ": "a, b, d",
      "ウ": "a, c, d",
      "エ": "b, c, d"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 22,
    "category": "ストラテジ系",
    "body": "SCMシステムを構築する目的はどれか。",
    "choices": {
      "ア": "企業のもっている強み，弱みを評価し，その弱みを補完するために，どの企業と提携すればよいかを決定する。",
      "イ": "商品の生産から消費に関係する部門や企業の間で，商品の生産，在庫，販売などの情報を相互に共有して管理することによって，商品の流通在庫の削減や顧客満足の向上を図る。",
      "ウ": "顧客に提供する価値が調達，開発，製造，販売，サービスといった一連の企業活動のどこで生み出されているのかを明確化する。",
      "エ": "多種類の製品を生産及び販売している企業が，利益を最大化するために，最も効率的・効果的な製品の製造・販売の組合せを決定する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 23,
    "category": "ストラテジ系",
    "body": "オプトアウトに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "SNSの事業者が，お知らせメールの配信を希望した利用者だけに，新機能を紹介するメールを配信した。",
      "イ": "住宅地図の利用者が，地図上の自宅の位置に自分の氏名が掲載されているのを見つけたので，住宅地図の作製業者に連絡して，掲載を中止させた。",
      "ウ": "通信販売の利用者が，Webサイトで商品を購入するための操作を進めていたが，決済の手続が面倒だったので，画面を閉じて購入を中止した。",
      "エ": "ドラッグストアの事業者が，販売予測のために顧客データを分析する際に，氏名や住所などの情報をランダムな値に置き換え，顧客を特定できないようにした。"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 24,
    "category": "ストラテジ系",
    "body": "教師あり学習の事例に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "衣料品を販売するサイトで，利用者が気に入った服の画像を送信すると，画像の特徴から利用者の好みを自動的に把握し，好みに合った商品を提案する。",
      "イ": "気温，天候，積雪，風などの条件を与えて，あらかじめ準備しておいたルールベースのプログラムによって，ゲレンデの状態がスキーに適しているか判断する。",
      "ウ": "麺類の山からアームを使って一人分を取り，容器に盛り付ける動作の訓練を繰り返すロボットが，弁当の盛り付けを上手に行う。",
      "エ": "録音された乳児の泣き声と，泣いている原因から成るデータを収集して入力することによって，乳児が泣いている原因を泣き声から推測する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 25,
    "category": "ストラテジ系",
    "body": "a～dのうち，業務プロセスの改善に当たり，業務プロセスを表記するために用いられる図表だけを全て挙げたものはどれか。\na DFD\nb アクティビティ図\nc パレート図\nd レーダチャート",
    "choices": {
      "ア": "a, b",
      "イ": "a, c",
      "ウ": "b, d",
      "エ": "c, d"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 26,
    "category": "ストラテジ系",
    "body": "自社が保有していない技術やノウハウを，他社から短期間で補完するための手段として，適切なものはどれか。",
    "choices": {
      "ア": "BPR",
      "イ": "アライアンス",
      "ウ": "インキュベーション",
      "エ": "ベンチマーキング"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 27,
    "category": "ストラテジ系",
    "body": "個人情報保護法で定められた，特に取扱いに配慮が必要となる\"要配慮個人情報\"に該当するものはどれか。",
    "choices": {
      "ア": "学歴",
      "イ": "国籍",
      "ウ": "資産額",
      "エ": "信条"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 28,
    "category": "ストラテジ系",
    "body": "A社のある期の資産，負債及び純資産が次のとおりであるとき，経営の安全性指標の一つで，短期の支払能力を示す流動比率は何％か。\n[表: 資産の部: 流動資産 3,000 / 固定資産 4,500 | 負債の部: 流動負債 1,500 / 固定負債 4,000 | 純資産の部: 株主資本 2,000] 単位 百万円",
    "choices": {
      "ア": "50",
      "イ": "100",
      "ウ": "150",
      "エ": "200"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 29,
    "category": "ストラテジ系",
    "body": "マネーロンダリングの対策に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "金融取引に当たり，口座開設時の取引目的や本人確認を徹底し，資金の出所が疑わしい取引かどうかを監視する。",
      "イ": "紙幣の印刷に当たり，コピー機では再現困難な文字や線，傾けることによって絵が浮かび上がるホログラムなどの技術を用いて，複製を困難にする。",
      "ウ": "税金の徴収に当たり，外国にある子会社の利益を本国の親会社に配当されたものとみなして，本国で課税する。",
      "エ": "投資に当たり，安全性や収益性などの特徴が異なる複数の金融商品を組み合わせることによって，一つの事象によって損失が大きくなるリスクを抑える。"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 30,
    "category": "ストラテジ系",
    "body": "営業利益を求める計算式はどれか。",
    "choices": {
      "ア": "（売上高）－（売上原価）",
      "イ": "（売上総利益）－（販売費及び一般管理費）",
      "ウ": "（経常利益）＋（特別利益）－（特別損失）",
      "エ": "（税引前当期純利益）－（法人税，住民税及び事業税）"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 31,
    "category": "ストラテジ系",
    "body": "コールセンタの顧客サービスレベルを改善するために，顧客から寄せられたコールセンタ対応に関する苦情を分類集計する。苦情の多い順に，件数を棒グラフ，累積百分率を折れ線グラフで表し，対応の優先度を判断するのに適した図はどれか。",
    "choices": {
      "ア": "PERT図",
      "イ": "管理図",
      "ウ": "特性要因図",
      "エ": "パレート図"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 32,
    "category": "ストラテジ系",
    "body": "コンカレントエンジニアリングを適用した後の業務の流れを表した図として，最も適したものはどれか。ここで，図の中の矢印は業務の流れを示し，その上に各作業名を記述する。\n[図: ア=仕様→製作図→工程図→製作（直列）, イ=仕様→製作図→工程図→製作（製作が工程図にフィードバック）, ウ=仕様⇔製作図⇔工程図→製作（双方向矢印で並行）, エ=仕様/製作図/工程図/製作（ウォーターフォール的に段階的に開始）]",
    "choices": {
      "ア": "ア",
      "イ": "イ",
      "ウ": "ウ",
      "エ": "エ"
    },
    "answer": "エ",
    "image": "img/2022r04_q32.png"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 33,
    "category": "ストラテジ系",
    "body": "IT機器やソフトウェア，情報などについて，利用者の身体の特性や能力の違いなどにかかわらず，様々な人が同様に操作，入手，利用できる状態又は度合いを表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "アクセシビリティ",
      "イ": "スケーラビリティ",
      "ウ": "ダイバーシティ",
      "エ": "トレーサビリティ"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 34,
    "category": "ストラテジ系",
    "body": "あるオンラインサービスでは，新たに作成したデザインと従来のデザインのWebサイトを実験的に並行稼働し，どちらのWebサイトの利用者がより有料サービスの申込みに至りやすいかを比較，検証した。このとき用いた手法として，最も適切なものはどれか。",
    "choices": {
      "ア": "A/Bテスト",
      "イ": "ABC分析",
      "ウ": "クラスタ分析",
      "エ": "リグレッションテスト"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 35,
    "category": "ストラテジ系",
    "body": "あるコールセンタでは，AIを活用した業務改革の検討を進めて，導入するシステムを絞り込んだ。しかし，想定している効果が得られるかなど不明点が多いので，試行して実現性の検証を行うことにした。このような検証を何というか。",
    "choices": {
      "ア": "IoT",
      "イ": "PoC",
      "ウ": "SoE",
      "エ": "SoR"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 36,
    "category": "マネジメント系",
    "body": "プロジェクトで作成するWBSに関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "WBSではプロジェクトで実施すべき作業内容と成果物を定義するので，作業工数を見積もるときの根拠として使用できる。",
      "イ": "WBSには，プロジェクトのスコープ外の作業も検討して含める。",
      "ウ": "全てのプロジェクトにおいて，WBSは成果物と作業内容を同じ階層まで詳細化する。",
      "エ": "プロジェクトの担当者がスコープ内の類似作業を実施する場合，WBSにはそれらの作業を記載しなくてよい。"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 37,
    "category": "マネジメント系",
    "body": "システムによる内部統制を目的として，幾つかの機能を実装した。次の処理は，どの機能の実現例として適切か。\nログイン画面を表示して利用者IDとパスワードを入力する。利用者IDとパスワードの組合せがあらかじめ登録されている内容と一致する場合は業務メニュー画面に遷移する。一致しない場合は遷移せずにエラーメッセージを表示する。",
    "choices": {
      "ア": "システム障害の検知",
      "イ": "システムによるアクセス制御",
      "ウ": "利用者に対するアクセス権の付与",
      "エ": "利用者のパスワード設定の妥当性の確認"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 38,
    "category": "マネジメント系",
    "body": "XP（エクストリームプログラミング）の説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "テストプログラムを先に作成し，そのテストに合格するようにコードを記述する開発手法のことである。",
      "イ": "一つのプログラムを2人のプログラマが，1台のコンピュータに向かって共同で開発する方法のことである。",
      "ウ": "プログラムの振る舞いを変えずに，プログラムの内部構造を改善することである。",
      "エ": "要求の変化に対応した高品質のソフトウェアを短いサイクルでリリースする，アジャイル開発のアプローチの一つである。"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 39,
    "category": "マネジメント系",
    "body": "提供するITサービスの価値を高めるためには，サービスの提供価格，どのようなことができるかというサービスの機能，及び可用性などを維持するというサービスの保証の三つのバランスを考慮する必要がある。インスタントメッセンジャのサービスに関する記述のうち，サービスの保証に当たるものはどれか。",
    "choices": {
      "ア": "24時間365日利用可能である。",
      "イ": "ゲームなどの他のソフトウェアと連携可能である。",
      "ウ": "無料で利用可能である。",
      "エ": "文字の代わりに自分で作成したアイコンも利用可能である。"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 40,
    "category": "マネジメント系",
    "body": "ITガバナンスに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "ITサービスマネジメントに関して，広く利用されているベストプラクティスを集めたもの",
      "イ": "システム及びソフトウェア開発とその取引の適正化に向けて，それらのベースとなる作業項目の一つ一つを定義して標準化したもの",
      "ウ": "経営陣が組織の価値を高めるために実践する行動であり，情報システム戦略の策定及び実現に必要な組織能力のこと",
      "エ": "プロジェクトの要求事項を満足させるために，知識，スキル，ツール，技法をプロジェクト活動に適用すること"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 41,
    "category": "マネジメント系",
    "body": "テレワークを推進しているある会社では，サテライトオフィスを構築している。サテライトオフィスで使用するネットワーク機器やPCを対象に，落雷による過電流を防止するための対策を検討した。有効な対策として，最も適切なものはどれか。",
    "choices": {
      "ア": "グリーンITに対応した機器の設置",
      "イ": "サージ防護に対応した機器の設置",
      "ウ": "無線LANルータの設置",
      "エ": "無停電電源装置の設置"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 42,
    "category": "マネジメント系",
    "body": "システムの開発側と運用側がお互いに連携し合い，運用や本番移行を自動化する仕組みなどを積極的に取り入れ，新機能をリリースしてサービスの改善を行う取組を表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "DevOps",
      "イ": "RAD",
      "ウ": "オブジェクト指向開発",
      "エ": "テスト駆動開発"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 43,
    "category": "マネジメント系",
    "body": "図のアローダイアグラムにおいて，作業Bが2日遅れて完了した。そこで，予定どおりの期間で全ての作業を完了させるために，作業Dに要員を追加することにした。作業Dに当初20名が割り当てられているとき，作業Dに追加する要員は最少で何名必要か。ここで，要員の作業効率は一律である。\n[図: アローダイアグラム A=5, B=10, C=5, D=10, E=4, F=4]",
    "choices": {
      "ア": "2",
      "イ": "3",
      "ウ": "4",
      "エ": "5"
    },
    "answer": "エ",
    "image": "img/2022r04_q43.png"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 44,
    "category": "マネジメント系",
    "body": "ITサービスマネジメントにおけるインシデント管理の目的として，適切なものはどれか。",
    "choices": {
      "ア": "インシデントの原因を分析し，根本的な原因を解決することによって，インシデントの再発を防止する。",
      "イ": "サービスに対する全ての変更を一元的に管理することによって，変更に伴う障害発生などのリスクを低減する。",
      "ウ": "サービスを構成する全ての機器やソフトウェアに関する情報を最新，正確に維持管理する。",
      "エ": "インシデントによって中断しているサービスを可能な限り迅速に回復する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 45,
    "category": "マネジメント系",
    "body": "ブラックボックステストに関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "プログラムの全ての分岐についてテストする。",
      "イ": "プログラムの全ての命令についてテストする。",
      "ウ": "プログラムの内部構造に基づいてテストする。",
      "エ": "プログラムの入力と出力に着目してテストする。"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 46,
    "category": "マネジメント系",
    "body": "a～dのうち，ファシリティマネジメントに関する実施事項として，適切なものだけを全て挙げたものはどれか。\na コンピュータを設置した建物への入退館の管理\nb 社内のPCへのマルウェア対策ソフトの導入と更新管理\nc 情報システムを構成するソフトウェアのライセンス管理\nd 停電時のデータ消失防止のための無停電電源装置の設置",
    "choices": {
      "ア": "a, c",
      "イ": "a, d",
      "ウ": "b, d",
      "エ": "c, d"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 47,
    "category": "マネジメント系",
    "body": "ソフトウェア保守に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "本番環境で運用中のシステムに対して，ソフトウェアの潜在不良を発見し，障害が発生する前に修正を行うことはソフトウェア保守には含まれない。",
      "イ": "本番環境で運用中のシステムに対して，ソフトウェアの不具合を修正することがソフトウェア保守であり，仕様変更に伴う修正はソフトウェア保守には含まれない。",
      "ウ": "本番環境で運用中のシステムに対して，法律改正に伴うソフトウェア修正もソフトウェア保守に含まれる。",
      "エ": "本番環境で運用中のシステムに対する修正だけでなく，納入前のシステム開発期間中に実施した不具合の修正もソフトウェア保守に含まれる。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 48,
    "category": "マネジメント系",
    "body": "システム開発プロジェクトの品質マネジメントにおいて，品質上の問題と原因との関連付けを行って根本原因を追究する方法の説明として，適切なものはどれか。",
    "choices": {
      "ア": "管理限界を設定し，上限と下限を逸脱する事象から根本原因を推定する。",
      "イ": "原因の候補リストから原因に該当しないものを削除し，残った項目から根本原因を絞り込む。",
      "ウ": "候補となる原因を魚の骨の形で整理し，根本原因を検討する。",
      "エ": "複数の原因を分類し，件数が多かった原因の順に対処すべき根本原因の優先度を決めていく。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 49,
    "category": "マネジメント系",
    "body": "ITサービスの利用者からの問合せに自動応答で対応するために，チャットボットを導入することにした。このようにチャットボットによる自動化が有効な管理プロセスとして，最も適切なものはどれか。",
    "choices": {
      "ア": "インシデント管理",
      "イ": "構成管理",
      "ウ": "変更管理",
      "エ": "問題管理"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 50,
    "category": "マネジメント系",
    "body": "120kステップのソフトウェアを開発した。開発の各工程における生産性の実績が表のとおりであるとき，開発全体の工数は何人月か。ここで，生産性は1人月当たりのkステップとする。\n[表: 設計 6.0 / 製造 4.0] 単位 kステップ／人月",
    "choices": {
      "ア": "10",
      "イ": "12",
      "ウ": "24",
      "エ": "50"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 51,
    "category": "マネジメント系",
    "body": "ITサービスマネジメントにおけるSLAに関する次の記述において，a，bに当てはまる語句の組合せとして，適切なものはどれか。\nSLAは，[a]と[b]との間で交わされる合意文書である。[a]が期待するサービスの目標値を定量化して合意した上でSLAに明記し，[b]はこれを測定・評価した上でサービスの品質を改善していく。",
    "choices": {
      "ア": "a:経営者 b:システム監査人",
      "イ": "a:顧客 b:サービスの供給者",
      "ウ": "a:システム開発の発注者 b:システム開発の受託者",
      "エ": "a:データの分析者 b:データの提供者"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 52,
    "category": "マネジメント系",
    "body": "A社がB社にシステム開発を発注し，システム開発プロジェクトを開始した。プロジェクトの関係者①～④のうち，プロジェクトのステークホルダとなるものだけを全て挙げたものはどれか。\n① A社の経営者\n② A社の利用部門\n③ B社のプロジェクトマネージャ\n④ B社を技術支援する協力会社",
    "choices": {
      "ア": "①, ②, ④",
      "イ": "①, ②, ③, ④",
      "ウ": "②, ③, ④",
      "エ": "②, ④"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 53,
    "category": "マネジメント系",
    "body": "a～dのうち，システム監査人が，合理的な評価・結論を得るために予備調査や本調査のときに利用する調査手段に関する記述として，適切なものだけを全て挙げたものはどれか。\na EA (Enterprise Architecture) の活用\nb コンピュータを利用した監査技法の活用\nc 資料や文書の閲覧\nd ヒアリング",
    "choices": {
      "ア": "a, b, c",
      "イ": "a, b, d",
      "ウ": "a, c, d",
      "エ": "b, c, d"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 54,
    "category": "マネジメント系",
    "body": "顧客からの電話による問合せに対応しているサービスデスクが，次のようなオペレータ支援システムを導入した。このシステム導入で期待できる効果a～cのうち，適切なものだけを全て挙げたものはどれか。\n顧客とオペレータの会話をシステムが認識し，瞬時に知識データベースと照合，次に確認すべき事項や最適な回答の候補をオペレータのディスプレイに表示する。\na 経験の浅いオペレータでも最適な回答候補を基に顧客対応ができるので，オペレータによる対応のばらつきを抑えることができる。\nb 顧客の用件を自動的に把握して回答するので，電話による問合せに24時間対応することができる。\nc 対応に必要な情報をオペレータが探す必要がなくなるので，個々の顧客対応時間を短縮することができる。",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, c",
      "ウ": "a, c",
      "エ": "b, c"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 55,
    "category": "テクノロジ系",
    "body": "情報セキュリティにおけるPCI DSSの説明として，適切なものはどれか。",
    "choices": {
      "ア": "クレジットカード情報を取り扱う事業者に求められるセキュリティ基準",
      "イ": "コンピュータなどに内蔵されるセキュリティ関連の処理を行う半導体チップ",
      "ウ": "コンピュータやネットワークのセキュリティ事故に対応する組織",
      "エ": "サーバやネットワークの通信を監視し，不正なアクセスを検知して攻撃を防ぐシステム"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 56,
    "category": "テクノロジ系",
    "body": "ランサムウェアによる損害を受けてしまった場合を想定して，その損害を軽減するための対策例として，適切なものはどれか。",
    "choices": {
      "ア": "PC内の重要なファイルは，PCから取外し可能な外部記憶装置に定期的にバックアップしておく。",
      "イ": "Webサービスごとに，使用するIDやパスワードを異なるものにしておく。",
      "ウ": "マルウェア対策ソフトを用いてPC内の全ファイルの検査をしておく。",
      "エ": "無線LANを使用するときには，WPA2を用いて通信内容を暗号化しておく。"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 57,
    "category": "テクノロジ系",
    "body": "推論に関する次の記述中のa，bに入れる字句の適切な組合せはどれか。\n[a]は，個々の事例を基にして，事例に共通する規則を得る方法であり，得られた規則は[b]。",
    "choices": {
      "ア": "a:演繹推論 b:成立しないことがある",
      "イ": "a:演繹推論 b:常に成立する",
      "ウ": "a:帰納推論 b:成立しないことがある",
      "エ": "a:帰納推論 b:常に成立する"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 58,
    "category": "テクノロジ系",
    "body": "ISMSの計画，運用，パフォーマンス評価及び改善において，パフォーマンス評価で実施するものはどれか。",
    "choices": {
      "ア": "運用の計画及び管理",
      "イ": "内部監査",
      "ウ": "不適合の是正処置",
      "エ": "リスクの決定"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 59,
    "category": "テクノロジ系",
    "body": "次のデータの平均値と中央値の組合せはどれか。\n[データ] 10, 20, 20, 20, 40, 50, 100, 440, 2000",
    "choices": {
      "ア": "平均値:20 中央値:40",
      "イ": "平均値:40 中央値:20",
      "ウ": "平均値:300 中央値:20",
      "エ": "平均値:300 中央値:40"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 60,
    "category": "テクノロジ系",
    "body": "公開鍵暗号方式で使用する鍵に関する次の記述中のa，bに入れる字句の適切な組合せはどれか。\nそれぞれ公開鍵と秘密鍵をもつA社とB社で情報を送受信するとき，他者に通信を傍受されても内容を知られないように，情報を暗号化して送信することにした。\nA社からB社に情報を送信する場合，A社は[a]を使って暗号化した情報をB社に送信する。B社はA社から受信した情報を[b]で復号して情報を取り出す。",
    "choices": {
      "ア": "a:A社の公開鍵 b:A社の公開鍵",
      "イ": "a:A社の公開鍵 b:B社の秘密鍵",
      "ウ": "a:B社の公開鍵 b:A社の公開鍵",
      "エ": "a:B社の公開鍵 b:B社の秘密鍵"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 61,
    "category": "テクノロジ系",
    "body": "大学のキャンパス案内のWebページ内に他のWebサービスが提供する地図情報を組み込んで表示するなど，公開されているWebページやWebサービスを組み合わせて一つの新しいコンテンツを作成する手法を何と呼ぶか。",
    "choices": {
      "ア": "シングルサインオン",
      "イ": "デジタルフォレンジックス",
      "ウ": "トークン",
      "エ": "マッシュアップ"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 62,
    "category": "テクノロジ系",
    "body": "アドホックネットワークの説明として，適切なものはどれか。",
    "choices": {
      "ア": "アクセスポイントを経由せず，端末同士が相互に通信を行う無線ネットワーク",
      "イ": "インターネット上に，セキュリティが保たれたプライベートな環境を実現するネットワーク",
      "ウ": "サーバと，そのサーバを利用する複数台のPCをつなぐ有線ネットワーク",
      "エ": "本店と支店など，遠く離れた拠点間を結ぶ広域ネットワーク"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 63,
    "category": "テクノロジ系",
    "body": "スマートフォンやタブレットなどの携帯端末に用いられている，OSS (Open Source Software) であるOSはどれか。",
    "choices": {
      "ア": "Android",
      "イ": "iOS",
      "ウ": "Safari",
      "エ": "Windows"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 64,
    "category": "テクノロジ系",
    "body": "a～dのうち，ファイアウォールの設置によって実現できる事項として，適切なものだけを全て挙げたものはどれか。\na 外部に公開するWebサーバやメールサーバを設置するためのDMZの構築\nb 外部のネットワークから組織内部のネットワークへの不正アクセスの防止\nc サーバルームの入り口に設置することによるアクセスを承認された人だけの入室\nd 不特定多数のクライアントからの大量の要求を複数のサーバに動的に振り分けることによるサーバ負荷の分散",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, d",
      "ウ": "b, c",
      "エ": "c, d"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 65,
    "category": "テクノロジ系",
    "body": "条件①～⑤によって，関係データベースで管理する\"従業員\"表と\"部門\"表を作成した。\"従業員\"表の主キーとして，最も適切なものはどれか。\n[条件] ① 各従業員は重複のない従業員番号を一つもつ。② 同姓同名の従業員がいてもよい。③ 各部門は重複のない部門コードを一つもつ。④ 一つの部門には複数名の従業員が所属する。⑤ 1人の従業員が所属する部門は一つだけである。\n[従業員表: 従業員番号, 従業員名, 部門コード, 生年月日, 住所] [部門表: 部門コード, 部門名, 所在地]",
    "choices": {
      "ア": "\"従業員番号\"",
      "イ": "\"従業員番号\"と\"部門コード\"",
      "ウ": "\"従業員名\"",
      "エ": "\"部門コード\""
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 66,
    "category": "テクノロジ系",
    "body": "IoT機器やスマートフォンなどに内蔵されているバッテリの容量の表記において，\"100mAh\"の意味として，適切なものはどれか。",
    "choices": {
      "ア": "100mAの電流を1時間放電できる。",
      "イ": "100分間の充電で，電流を1時間放電できる。",
      "ウ": "1Aの電流を100分間放電できる。",
      "エ": "1時間の充電で，電流を100分間放電できる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 67,
    "category": "テクノロジ系",
    "body": "ディープラーニングに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "インターネット上に提示された教材を使って，距離や時間の制約を受けることなく，習熟度に応じて学習をする方法である。",
      "イ": "コンピュータが大量のデータを分析し，ニューラルネットワークを用いて自ら規則性を見つけ出し，推論や判断を行う。",
      "ウ": "体系的に分類された特定分野の専門的な知識から，適切な回答を提供する。",
      "エ": "一人一人の習熟度，理解に応じて，問題の難易度や必要とする知識，スキルを推定する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 68,
    "category": "テクノロジ系",
    "body": "無線LANルータにおいて，外部から持ち込まれた端末用に設けられた，\"ゲストポート\"や\"ゲストSSID\"などと呼ばれる機能によって実現できることの説明として，適切なものはどれか。",
    "choices": {
      "ア": "端末から内部ネットワークには接続させず，インターネットにだけ接続する。",
      "イ": "端末がマルウェアに感染していないかどうかを検査し，安全が確認された端末だけを接続する。",
      "ウ": "端末と無線LANルータのボタン操作だけで，端末から無線LANルータへの接続設定ができる。",
      "エ": "端末のSSIDの設定欄を空欄にしておけば，SSIDが分からなくても無線LANルータに接続できる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 69,
    "category": "テクノロジ系",
    "body": "サイバーキルチェーンの説明として，適切なものはどれか。",
    "choices": {
      "ア": "情報システムへの攻撃段階を，偵察，攻撃，目的の実行などの複数のフェーズに分けてモデル化したもの",
      "イ": "ハブやスイッチなどの複数のネットワーク機器を数珠つなぎに接続していく接続方式",
      "ウ": "ブロックと呼ばれる幾つかの取引記録をまとめた単位を，一つ前のブロックの内容を示すハッシュ値を設定して，鎖のようにつなぐ分散管理台帳技術",
      "エ": "本文中に他者への転送を促す文言が記述された迷惑な電子メールが，不特定多数を対象に，ネットワーク上で次々と転送されること"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 70,
    "category": "テクノロジ系",
    "body": "電子メールにデジタル署名を付与することによって得られる効果だけを全て挙げたものはどれか。\na 可用性が向上する。\nb 完全性が向上する。\nc 機密性が向上する。",
    "choices": {
      "ア": "a, b",
      "イ": "a, c",
      "ウ": "b",
      "エ": "b, c"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 71,
    "category": "テクノロジ系",
    "body": "文書作成ソフトがもつ機能である禁則処理が行われた例はどれか。",
    "choices": {
      "ア": "改行後の先頭文字が，指定した文字数分だけ右へ移動した。",
      "イ": "行頭に置こうとした句読点や閉じ括弧が，前の行の行末に移動した。",
      "ウ": "行頭の英字が，小文字から大文字に変換された。",
      "エ": "文字列の文字が，指定した幅の中に等間隔に配置された。"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 72,
    "category": "テクノロジ系",
    "body": "情報セキュリティにおける機密性，完全性及び可用性と，①～③のインシデントによって損なわれたものとの組合せとして，適切なものはどれか。\n① DDoS攻撃によって，Webサイトがダウンした。\n② キーボードの打ち間違いによって，不正確なデータが入力された。\n③ PCがマルウェアに感染したことによって，個人情報が漏えいした。",
    "choices": {
      "ア": "①可用性 ②完全性 ③機密性",
      "イ": "①可用性 ②機密性 ③完全性",
      "ウ": "①完全性 ②可用性 ③機密性",
      "エ": "①完全性 ②機密性 ③可用性"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 73,
    "category": "テクノロジ系",
    "body": "膨大な数のIoTデバイスをインターネットに接続するために大量のIPアドレスが必要となり，IPアドレスの長さが128ビットで構成されているインターネットプロトコルを使用することにした。このプロトコルはどれか。",
    "choices": {
      "ア": "IPv4",
      "イ": "IPv5",
      "ウ": "IPv6",
      "エ": "IPv8"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 74,
    "category": "テクノロジ系",
    "body": "サーバ室など，セキュリティで保護された区画への入退室管理において，一人の認証で他者も一緒に入室する共連れの防止対策として，利用されるものはどれか。",
    "choices": {
      "ア": "アンチパスバック",
      "イ": "コールバック",
      "ウ": "シングルサインオン",
      "エ": "バックドア"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 75,
    "category": "テクノロジ系",
    "body": "バイオメトリクス認証に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "指紋や静脈を使用した認証は，ショルダーハックなどののぞき見行為によって容易に認証情報が漏えいする。",
      "イ": "装置が大型なので，携帯電話やスマートフォンには搭載できない。",
      "ウ": "筆跡やキーストロークなどの本人の行動的な特徴を利用したものも含まれる。",
      "エ": "他人を本人と誤って認証してしまうリスクがない。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 76,
    "category": "テクノロジ系",
    "body": "情報セキュリティのリスクマネジメントにおけるリスク対応を，リスク回避，リスク共有，リスク低減及びリスク保有の四つに分類するとき，情報漏えい発生時の損害に備えてサイバー保険に入ることはどれに分類されるか。",
    "choices": {
      "ア": "リスク回避",
      "イ": "リスク共有",
      "ウ": "リスク低減",
      "エ": "リスク保有"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 77,
    "category": "テクノロジ系",
    "body": "トランザクション処理のACID特性に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "索引を用意することによって，データの検索時の検索速度を高めることができる。",
      "イ": "データの更新時に，一連の処理が全て実行されるか，全く実行されないように制御することによって，原子性を保証することができる。",
      "ウ": "データベースの複製を複数のサーバに分散配置することによって，可用性を高めることができる。",
      "エ": "テーブルを正規化することによって，データに矛盾や重複が生じるのを防ぐことができる。"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 78,
    "category": "テクノロジ系",
    "body": "関数checkDigitは，10進9桁の整数の各桁の数字が上位の桁から順に格納された整数型の配列originalDigitを引数として，次の手順で計算したチェックデジットを戻り値とする。プログラム中のaに入れる字句として，適切なものはどれか。ここで，配列の要素番号は1から始まる。\n[手順]\n(1) 配列originalDigitの要素番号1～9の要素の値を合計する。\n(2) 合計した値が9より大きい場合は，合計した値を10進の整数で表現したときの各桁の数字を合計する。この操作を，合計した値が9以下になるまで繰り返す。\n(3) (2)で得られた値をチェックデジットとする。\n[プログラム]\n○整数型: checkDigit(整数型の配列: originalDigit)\n  整数型: i, j, k\n  j ← 0\n  for (i を 1 から originalDigitの要素数 まで 1 ずつ増やす)\n    j ← j + originalDigit[i]\n  endfor\n  while (j が 9 より大きい)\n    k ← j ÷ 10 の商\n    [a]\n  endwhile\n  return j",
    "choices": {
      "ア": "j ← j − 10 × k",
      "イ": "j ← k + (j − 10 × k)",
      "ウ": "j ← k + (j − 10) × k",
      "エ": "j ← k + j"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 79,
    "category": "テクノロジ系",
    "body": "流れ図で示す処理を終了したとき，xの値はどれか。\n[流れ図: x=98, y=42, 繰返し x=y (終了条件), x>y なら x←x-y, x≤y なら y←y-x]",
    "choices": {
      "ア": "0",
      "イ": "14",
      "ウ": "28",
      "エ": "56"
    },
    "answer": "イ",
    "image": "img/2022r04_q79.png"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 80,
    "category": "テクノロジ系",
    "body": "自動車などの移動体に搭載されたセンサや表示機器を通信システムや情報システムと連動させて，運転者へ様々な情報をリアルタイムに提供することを可能にするものはどれか。",
    "choices": {
      "ア": "アクチュエータ",
      "イ": "キャリアアグリゲーション",
      "ウ": "スマートメータ",
      "エ": "テレマティクス"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 81,
    "category": "テクノロジ系",
    "body": "CPUの性能に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "32ビットCPUと64ビットCPUでは，64ビットCPUの方が一度に処理するデータ長を大きくできる。",
      "イ": "CPU内のキャッシュメモリの容量は，少ないほどCPUの処理速度が向上する。",
      "ウ": "同じ構造のCPUにおいて，クロック周波数を下げると処理速度が向上する。",
      "エ": "デュアルコアCPUとクアッドコアCPUでは，デュアルコアCPUの方が同時に実行する処理の数を多くできる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 82,
    "category": "テクノロジ系",
    "body": "A社では，従業員の利用者IDとパスワードを用いて社内システムの利用者認証を行っている。セキュリティを強化するために，このシステムに新たな認証機能を一つ追加することにした。認証機能a～cのうち，このシステムに追加することによって，二要素認証になる機能だけを全て挙げたものはどれか。\na A社の従業員証として本人に支給しているICカードを読み取る認証\nb あらかじめシステムに登録しておいた本人しか知らない秘密の質問に対する答えを入力させる認証\nc あらかじめシステムに登録しておいた本人の顔の特徴と，認証時にカメラで読み取った顔の特徴を照合する認証",
    "choices": {
      "ア": "a",
      "イ": "a, b, c",
      "ウ": "a, c",
      "エ": "b, c"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 83,
    "category": "テクノロジ系",
    "body": "データを行と列から成る表形式で表すデータベースのモデルはどれか。",
    "choices": {
      "ア": "オブジェクトモデル",
      "イ": "階層モデル",
      "ウ": "関係モデル",
      "エ": "ネットワークモデル"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 84,
    "category": "テクノロジ系",
    "body": "IoT機器の記録装置としても用いられ，記録媒体が半導体でできており物理的な駆動機構をもたないので，HDDと比較して低消費電力で耐衝撃性も高いものはどれか。",
    "choices": {
      "ア": "DRM",
      "イ": "DVD",
      "ウ": "HDMI",
      "エ": "SSD"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 85,
    "category": "テクノロジ系",
    "body": "情報セキュリティポリシを，基本方針，対策基準，実施手順の三つの文書で構成したとき，これらに関する説明のうち，適切なものはどれか。",
    "choices": {
      "ア": "基本方針は，対策基準や実施手順を定めるためのトップマネジメントの意思を示したものである。",
      "イ": "実施手順は，基本方針と対策基準を定めるために実施した作業の手順を記録したものである。",
      "ウ": "対策基準は，ISMSに準拠した情報セキュリティポリシを策定するための文書の基準を示したものである。",
      "エ": "対策基準は，情報セキュリティ事故が発生した後の対策を実施手順よりも詳しく記述したものである。"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 86,
    "category": "テクノロジ系",
    "body": "情報セキュリティにおけるリスクアセスメントを，リスク特定，リスク分析，リスク評価の三つのプロセスに分けたとき，リスク分析に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "受容基準と比較できるように，各リスクのレベルを決定する必要がある。",
      "イ": "全ての情報資産を分析の対象にする必要がある。",
      "ウ": "特定した全てのリスクについて，同じ分析技法を用いる必要がある。",
      "エ": "リスクが受容可能かどうかを決定する必要がある。"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 87,
    "category": "テクノロジ系",
    "body": "メールサーバから電子メールを受信するためのプロトコルの一つであり，次の特徴をもつものはどれか。\n① メール情報をPC内のメールボックスに取り込んで管理する必要がなく，メールサーバ上に複数のフォルダで構成されたメールボックスを作成してメール情報を管理できる。\n② PCやスマートフォンなど使用する端末が違っても，同一のメールボックスのメール情報を参照，管理できる。",
    "choices": {
      "ア": "IMAP",
      "イ": "NTP",
      "ウ": "SMTP",
      "エ": "WPA"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 88,
    "category": "テクノロジ系",
    "body": "IoTデバイスで収集した情報をIoTサーバに送信するときに利用されるデータ形式に関する次の記述中のa，bに入れる字句の適切な組合せはどれか。\n[a]形式は，コンマなどの区切り文字で，データの区切りを示すデータ形式であり，[b]形式は，マークアップ言語であり，データの論理構造を，タグを用いて記述できるデータ形式である。",
    "choices": {
      "ア": "a:CSV b:JSON",
      "イ": "a:CSV b:XML",
      "ウ": "a:RSS b:JSON",
      "エ": "a:RSS b:XML"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 89,
    "category": "テクノロジ系",
    "body": "電子メールを作成するときに指定する送信メッセージに用いられるテキスト形式とHTML形式に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "受信した電子メールを開いたときに，本文に記述されたスクリプトが実行される可能性があるのは，HTML形式ではなく，テキスト形式である。",
      "イ": "電子メールにファイルを添付できるのは，テキスト形式ではなく，HTML形式である。",
      "ウ": "電子メールの本文の任意の文字列にハイパリンクを設定できるのは，テキスト形式ではなく，HTML形式である。",
      "エ": "電子メールの本文の文字に色や大きさなどの書式を設定できるのは，HTML形式ではなく，テキスト形式である。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 90,
    "category": "テクノロジ系",
    "body": "ディレクトリ又はファイルがノードに対応する木構造で表現できるファイルシステムがある。ルートディレクトリを根として図のように表現したとき，中間ノードである節及び末端ノードである葉に対応するものの組合せとして，最も適切なものはどれか。ここで，空のディレクトリを許すものとする。\n[図: 根→(葉, 節→(葉, 葉))]",
    "choices": {
      "ア": "節:ディレクトリ 葉:ディレクトリ又はファイル",
      "イ": "節:ディレクトリ 葉:ファイル",
      "ウ": "節:ファイル 葉:ディレクトリ又はファイル",
      "エ": "節:ファイル 葉:ディレクトリ"
    },
    "answer": "ア",
    "image": "img/2022r04_q90.png"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 91,
    "category": "テクノロジ系",
    "body": "ソーシャルエンジニアリングに該当する行為の例はどれか。",
    "choices": {
      "ア": "あらゆる文字の組合せを総当たりで機械的に入力することによって，パスワードを見つけ出す。",
      "イ": "肩越しに盗み見して入手したパスワードを利用し，他人になりすましてシステムを不正利用する。",
      "ウ": "標的のサーバに大量のリクエストを送りつけて過負荷状態にすることによって，サービスの提供を妨げる。",
      "エ": "プログラムで確保している記憶領域よりも長いデータを入力することによってバッファをあふれさせ，不正にプログラムを実行させる。"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 92,
    "category": "テクノロジ系",
    "body": "IoTエリアネットワークの通信などに利用されるBLEは，Bluetooth4.0で追加された仕様である。BLEに関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "Wi-Fiのアクセスポイントとも通信ができるようになった。",
      "イ": "一般的なボタン電池で，半年から数年間の連続動作が可能なほどに低消費電力である。",
      "ウ": "従来の規格であるBluetooth 3.0以前と互換性がある。",
      "エ": "デバイスとの通信には，赤外線も使用できる。"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 93,
    "category": "テクノロジ系",
    "body": "A3判の紙の長辺を半分に折ると，A4判の大きさになり，短辺：長辺の比率は変わらない。A3判の長辺はA4判の長辺のおよそ何倍か。",
    "choices": {
      "ア": "1.41",
      "イ": "1.5",
      "ウ": "1.73",
      "エ": "2"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 94,
    "category": "テクノロジ系",
    "body": "インクジェットプリンタの印字方式を説明したものはどれか。",
    "choices": {
      "ア": "インクの微細な粒子を用紙に直接吹き付けて印字する。",
      "イ": "インクリボンを印字用のワイヤなどで用紙に打ち付けて印字する。",
      "ウ": "熱で溶けるインクを印字ヘッドで加熱して用紙に印字する。",
      "エ": "レーザ光によって感光体にトナーを付着させて用紙に印字する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 95,
    "category": "テクノロジ系",
    "body": "攻撃対象とは別のWebサイトから盗み出すなどによって，不正に取得した大量の認証情報を流用し，標的とするWebサイトに不正に侵入を試みるものはどれか。",
    "choices": {
      "ア": "DoS攻撃",
      "イ": "SQLインジェクション",
      "ウ": "パスワードリスト攻撃",
      "エ": "フィッシング"
    },
    "answer": "ウ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 96,
    "category": "テクノロジ系",
    "body": "関数calcXと関数calcYは，引数inDataを用いて計算を行い，その結果を戻り値とする。関数calcXをcalcX(1)として呼び出すと，関数calcXの変数numの値が，1→3→7→13と変化し，戻り値は13となった。関数calcYをcalcY(1)として呼び出すと，関数calcYの変数numの値が，1→5→13→25と変化し，戻り値は25となった。プログラム中のa，bに入れる字句の適切な組合せはどれか。\n[プログラム1] calcX: num←inData, for (i を1から3まで1ずつ増やす) num←[a] endfor, return num\n[プログラム2] calcY: num←inData, for ([b]) num←[a] endfor, return num",
    "choices": {
      "ア": "a:2×num+i b:iを1から7まで3ずつ増やす",
      "イ": "a:2×num+i b:iを2から6まで2ずつ増やす",
      "ウ": "a:num+2×i b:iを1から7まで3ずつ増やす",
      "エ": "a:num+2×i b:iを2から6まで2ずつ増やす"
    },
    "answer": "エ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 97,
    "category": "テクノロジ系",
    "body": "水田の水位を計測することによって，水田の水門を自動的に開閉するIoTシステムがある。図中のa，bに入れる字句の適切な組合せはどれか。\n[図: 水田の水位→a→通信機能部⇔IoTサーバ（受信した水位データを分析して，水門の開閉指示を行う。）, 水田の水門←b←通信機能部]",
    "choices": {
      "ア": "a:アクチュエータ b:IoTゲートウェイ",
      "イ": "a:アクチュエータ b:センサ",
      "ウ": "a:センサ b:IoTゲートウェイ",
      "エ": "a:センサ b:アクチュエータ"
    },
    "answer": "エ",
    "image": "img/2022r04_q97.png"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 98,
    "category": "テクノロジ系",
    "body": "関係データベースで管理している\"従業員\"表から，氏名の列だけを取り出す操作を何というか。\n[従業員表: 従業員番号(H001-H005), 氏名(試験花子,情報太郎,高度次郎,午前桜子,午後三郎), 所属コード(G01-G03)]",
    "choices": {
      "ア": "結合",
      "イ": "射影",
      "ウ": "選択",
      "エ": "和"
    },
    "answer": "イ"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 99,
    "category": "テクノロジ系",
    "body": "1台の物理的なコンピュータ上で，複数の仮想サーバを同時に動作させることによって得られる効果に関する記述a～cのうち，適切なものだけを全て挙げたものはどれか。\na 仮想サーバ上で，それぞれ異なるバージョンのOSを動作させることができ，物理的なコンピュータのリソースを有効活用できる。\nb 仮想サーバの数だけ，物理的なコンピュータを増やしたときと同じ処理能力を得られる。\nc 物理的なコンピュータがもつHDDの容量と同じ容量のデータを，全ての仮想サーバで同時に記録できる。",
    "choices": {
      "ア": "a",
      "イ": "a, c",
      "ウ": "b",
      "エ": "c"
    },
    "answer": "ア"
  },
  {
    "exam": "2022r04",
    "examLabel": "R04",
    "number": 100,
    "category": "テクノロジ系",
    "body": "社内に設置された無線LANネットワークに接続している業務用のPCで，インターネット上のあるWebサイトを閲覧した直後，Webブラウザが突然終了したり，見知らぬファイルが作成されたりするなど，マルウェアに感染した可能性が考えられる事象が発生した。このPCの利用者が最初に取るべき行動として適切なものはどれか。",
    "choices": {
      "ア": "Webブラウザを再インストールする。",
      "イ": "マルウェア対策ソフトのマルウェア定義ファイルを最新にする。",
      "ウ": "無線LANとの通信を切断し，PCをネットワークから隔離する。",
      "エ": "無線通信の暗号化方式を変更する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 1,
    "category": "ストラテジ系",
    "body": "新しいビジネスモデルや製品を開発する際に，仮説に基づいて実用に向けた最小限のサービスや製品を作り，短期に顧客価値の検証を繰り返すことによって，新規事業などを成功させる可能性を高める手法を示す用語はどれか。",
    "choices": {
      "ア": "カニバリゼーション",
      "イ": "業務モデリング",
      "ウ": "デジタルトランスフォーメーション",
      "エ": "リーンスタートアップ"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 2,
    "category": "ストラテジ系",
    "body": "次のa～cのうち，著作権法によって定められた著作物に該当するものだけを全て挙げたものはどれか。\n\na 原稿なしで話した講演の録音\nb 時刻表に掲載されたバスの到着時刻\nc 創造性の高い技術の発明",
    "choices": {
      "ア": "a",
      "イ": "a, c",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 3,
    "category": "ストラテジ系",
    "body": "観光などで訪日した外国人が国内にもたらす経済効果を示す言葉として，最も適切なものはどれか。",
    "choices": {
      "ア": "アウトソーシング",
      "イ": "アウトバウンド需要",
      "ウ": "インキュベーター",
      "エ": "インバウンド需要"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 4,
    "category": "ストラテジ系",
    "body": "ASP利用方式と自社開発の自社センター利用方式（以下\"自社方式\"という）の採算性を比較する。次の条件のとき，ASP利用方式の期待利益（効果額－費用）が自社方式よりも大きくなるのは，自社方式の初期投資額が何万円を超えたときか。ここで，比較期間は5年とする。\n\n[条件]\n・両方式とも，システム利用による効果額は500万円／年とする。\n・ASP利用方式の場合，初期費用は0円，利用料は300万円／年とする。\n・自社方式の場合，初期投資額は定額法で減価償却計算を行い，5年後の残存簿価は0円とする。また，運用費は100万円／年とする。\n・金利やその他の費用は考慮しないものとする。",
    "choices": {
      "ア": "500",
      "イ": "1,000",
      "ウ": "1,500",
      "エ": "2,000"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 5,
    "category": "ストラテジ系",
    "body": "企業でのRPAの活用方法として，最も適切なものはどれか。",
    "choices": {
      "ア": "M&Aといった経営層が行う重要な戦略の採択",
      "イ": "個人の嗜好に合わせたサービスの提供",
      "ウ": "潜在顧客層に関する大量の行動データからの規則性抽出",
      "エ": "定型的な事務処理の効率化"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 6,
    "category": "ストラテジ系",
    "body": "A社では，顧客の行動や天候，販売店のロケーションなどの多くの項目から成るデータを取得している。これらのデータを分析することによって販売数量の変化を説明することを考える。その際，説明に使用するパラメータをできるだけ少数に絞りたい。このときに用いる分析法として，最も適切なものはどれか。",
    "choices": {
      "ア": "ABC分析",
      "イ": "クラスター分析",
      "ウ": "主成分分析",
      "エ": "相関分析"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 7,
    "category": "ストラテジ系",
    "body": "経営戦略に基づいて策定される情報システム戦略の責任者として，最も適切なものはどれか。",
    "choices": {
      "ア": "CIO",
      "イ": "基幹システムの利用部門の部門長",
      "ウ": "システム開発プロジェクトマネージャ",
      "エ": "システム企画担当者"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 8,
    "category": "ストラテジ系",
    "body": "A社の営業部門では，成約件数を増やすことを目的として，営業担当者が企画を顧客に提案する活動を始めた。この営業活動の達成度を測るための指標としてKGI（Key Goal Indicator）とKPI（Key Performance Indicator）を定めたい。本活動におけるKGIとKPIの組合せとして，最も適切なものはどれか。",
    "choices": {
      "ア": "KGI:成約件数 KPI:売上高",
      "イ": "KGI:成約件数 KPI:提案件数",
      "ウ": "KGI:提案件数 KPI:売上高",
      "エ": "KGI:提案件数 KPI:成約件数"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 9,
    "category": "ストラテジ系",
    "body": "ソーシャルメディアポリシーを制定する目的として，適切なものだけを全て挙げたものはどれか。\n\na 企業がソーシャルメディアを使用する際の心得やルールなどを取り決めて，社外の人々が理解できるようにするため\nb 企業に属する役員や従業員が，公私限らずにソーシャルメディアを使用する際のルールを示すため\nc ソーシャルメディアが企業に対して取材や問合せを行う際の条件や窓口での取扱いのルールを示すため",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "a, c",
      "エ": "b, c"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 10,
    "category": "ストラテジ系",
    "body": "フォーラム標準に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "工業製品が，定められた品質，寸法，機能及び形状の範囲内であることを保証したもの",
      "イ": "公的な標準化機関において，透明かつ公正な手続の下，関係者が合意の上で制定したもの",
      "ウ": "特定の企業が開発した仕様が広く利用された結果，事実上の業界標準になったもの",
      "エ": "特定の分野に関心のある複数の企業などが集まって結成した組織が，規格として作ったもの"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 11,
    "category": "ストラテジ系",
    "body": "IoTやAIといったITを活用し，戦略的にビジネスモデルの刷新や新たな付加価値を生み出していくことなどを示す言葉として，最も適切なものはどれか。",
    "choices": {
      "ア": "デジタルサイネージ",
      "イ": "デジタルディバイド",
      "ウ": "デジタルトランスフォーメーション",
      "エ": "デジタルネイティブ"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 12,
    "category": "ストラテジ系",
    "body": "スマートフォンに内蔵された非接触型ICチップと外部のRFIDリーダーによって，実現しているサービスの事例だけを全て挙げたものはどれか。\n\na 移動中の通話の際に基地局を自動的に切り替えて通話を保持する。\nb 駅の自動改札を通過する際の定期券として利用する。\nc 海外でも国内と同じ電子メールなどのサービスを利用する。\nd 決済手続情報を得るためにQRコードを読み込む。",
    "choices": {
      "ア": "a, b, c, d",
      "イ": "a, b, d",
      "ウ": "b",
      "エ": "b, d"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 13,
    "category": "ストラテジ系",
    "body": "ある製品の今月の売上高と費用は表のとおりであった。販売単価を1,000円から800円に変更するとき，赤字にならないためには少なくとも毎月何個を販売する必要があるか。ここで，固定費及び製品1個当たりの変動費は変化しないものとする。",
    "choices": {
      "ア": "2,400",
      "イ": "2,500",
      "ウ": "4,800",
      "エ": "6,000"
    },
    "answer": "エ",
    "image": "img/2023r05_q13.png"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 14,
    "category": "ストラテジ系",
    "body": "AIの活用領域の一つである自然言語処理が利用されている事例として，適切なものだけを全て挙げたものはどれか。\n\na Webサイト上で，日本語の文章を入力すると即座に他言語に翻訳される。\nb 災害時にSNSに投稿された文字情報をリアルタイムで収集し，地名と災害情報などを解析して被災状況を把握する。\nc スマートスピーカーを利用して，音声によって家電の操作や音楽の再生を行う。\nd 駐車場の出入口に設置したカメラでナンバープレートを撮影して，文字認識処理をし，精算済みの車両がゲートに近付くと自動で開く。",
    "choices": {
      "ア": "a, b, c",
      "イ": "a, b, d",
      "ウ": "a, c, d",
      "エ": "b, c, d"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 15,
    "category": "ストラテジ系",
    "body": "パスワードに関連した不適切な行為a～dのうち，不正アクセス禁止法で規制されている行為だけを全て挙げたものはどれか。\n\na 業務を代行してもらうために，社内データベースアクセス用の自分のIDとパスワードを同僚に伝えた。\nb 自分のPCに，社内データベースアクセス用の自分のパスワードのメモを貼り付けた。\nc 電子メールに添付されていた文書をPCに取り込んだ。その文書の閲覧用パスワードを，その文書を見る権利のない人に教えた。\nd 人気のショッピングサイトに登録されている他人のIDとパスワードを，無断で第三者に伝えた。",
    "choices": {
      "ア": "a, b, c, d",
      "イ": "a, c, d",
      "ウ": "a, d",
      "エ": "d"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 16,
    "category": "ストラテジ系",
    "body": "コールセンターにおける電話応対業務において，AIを活用し，より有効なFAQシステムを実現する事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "オペレーター業務研修の一環で，既存のFAQを用いた質疑応答の事例をWebの画面で学習する。",
      "イ": "ガイダンスに従って入力されたダイヤル番号に従って，FAQの該当項目を担当するオペレーターに振り分ける。",
      "ウ": "受信した電話番号から顧客の情報，過去の問合せ内容及び回答の記録を，顧客情報データベースから呼び出してオペレーターの画面に表示する。",
      "エ": "電話応対時に，質問の音声から感情と内容を読み取って解析し，FAQから最適な回答候補を選び出す確度を高める。"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 17,
    "category": "ストラテジ系",
    "body": "ITの進展や関連するサービスの拡大によって，様々なデータやツールを自社のビジネスや日常の業務に利用することが可能となっている。このようなデータやツールを課題解決などのために適切に活用できる能力を示す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "アクセシビリティ",
      "イ": "コアコンピタンス",
      "ウ": "情報リテラシー",
      "エ": "デジタルディバイド"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 18,
    "category": "ストラテジ系",
    "body": "EUの一般データ保護規則（GDPR）に関する記述として，適切なものだけを全て挙げたものはどれか。\n\na EU域内に拠点がある事業者が，EU域内に対してデータやサービスを提供している場合は，適用の対象となる。\nb EU域内に拠点がある事業者が，アジアや米国などEU域外に対してデータやサービスを提供している場合は，適用の対象とならない。\nc EU域内に拠点がない事業者が，アジアや米国などEU域外に対してだけデータやサービスを提供している場合は，適用の対象とならない。\nd EU域内に拠点がない事業者が，アジアや米国などからEU域内に対してデータやサービスを提供している場合は，適用の対象となる。",
    "choices": {
      "ア": "a",
      "イ": "a, b, c",
      "ウ": "a, c",
      "エ": "a, c, d"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 19,
    "category": "ストラテジ系",
    "body": "住宅地に設置してある飲料の自動販売機に組み込まれた通信機器と，遠隔で自動販売機を監視しているコンピュータが，ネットワークを介してデータを送受信することによって在庫管理を実現するような仕組みがある。このように，機械同士がネットワークを介して互いに情報をやり取りすることによって，自律的に高度な制御や動作を行う仕組みはどれか。",
    "choices": {
      "ア": "MOT",
      "イ": "MRP",
      "ウ": "M2M",
      "エ": "O2O"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 20,
    "category": "ストラテジ系",
    "body": "資本活用の効率性を示す指標はどれか。",
    "choices": {
      "ア": "売上高営業利益率",
      "イ": "自己資本比率",
      "ウ": "総資本回転率",
      "エ": "損益分岐点比率"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 21,
    "category": "ストラテジ系",
    "body": "フリーミアムの事例として，適切なものはどれか。",
    "choices": {
      "ア": "購入した定額パスをもっていれば，期限内は何杯でもドリンクをもらえるファーストフード店のサービス",
      "イ": "無料でダウンロードして使うことはできるが，プログラムの改変は許されていない統計解析プログラム",
      "ウ": "名刺を個人で登録・管理する基本機能を無料で提供し，社内関係者との間での顧客情報の共有や人物検索などの追加機能を有料で提供する名刺管理サービス",
      "エ": "有料広告を収入源とすることによって，無料で配布している地域限定の生活情報などの広報誌"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 22,
    "category": "ストラテジ系",
    "body": "資金決済法における前払式支払手段に該当するものはどれか。",
    "choices": {
      "ア": "Webサイト上で預金口座から振込や送金ができるサービス",
      "イ": "インターネット上で電子的な通貨として利用可能な暗号資産",
      "ウ": "全国のデパートや商店などで共通に利用可能な使用期限のない商品券",
      "エ": "店舗などでの商品購入時に付与され，同店での次回の購入代金として利用可能なポイント"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 23,
    "category": "ストラテジ系",
    "body": "OMG（Object Management Group）によって維持されており，国際規格ISO/IEC 19510として標準化されているビジネスプロセスのモデリング手法及び表記法はどれか。",
    "choices": {
      "ア": "BABOK",
      "イ": "BPMN",
      "ウ": "BPO",
      "エ": "BPR"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 24,
    "category": "ストラテジ系",
    "body": "需要量が年間を通じて安定している場合において，定量発注方式に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "最適な発注量は，発注費用と在庫維持費用の総額が最小となる場合である。",
      "イ": "発注回数の多寡で比較したとき，発注回数の多い方が商品を保管するスペースを広くする必要がある。",
      "ウ": "発注は毎週金曜日，毎月末など，決められた同じサイクルで行われる。",
      "エ": "毎回需要予測に基づき発注が行われる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 25,
    "category": "ストラテジ系",
    "body": "企業の行為に関する記述a～cのうち，コンプライアンスにおいて問題となるおそれのある行為だけを全て挙げたものはどれか。\n\na 新商品の名称を消費者に浸透させるために，誰でも応募ができて，商品名の一部を答えさせるだけの簡単なクイズを新聞や自社ホームページ，雑誌などに広く掲載し，応募者の中から抽選で現金10万円が当たるキャンペーンを実施した。\nb 人気のあるWebサイトを運営している企業が，広告主から宣伝の依頼があった特定の商品を好意的に評価する記事を，広告であることを表示することなく一般の記事として掲載した。\nc フランスをイメージしてデザインしたバッグを国内で製造し，原産国の国名は記載せず，パリの風景写真とフランス国旗だけを印刷したタグを添付して，販売した。",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, c",
      "ウ": "a, c",
      "エ": "b, c"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 26,
    "category": "ストラテジ系",
    "body": "組立製造販売業A社では経営効率化の戦略として，部品在庫を極限まで削減するためにかんばん方式を導入することにした。この戦略実現のために，A社が在庫管理システムとオンラインで連携させる情報システムとして，最も適切なものはどれか。なお，A社では在庫管理システムで部品在庫も管理している。また，現在は他のどのシステムも在庫管理システムと連携していないものとする。",
    "choices": {
      "ア": "会計システム",
      "イ": "部品購買システム",
      "ウ": "顧客管理システム",
      "エ": "販売管理システム"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 27,
    "category": "ストラテジ系",
    "body": "ファミリーレストランチェーンAでは，店舗の運営戦略を検討するために，店舗ごとの座席数，客単価及び売上高の三つの要素の関係を分析することにした。各店舗の三つの要素を，一つの図表で全店舗分可視化するときに用いる図表として，最も適切なものはどれか。",
    "choices": {
      "ア": "ガントチャート",
      "イ": "バブルチャート",
      "ウ": "マインドマップ",
      "エ": "ロードマップ"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 28,
    "category": "ストラテジ系",
    "body": "AIを開発するベンチャー企業のA社が，資金調達を目的に，金融商品取引所に初めて上場することになった。このように，企業の未公開の株式を，新たに公開することを表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "IPO",
      "イ": "LBO",
      "ウ": "TOB",
      "エ": "VC"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 29,
    "category": "ストラテジ系",
    "body": "不正な販売行為を防ぐために，正当な理由なく映像ソフトのコピープロテクトを無効化するプログラムの販売行為を規制している法律はどれか。",
    "choices": {
      "ア": "商標法",
      "イ": "特定商取引に関する法律",
      "ウ": "不正アクセス行為の禁止等に関する法律",
      "エ": "不正競争防止法"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 30,
    "category": "ストラテジ系",
    "body": "犯罪によって得た資金を正当な手段で得たように見せかける行為を防ぐために，金融機関などが実施する取組を表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "AML (Anti-Money Laundering)",
      "イ": "インサイダー取引規制",
      "ウ": "スキミング",
      "エ": "フィッシング"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 31,
    "category": "ストラテジ系",
    "body": "様々な企業のシステム間を連携させる公開されたインタフェースを通じて，データやソフトウェアを相互利用し，それらの企業との協業を促進しながら新しいサービスを創出することなどで，ビジネスを拡大していく仕組みを表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "APIエコノミー",
      "イ": "アウトソーシング",
      "ウ": "シェアリングエコノミー",
      "エ": "プロセスイノベーション"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 32,
    "category": "ストラテジ系",
    "body": "新システムの導入を予定している企業や官公庁などが作成するRFPの説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "ベンダー企業から情報収集を行い，システムの技術的な課題や実現性を把握するもの",
      "イ": "ベンダー企業と発注者で新システムに求められる性能要件などを定義するもの",
      "ウ": "ベンダー企業と発注者との間でサービス品質のレベルに関する合意事項を列挙したもの",
      "エ": "ベンダー企業にシステムの導入目的や機能概要などを示し，提案書の提出を求めるもの"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 33,
    "category": "ストラテジ系",
    "body": "製品Aを1個生産するのに部品aが2個，部品bが1個必要である。部品aは1回の発注数量150個，調達期間1週間，部品bは1回の発注数量100個，調達期間2週間の購買部品である。製品Aの6週間の生産計画と，部品a，部品bの1週目の手持在庫が表のとおりであるとき，遅くとも何週目に部品を発注する必要があるか。ここで，部品の発注，納品はそれぞれ週の初めに行われるものとし，納品された部品はすぐに生産に利用できるものとする。",
    "choices": {
      "ア": "2",
      "イ": "3",
      "ウ": "4",
      "エ": "5"
    },
    "answer": "イ",
    "image": "img/2023r05_q33.png"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 34,
    "category": "ストラテジ系",
    "body": "記述a～cのうち，\"人間中心のAI社会原則\"において，AIが社会に受け入れられ，適正に利用されるために，社会が留意すべき事項として記されているものだけを全て挙げたものはどれか。\n\na AIの利用に当たっては，人が利用方法を判断し決定するのではなく，AIが自律的に判断し決定できるように，AIそのものを高度化しなくてはならない。\nb AIの利用は，憲法及び国際的な規範の保障する基本的人権を侵すものであってはならない。\nc AIを早期に普及させるために，まず高度な情報リテラシーを保有する者に向けたシステムを実現し，その後，情報弱者もAIの恩恵を享受できるシステムを実現するよう，段階的に発展させていかなくてはならない。",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, c",
      "ウ": "b",
      "エ": "b, c"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 35,
    "category": "ストラテジ系",
    "body": "第4次産業革命に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "医療やインフラ，交通システムなどの生活における様々な領域で，インターネットやAIを活用して，サービスの自動化と質の向上を図る。",
      "イ": "エレクトロニクスを活用した産業用ロボットを工場に導入することによって，生産の自動化と人件費の抑制を行う。",
      "ウ": "工場においてベルトコンベアを利用した生産ラインを構築することによって，工業製品の大量生産を行う。",
      "エ": "織機など，軽工業の機械の動力に蒸気エネルギーを利用することによって，人手による作業に比べて生産性を高める。"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 36,
    "category": "マネジメント系",
    "body": "サービスデスクの業務改善に関する記述のうち，最も適切なものはどれか。",
    "choices": {
      "ア": "サービスデスクが受け付けた問合せの内容や回答，費やした時間などを記録して分析を行う。",
      "イ": "障害の問合せに対して一時的な回避策は提示せず，根本原因及び解決策の検討に注力する体制を組む。",
      "ウ": "利用者が問合せを速やかに実施できるように，問合せ窓口は問合せの種別ごとにできるだけ細かく分ける。",
      "エ": "利用者に対して公平性を保つように，問合せ内容の重要度にかかわらず受付順に回答を実施するように徹底する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 37,
    "category": "マネジメント系",
    "body": "システム監査人の行動規範に関して，次の記述中のa, bに入れる字句の適切な組合せはどれか。\n\nシステム監査人は，監査対象となる組織と同一の指揮命令系統に属していないなど，[a]上の独立性が確保されている必要がある。また，システム監査人は[b]立場で公正な判断を行うという精神的な態度が求められる。",
    "choices": {
      "ア": "a:外観 b:客観的な",
      "イ": "a:経営 b:被監査側の",
      "ウ": "a:契約 b:経営者側の",
      "エ": "a:取引 b:良心的な"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 38,
    "category": "マネジメント系",
    "body": "システム開発プロジェクトの品質目標を検討するために，複数の類似プロジェクトのプログラムステップ数と不良件数の関係性を示す図として，適切なものはどれか。",
    "choices": {
      "ア": "管理図",
      "イ": "散布図",
      "ウ": "特性要因図",
      "エ": "パレート図"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 39,
    "category": "マネジメント系",
    "body": "運用中のソフトウェアの仕様書がないので，ソースコードを解析してプログラムの仕様書を作成した。この手法を何というか。",
    "choices": {
      "ア": "コードレビュー",
      "イ": "デザインレビュー",
      "ウ": "リバースエンジニアリング",
      "エ": "リファクタリング"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 40,
    "category": "マネジメント系",
    "body": "ソフトウェア開発におけるDevOpsに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "運用側で利用する画面のイメージを明確にするために，開発側が要件定義段階でプロトタイプを作成する。",
      "イ": "開発側が，設計・開発・テストの工程を順に実施して，システムに必要な全ての機能及び品質を揃えてから運用側に引き渡す。",
      "ウ": "開発側と運用側が密接に連携し，自動化ツールなどを取り入れることによって，仕様変更要求などに対して迅速かつ柔軟に対応する。",
      "エ": "一つのプログラムを2人の開発者が共同で開発することによって，生産性と信頼性を向上させる。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 41,
    "category": "マネジメント系",
    "body": "次のアローダイアグラムに基づき作業を行った結果，作業Dが2日遅延し，作業Fが3日前倒しで完了した。作業全体の所要日数は予定と比べてどれくらい変化したか。",
    "choices": {
      "ア": "3日遅延",
      "イ": "1日前倒し",
      "ウ": "2日前倒し",
      "エ": "3日前倒し"
    },
    "answer": "ウ",
    "image": "img/2023r05_q41.png"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 42,
    "category": "マネジメント系",
    "body": "ソフトウェア開発における，テストに関する記述a～cとテスト工程の適切な組合せはどれか。\n\na 運用予定時間内に処理が終了することを確認する。\nb ソフトウェア間のインタフェースを確認する。\nc プログラムの内部パスを網羅的に確認する。",
    "choices": {
      "ア": "単体テスト:a 結合テスト:b システムテスト:c",
      "イ": "単体テスト:a 結合テスト:c システムテスト:b",
      "ウ": "単体テスト:b 結合テスト:a システムテスト:c",
      "エ": "単体テスト:c 結合テスト:b システムテスト:a"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 43,
    "category": "マネジメント系",
    "body": "ソフトウェア導入作業に関する記述a～dのうち，適切なものだけを全て挙げたものはどれか。\n\na 新規開発の場合，導入計画書の作成はせず，期日までに速やかに導入する。\nb ソフトウェア導入作業を実施した後，速やかに導入計画書と導入報告書を作成し，合意を得る必要がある。\nc ソフトウェアを自社開発した場合，影響範囲が社内になるので導入計画書の作成後に導入し，導入計画書の合意は導入後に行う。\nd 本番稼働中のソフトウェアに機能追加する場合，機能追加したソフトウェアの導入計画書を作成し，合意を得てソフトウェア導入作業を実施する。",
    "choices": {
      "ア": "a, c",
      "イ": "b, c, d",
      "ウ": "b, d",
      "エ": "d"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 44,
    "category": "マネジメント系",
    "body": "A社のIT部門では，ヘルプデスクのサービス可用性の向上を図るために，対応時間を24時間に拡大することを検討している。ヘルプデスク業務をA社から受託しているB社は，これを実現するためにチャットボットをB社に導入して活用することによって，深夜時間帯は自動応答で対応する旨を提案したところ，A社は24時間対応が可能であるのでこれに合意した。この合意に用いる文書として，最も適切なものはどれか。",
    "choices": {
      "ア": "BCP",
      "イ": "NDA",
      "ウ": "SLA",
      "エ": "SLM"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 45,
    "category": "マネジメント系",
    "body": "プロジェクトマネジメントでは，スケジュール，コスト，品質といった競合する制約条件のバランスをとることが求められる。計画していた開発スケジュールを短縮することになった場合の対応として，適切なものはどれか。",
    "choices": {
      "ア": "資源の追加によってコストを増加させてでもスケジュールを遵守することを検討する。",
      "イ": "提供するシステムの高機能化を図ってスケジュールを遵守することを検討する。",
      "ウ": "プロジェクトの対象スコープを拡大してスケジュールを遵守することを検討する。",
      "エ": "プロジェクトメンバーを削減してスケジュールを遵守することを検討する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 46,
    "category": "マネジメント系",
    "body": "ITサービスに関する指標には，ITサービスが利用できなくなるインシデントの発生間隔の平均時間であるMTBSI（Mean Time Between Service Incidents）があり，サービスの中断の発生しにくさを表す。ITサービスにおいてMTBSIの改善を行っている事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "インシデント対応事例のデータベースを整備し，分析することによって，サービスの中断から原因究明までの時間の短縮を図る。",
      "イ": "サービスのメニューを増やすことによって，利用者数の増加を図る。",
      "ウ": "サービスを提供しているネットワークの構成を二重化することによって，ネットワークがつながらなくなる障害の低減を図る。",
      "エ": "ヘルプデスクの要員を増やすことによって，サービス利用者からの個々の問合せにおける待ち時間の短縮を図る。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 47,
    "category": "マネジメント系",
    "body": "あるホスティングサービスのSLAの内容にa～cがある。これらと関連するITサービスマネジメントの管理との適切な組合せはどれか。\n\na サーバが稼働している時間\nb ディスクの使用量が設定したしきい値に達したことを検出した後に，指定された担当者に通知するまでの時間\nc 不正アクセスの検知後に，指定された担当者に通知するまでの時間",
    "choices": {
      "ア": "サービス可用性管理:a 容量・能力管理:b 情報セキュリティ管理:c",
      "イ": "サービス可用性管理:a 容量・能力管理:c 情報セキュリティ管理:b",
      "ウ": "サービス可用性管理:b 容量・能力管理:a 情報セキュリティ管理:c",
      "エ": "サービス可用性管理:c 容量・能力管理:b 情報セキュリティ管理:a"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 48,
    "category": "マネジメント系",
    "body": "システム環境整備に関する次の記述中のa, bに入れる字句の適切な組合せはどれか。\n\n企業などがシステム環境である建物や設備などの資源を最善の状態に保つ考え方として[a]がある。その考え方を踏まえたシステム環境整備の施策として，突発的な停電が発生したときにサーバに一定時間電力を供給する機器である[b]の配備などがある。",
    "choices": {
      "ア": "a:サービスレベルマネジメント b:IPS",
      "イ": "a:サービスレベルマネジメント b:UPS",
      "ウ": "a:ファシリティマネジメント b:IPS",
      "エ": "a:ファシリティマネジメント b:UPS"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 49,
    "category": "マネジメント系",
    "body": "リファクタリングの説明として，適切なものはどれか。",
    "choices": {
      "ア": "ソフトウェアが提供する機能仕様を変えずに，内部構造を改善すること",
      "イ": "ソフトウェアの動作などを解析して，その仕様を明らかにすること",
      "ウ": "ソフトウェアの不具合を修正し，仕様どおりに動くようにすること",
      "エ": "利用者の要望などを基に，ソフトウェアに新しい機能を加える修正をすること"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 50,
    "category": "マネジメント系",
    "body": "内部統制において，不正防止を目的とした職務分掌に関する事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "申請者は自身の申請を承認できないようにする。",
      "イ": "申請部署と承認部署の役員を兼務させる。",
      "ウ": "一つの業務を複数の担当者が手分けして行う。",
      "エ": "一つの業務を複数の部署で分散して行う。"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 51,
    "category": "マネジメント系",
    "body": "ITサービスマネジメントにおいて，過去のインシデントの内容をFAQとしてデータベース化した。それによって改善が期待できる項目に関する記述a～cのうち，適切なものだけを全て挙げたものはどれか。\n\na ITサービスに関連する構成要素の情報を必要な場合にいつでも確認できる。\nb 要員候補の業務経歴を確認し，適切な要員配置計画を立案できる。\nc 利用者からの問合せに対する一次回答率が高まる。",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "a, c",
      "エ": "c"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 52,
    "category": "マネジメント系",
    "body": "会計監査の目的として，最も適切なものはどれか。",
    "choices": {
      "ア": "経理システムを含め，利用しているITに関するリスクをコントロールし，ITガバナンスが実現されていることを確認する。",
      "イ": "経理部門が保有しているPCの利用方法をはじめとして，情報のセキュリティに係るリスクマネジメントが効果的に実施されていることを確認する。",
      "ウ": "組織内の会計業務などを含む諸業務が組織の方針に従って，合理的かつ効率的な運用が実現されていることを確認する。",
      "エ": "日常の各種取引の発生から決算報告書への集計に至るまで，不正や誤りのない処理が行われていることを確認する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 53,
    "category": "マネジメント系",
    "body": "ITが適切に活用されるために企業が実施している活動を，ルールを決める活動と，ルールに従って行動する活動に分けたとき，ルールを決める活動に該当するものはどれか。",
    "choices": {
      "ア": "IT投資判断基準の確立",
      "イ": "SLA遵守のためのオペレーション管理",
      "ウ": "開発プロジェクトの予算管理",
      "エ": "標準システム開発手法に準拠した個別のプロジェクトの推進"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 54,
    "category": "マネジメント系",
    "body": "システム開発のプロジェクトマネジメントに関する記述a～dのうち，スコープのマネジメントの失敗事例だけを全て挙げたものはどれか。\n\na 開発に必要な人件費を過少に見積もったので，予算を超過した。\nb 開発の作業に必要な期間を短く設定したので，予定期間で開発を完了させることができなかった。\nc 作成する機能の範囲をあらかじめ決めずにプロジェクトを開始したので，開発期間を超過した。\nd プロジェクトで実施すべき作業が幾つか計画から欠落していたので，システムを完成できなかった。",
    "choices": {
      "ア": "a, b",
      "イ": "b, c",
      "ウ": "b, d",
      "エ": "c, d"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 55,
    "category": "マネジメント系",
    "body": "ソフトウェア開発の仕事に対し，10名が15日間で完了する計画を立てた。しかし，仕事開始日から5日間は，8名しか要員を確保できないことが分かった。計画どおり15日間で仕事を完了させるためには，6日目以降は何名の要員が必要か。ここで，各要員の生産性は同じものとする。",
    "choices": {
      "ア": "10",
      "イ": "11",
      "ウ": "12",
      "エ": "14"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 56,
    "category": "テクノロジ系",
    "body": "ISMSクラウドセキュリティ認証に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "PaaS，SaaSが対象であり，IaaSは対象ではない。",
      "イ": "クラウドサービス固有の管理策が適切に導入，実施されていることを認証するものである。",
      "ウ": "クラウドサービスを提供している組織が対象であり，クラウドサービスを利用する組織は対象ではない。",
      "エ": "クラウドサービスで保管されている個人情報について，適切な保護措置を講ずる体制を整備し，運用していることを評価して，プライバシーマークの使用を認める制度である。"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 57,
    "category": "テクノロジ系",
    "body": "IoTデバイスにおけるセキュリティ対策のうち，耐タンパ性をもたせる対策として，適切なものはどれか。",
    "choices": {
      "ア": "サーバからの接続認証が連続して一定回数失敗したら，接続できないようにする。",
      "イ": "通信するデータを暗号化し，データの機密性を確保する。",
      "ウ": "内蔵ソフトウェアにオンラインアップデート機能をもたせ，最新のパッチが適用されるようにする。",
      "エ": "内蔵ソフトウェアを難読化し，解読に要する時間を増大させる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 58,
    "category": "テクノロジ系",
    "body": "Webサイトなどに不正なソフトウェアを潜ませておき，PCやスマートフォンなどのWebブラウザからこのサイトにアクセスしたとき，利用者が気付かないうちにWebブラウザなどの脆弱性を突いてマルウェアを送り込む攻撃はどれか。",
    "choices": {
      "ア": "DDoS攻撃",
      "イ": "SQLインジェクション",
      "ウ": "ドライブバイダウンロード",
      "エ": "フィッシング攻撃"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 59,
    "category": "テクノロジ系",
    "body": "関係データベースで管理された\"会員管理\"表を正規化して，\"店舗\"表，\"会員種別\"表及び\"会員\"表に分割した。\"会員\"表として，適切なものはどれか。ここで，表中の下線は主キーを表し，一人の会員が複数の店舗に登録した場合は，会員番号を店舗ごとに付与するものとする。",
    "choices": {
      "ア": "会員番号,会員名",
      "イ": "会員番号,会員名,会員種別コード",
      "ウ": "会員番号,店舗コード,会員名",
      "エ": "会員番号,店舗コード,会員名,会員種別コード"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 60,
    "category": "テクノロジ系",
    "body": "手続printArrayは，配列integerArrayの要素を並べ替えて出力する。手続printArrayを呼び出したときの出力はどれか。ここで，配列の要素番号は1から始まる。",
    "choices": {
      "ア": "1,2,3,4",
      "イ": "1,3,2,4",
      "ウ": "3,1,4,2",
      "エ": "4,3,2,1"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 61,
    "category": "テクノロジ系",
    "body": "IoTシステムなどの設計，構築及び運用に際しての基本原則とされ，システムの企画，設計段階から情報セキュリティを確保するための方策を何と呼ぶか。",
    "choices": {
      "ア": "セキュアブート",
      "イ": "セキュリティバイデザイン",
      "ウ": "ユニバーサルデザイン",
      "エ": "リブート"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 62,
    "category": "テクノロジ系",
    "body": "情報セキュリティにおける認証要素は3種類に分類できる。認証要素の3種類として，適切なものはどれか。",
    "choices": {
      "ア": "個人情報，所持情報，生体情報",
      "イ": "個人情報，所持情報，知識情報",
      "ウ": "個人情報，生体情報，知識情報",
      "エ": "所持情報，生体情報，知識情報"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 63,
    "category": "テクノロジ系",
    "body": "容量が500GバイトのHDDを2台使用して，RAID0，RAID1を構成したとき，実際に利用可能な記憶容量の組合せとして，適切なものはどれか。",
    "choices": {
      "ア": "RAID0:1Tバイト RAID1:1Tバイト",
      "イ": "RAID0:1Tバイト RAID1:500Gバイト",
      "ウ": "RAID0:500Gバイト RAID1:1Tバイト",
      "エ": "RAID0:500Gバイト RAID1:500Gバイト"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 64,
    "category": "テクノロジ系",
    "body": "関数sigmaは，正の整数を引数maxで受け取り，1からmaxまでの整数の総和を戻り値とする。プログラム中のaに入れる字句として，適切なものはどれか。",
    "choices": {
      "ア": "calcX ← calcX × n",
      "イ": "calcX ← calcX + 1",
      "ウ": "calcX ← calcX + n",
      "エ": "calcX ← n"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 65,
    "category": "テクノロジ系",
    "body": "Wi-Fiのセキュリティ規格であるWPA2を用いて，PCを無線LANルータと接続するときに設定するPSKの説明として，適切なものはどれか。",
    "choices": {
      "ア": "アクセスポイントへの接続を認証するときに用いる符号（パスフレーズ）であり，この符号に基づいて，接続するPCごとに通信の暗号化に用いる鍵が生成される。",
      "イ": "アクセスポイントへの接続を認証するときに用いる符号（パスフレーズ）であり，この符号に基づいて，接続するPCごとにプライベートIPアドレスが割り当てられる。",
      "ウ": "接続するアクセスポイントを識別するために用いる名前であり，この名前に基づいて，接続するPCごとに通信の暗号化に用いる鍵が生成される。",
      "エ": "接続するアクセスポイントを識別するために用いる名前であり，この名前に基づいて，接続するPCごとにプライベートIPアドレスが割り当てられる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 66,
    "category": "テクノロジ系",
    "body": "トランザクション処理におけるコミットの説明として，適切なものはどれか。",
    "choices": {
      "ア": "あるトランザクションが共有データを更新しようとしたとき，そのデータに対する他のトランザクションからの更新を禁止すること",
      "イ": "トランザクションが正常に処理されたときに，データベースへの更新を確定させること",
      "ウ": "何らかの理由で，トランザクションが正常に処理されなかったときに，データベースをトランザクション開始前の状態にすること",
      "エ": "複数の表を，互いに関係付ける列をキーとして，一つの表にすること"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 67,
    "category": "テクノロジ系",
    "body": "ネットワーク環境で利用されるIDSの役割として，適切なものはどれか。",
    "choices": {
      "ア": "IPアドレスとドメイン名を相互に変換する。",
      "イ": "ネットワーク上の複数のコンピュータの時刻を同期させる。",
      "ウ": "ネットワークなどに対する不正アクセスやその予兆を検知し，管理者に通知する。",
      "エ": "メールサーバに届いた電子メールを，メールクライアントに送る。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 68,
    "category": "テクノロジ系",
    "body": "インターネット上のコンピュータでは，Webや電子メールなど様々なアプリケーションプログラムが動作し，それぞれに対応したアプリケーション層の通信プロトコルが使われている。これらの通信プロトコルの下位にあり，基本的な通信機能を実現するものとして共通に使われる通信プロトコルはどれか。",
    "choices": {
      "ア": "FTP",
      "イ": "POP",
      "ウ": "SMTP",
      "エ": "TCP/IP"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 69,
    "category": "テクノロジ系",
    "body": "配列に格納されているデータを探索するときの，探索アルゴリズムに関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "2分探索法は，探索対象となる配列の先頭の要素から順に探索する。",
      "イ": "線形探索法で探索するのに必要な計算量は，探索対象となる配列の要素数に比例する。",
      "ウ": "線形探索法を用いるためには，探索対象となる配列の要素は要素の値で昇順又は降順にソートされている必要がある。",
      "エ": "探索対象となる配列が同一であれば，探索に必要な計算量は探索する値によらず，2分探索法が線形探索法よりも少ない。"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 70,
    "category": "テクノロジ系",
    "body": "Webサービスなどにおいて，信頼性を高め，かつ，利用者からの多量のアクセスを処理するために，複数のコンピュータを連携させて全体として一つのコンピュータであるかのように動作させる技法はどれか。",
    "choices": {
      "ア": "クラスタリング",
      "イ": "スプーリング",
      "ウ": "バッファリング",
      "エ": "ミラーリング"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 71,
    "category": "テクノロジ系",
    "body": "IoTシステムにおけるエッジコンピューティングに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "IoTデバイスの増加によるIoTサーバの負荷を軽減するために，IoTデバイスに近いところで可能な限りのデータ処理を行う。",
      "イ": "一定時間ごとに複数の取引をまとめたデータを作成し，そのデータに直前のデータのハッシュ値を埋め込むことによって，データを相互に関連付け，改ざんすることを困難にすることによって，データの信頼性を高める。",
      "ウ": "ネットワークの先にあるデータセンター上に集約されたコンピュータ資源を，ネットワークを介して遠隔地から利用する。",
      "エ": "明示的にプログラミングすることなく，入力されたデータからコンピュータが新たな知識やルールを獲得できるようにする。"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 72,
    "category": "テクノロジ系",
    "body": "情報セキュリティのリスクマネジメントにおけるリスク対応を，リスク回避，リスク共有，リスク低減及びリスク保有の四つに分類したとき，リスク共有の説明として，適切なものはどれか。",
    "choices": {
      "ア": "個人情報を取り扱わないなど，リスクを伴う活動自体を停止したり，リスク要因を根本的に排除したりすること",
      "イ": "災害に備えてデータセンターを地理的に離れた複数の場所に分散するなど，リスクの発生確率や損害を減らす対策を講じること",
      "ウ": "保険への加入など，リスクを一定の合意の下に別の組織へ移転又は分散することによって，リスクが顕在化したときの損害を低減すること",
      "エ": "リスクの発生確率やリスクが発生したときの損害が小さいと考えられる場合に，リスクを認識した上で特に対策を講じず，そのリスクを受け入れること"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 73,
    "category": "テクノロジ系",
    "body": "攻撃者がコンピュータに不正侵入したとき，再侵入を容易にするためにプログラムや設定の変更を行うことがある。この手口を表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "盗聴",
      "イ": "バックドア",
      "ウ": "フィッシング",
      "エ": "ポートスキャン"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 74,
    "category": "テクノロジ系",
    "body": "ニューラルネットワークに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "PC，携帯電話，情報家電などの様々な情報機器が，社会の至る所に存在し，いつでもどこでもネットワークに接続できる環境",
      "イ": "国立情報学研究所が運用している，大学や研究機関などを結ぶ学術研究用途のネットワーク",
      "ウ": "全国の自治体が，氏名，生年月日，性別，住所などの情報を居住地以外の自治体から引き出せるようにネットワーク化したシステム",
      "エ": "ディープラーニングなどで用いられる，脳神経系の仕組みをコンピュータで模したモデル"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 75,
    "category": "テクノロジ系",
    "body": "表計算ソフトを用いて，二つの科目X，Yの点数を評価して合否を判定する。それぞれの点数はワークシートのセルA2，B2に入力する。合格判定条件（1）又は（2）に該当するときはセルC2に\"合格\"，それ以外のときは\"不合格\"を表示する。セルC2に入力する式はどれか。\n\n[合格判定条件]\n（1）科目Xと科目Yの合計が120点以上である。\n（2）科目X又は科目Yのうち，少なくとも一つが100点である。",
    "choices": {
      "ア": "IF(論理積((A2+B2)≧120, A2=100, B2=100),'合格','不合格')",
      "イ": "IF(論理積((A2+B2)≧120, A2=100, B2=100),'不合格','合格')",
      "ウ": "IF(論理和((A2+B2)≧120, A2=100, B2=100),'合格','不合格')",
      "エ": "IF(論理和((A2+B2)≧120, A2=100, B2=100),'不合格','合格')"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 76,
    "category": "テクノロジ系",
    "body": "品質管理担当者が行っている検査を自動化することを考えた。10,000枚の製品画像と，それに対する品質管理担当者による不良品かどうかの判定結果を学習データとして与えることによって，製品が不良品かどうかを判定する機械学習モデルを構築した。100枚の製品画像に対してテストを行った結果は表のとおりである。品質管理担当者が不良品と判定した製品画像数に占める，機械学習モデルの判定が不良品と判定した製品画像数の割合を再現率としたとき，このテストにおける再現率は幾らか。",
    "choices": {
      "ア": "0.05",
      "イ": "0.25",
      "ウ": "0.50",
      "エ": "0.80"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 77,
    "category": "テクノロジ系",
    "body": "受験者10,000人の4教科の試験結果は表のとおりであり，いずれの教科の得点分布も正規分布に従っていたとする。ある受験者の4教科の得点が全て71点であったとき，この受験者が最も高い偏差値を得た教科はどれか。",
    "choices": {
      "ア": "国語",
      "イ": "社会",
      "ウ": "数学",
      "エ": "理科"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 78,
    "category": "テクノロジ系",
    "body": "関係データベースの主キーの設定に関する記述として，適切なものだけを全て挙げたものはどれか。\n\na 値が他のレコードと重複するものは主キーとして使用できない。\nb インデックスとの重複設定はできない。\nc 主キーの値は数値でなければならない。\nd 複数のフィールドを使って主キーを構成できる。",
    "choices": {
      "ア": "a, c",
      "イ": "a, d",
      "ウ": "b, c",
      "エ": "b, d"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 79,
    "category": "テクノロジ系",
    "body": "PDCAモデルに基づいてISMSを運用している組織の活動において，次のような調査報告があった。この調査はPDCAモデルのどのプロセスで実施されるか。\n\n社外からの電子メールの受信に対しては，情報セキュリティポリシーに従ってマルウェア検知システムを導入し，維持運用されており，日々数十件のマルウェア付き電子メールの受信を検知し，破棄するという効果を上げている。しかし，社外への電子メールの送信に関するセキュリティ対策のための規定や明確な運用手順がなく，社外秘の資料を添付した電子メールの社外への誤送信などが発生するリスクがある。",
    "choices": {
      "ア": "P",
      "イ": "D",
      "ウ": "C",
      "エ": "A"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 80,
    "category": "テクノロジ系",
    "body": "USBメモリなどの外部記憶媒体をPCに接続したときに，その媒体中のプログラムや動画などを自動的に実行したり再生したりするOSの機能であり，マルウェア感染の要因ともなるものはどれか。",
    "choices": {
      "ア": "オートコレクト",
      "イ": "オートコンプリート",
      "ウ": "オートフィルター",
      "エ": "オートラン"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 81,
    "category": "テクノロジ系",
    "body": "HDDを廃棄するときに，HDDからの情報漏えい防止策として，適切なものだけを全て挙げたものはどれか。\n\na データ消去用ソフトウェアを利用し，ランダムなデータをHDDの全ての領域に複数回書き込む。\nb ドリルやメディアシュレッダーなどを用いてHDDを物理的に破壊する。\nc ファイルを消去した後，HDDの論理フォーマットを行う。",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, c",
      "ウ": "a, c",
      "エ": "b, c"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 82,
    "category": "テクノロジ系",
    "body": "OSS（Open Source Software）に関する記述a～cのうち，適切なものだけを全て挙げたものはどれか。\n\na ソースコードに手を加えて再配布することができる。\nb ソースコードの入手は無償だが，有償の保守サポートを受けなければならない。\nc 著作権が放棄されており，無断で利用することができる。",
    "choices": {
      "ア": "a",
      "イ": "a, c",
      "ウ": "b",
      "エ": "c"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 83,
    "category": "テクノロジ系",
    "body": "スマートフォンなどで，相互に同じアプリケーションを用いて，インターネットを介した音声通話を行うときに利用される技術はどれか。",
    "choices": {
      "ア": "MVNO",
      "イ": "NFC",
      "ウ": "NTP",
      "エ": "VoIP"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 84,
    "category": "テクノロジ系",
    "body": "メッセージダイジェストを利用した送信者のデジタル署名が付与された電子メールに関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "デジタル署名を受信者が検証することによって，不正なメールサーバから送信された電子メールであるかどうかを判別できる。",
      "イ": "デジタル署名を送信側メールサーバのサーバ証明書で受信者が検証することによって，送信者のなりすましを検知できる。",
      "ウ": "デジタル署名を付与すると，同時に電子メール本文の暗号化も行われるので，電子メールの内容の漏えいを防ぐことができる。",
      "エ": "電子メール本文の改ざんの防止はできないが，デジタル署名をすることによって，受信者は改ざんが行われたことを検知することはできる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 85,
    "category": "テクノロジ系",
    "body": "IoT機器におけるソフトウェアの改ざん対策にも用いられ，OSやファームウェアなどの起動時に，それらのデジタル署名を検証し，正当であるとみなされた場合にだけそのソフトウェアを実行する技術はどれか。",
    "choices": {
      "ア": "GPU",
      "イ": "RAID",
      "ウ": "セキュアブート",
      "エ": "リブート"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 86,
    "category": "テクノロジ系",
    "body": "ハイブリッド暗号方式を用いてメッセージを送信したい。メッセージと復号用の鍵の暗号化手順を表した図において，メッセージの暗号化に使用する鍵を（1）とし，（1）の暗号化に使用する鍵を（2）としたとき，図のa, bに入れる字句の適切な組合せはどれか。",
    "choices": {
      "ア": "a:共通 b:公開",
      "イ": "a:共通 b:秘密",
      "ウ": "a:公開 b:共通",
      "エ": "a:公開 b:秘密"
    },
    "answer": "ア",
    "image": "img/2023r05_q86.png"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 87,
    "category": "テクノロジ系",
    "body": "IoTエリアネットワークでも用いられ，電気を供給する電力線に高周波の通信用信号を乗せて伝送させることによって，電力線を伝送路としても使用する技術はどれか。",
    "choices": {
      "ア": "PLC",
      "イ": "PoE",
      "ウ": "エネルギーハーベスティング",
      "エ": "テザリング"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 88,
    "category": "テクノロジ系",
    "body": "読出し専用のDVDはどれか。",
    "choices": {
      "ア": "DVD-R",
      "イ": "DVD-RAM",
      "ウ": "DVD-ROM",
      "エ": "DVD-RW"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 89,
    "category": "テクノロジ系",
    "body": "企業の従業員になりすましてIDやパスワードを聞き出したり，くずかごから機密情報を入手したりするなど，技術的手法を用いない攻撃はどれか。",
    "choices": {
      "ア": "ゼロデイ攻撃",
      "イ": "ソーシャルエンジニアリング",
      "ウ": "ソーシャルメディア",
      "エ": "トロイの木馬"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 90,
    "category": "テクノロジ系",
    "body": "情報セキュリティにおける物理的及び環境的セキュリティ管理策であるクリアデスクを職場で実施する例として，適切なものはどれか。",
    "choices": {
      "ア": "従業員に固定された机がなく，空いている机で業務を行う。",
      "イ": "情報を記録した書類などを机の上に放置したまま離席しない。",
      "ウ": "机の上のLANケーブルを撤去して，暗号化された無線LANを使用する。",
      "エ": "離席時は，PCをパスワードロックする。"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 91,
    "category": "テクノロジ系",
    "body": "AIに利用されるニューラルネットワークにおける活性化関数に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "ニューラルネットワークから得られた結果を基に計算し，結果の信頼度を出力する。",
      "イ": "入力層と出力層のニューロンの数を基に計算し，中間層に必要なニューロンの数を出力する。",
      "ウ": "ニューロンの接続構成を基に計算し，最適なニューロンの数を出力する。",
      "エ": "一つのニューロンにおいて，入力された値を基に計算し，次のニューロンに渡す値を出力する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 92,
    "category": "テクノロジ系",
    "body": "電子メールに関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "電子メールのプロトコルには，受信にSMTP，送信にPOP3が使われる。",
      "イ": "メーリングリストによる電子メールを受信すると，その宛先には全ての登録メンバーのメールアドレスが記されている。",
      "ウ": "メールアドレスの\"@\"の左側部分に記述されているドメイン名に基づいて，電子メールが転送される。",
      "エ": "メール転送サービスを利用すると，自分名義の複数のメールアドレス宛に届いた電子メールを一つのメールボックスに保存することができる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 93,
    "category": "テクノロジ系",
    "body": "フールプルーフの考え方を適用した例として，適切なものはどれか。",
    "choices": {
      "ア": "HDDをRAIDで構成する。",
      "イ": "システムに障害が発生しても，最低限の機能を維持して処理を継続する。",
      "ウ": "システムを二重化して障害に備える。",
      "エ": "利用者がファイルの削除操作をしたときに，\"削除してよいか\"の確認メッセージを表示する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 94,
    "category": "テクノロジ系",
    "body": "ISMSにおける情報セキュリティ方針に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "企業が導入するセキュリティ製品を対象として作成され，セキュリティの設定値を定めたもの",
      "イ": "個人情報を取り扱う部門を対象として，個人情報取扱い手順を規定したもの",
      "ウ": "自社と取引先企業との間で授受する情報資産の範囲と具体的な保護方法について，両社間で合意したもの",
      "エ": "情報セキュリティに対する組織の意図を示し，方向付けしたもの"
    },
    "answer": "エ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 95,
    "category": "テクノロジ系",
    "body": "情報セキュリティにおける機密性，完全性及び可用性に関する記述のうち，完全性が確保されなかった例だけを全て挙げたものはどれか。\n\na オペレーターが誤ったデータを入力し，顧客名簿に矛盾が生じた。\nb ショッピングサイトがシステム障害で一時的に利用できなかった。\nc データベースで管理していた顧客の個人情報が漏えいした。",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "b",
      "エ": "c"
    },
    "answer": "ア"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 96,
    "category": "テクノロジ系",
    "body": "CPUのクロック周波数や通信速度などを表すときに用いられる国際単位系（SI）接頭語に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "Gの10の6乗倍は，Tである。",
      "イ": "Mの10の3乗倍は，Gである。",
      "ウ": "Mの10の6乗倍は，Gである。",
      "エ": "Tの10の3乗倍は，Gである。"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 97,
    "category": "テクノロジ系",
    "body": "サブネットマスクの役割として，適切なものはどれか。",
    "choices": {
      "ア": "IPアドレスから，利用しているLAN上のMACアドレスを導き出す。",
      "イ": "IPアドレスの先頭から何ビットをネットワークアドレスに使用するかを定義する。",
      "ウ": "コンピュータをLANに接続するだけで，TCP/IPの設定情報を自動的に取得する。",
      "エ": "通信相手のドメイン名とIPアドレスを対応付ける。"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 98,
    "category": "テクノロジ系",
    "body": "IoT機器であるスマートメーターに関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "カーナビゲーションシステムやゲームコントローラーに内蔵されて，速度がどれだけ変化したかを計測する。",
      "イ": "住宅などに設置され，電気やガスなどの使用量を自動的に計測し，携帯電話回線などを利用して供給事業者にそのデータを送信する。",
      "ウ": "スマートフォンやモバイルPCなどのモバイル情報端末に保存しているデータを，ネットワークを介して遠隔地から消去する。",
      "エ": "歩数を数えるとともに，GPS機能などによって，歩行経路を把握したり，歩行速度や道のアップダウンを検知して消費エネルギーを計算したりする。"
    },
    "answer": "イ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 99,
    "category": "テクノロジ系",
    "body": "バイオメトリクス認証の例として，適切なものはどれか。",
    "choices": {
      "ア": "機械では判読が困難な文字列の画像をモニターに表示して人に判読させ，その文字列を入力させることによって認証する。",
      "イ": "タッチパネルに表示されたソフトウェアキーボードから入力されたパスワード文字列によって認証する。",
      "ウ": "タッチペンなどを用いて署名する際の筆跡や筆圧など，動作の特徴を読み取ることによって認証する。",
      "エ": "秘密の質問として，本人しか知り得ない質問に答えさせることによって認証する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2023r05",
    "examLabel": "R05",
    "number": 100,
    "category": "テクノロジ系",
    "body": "関係データベースにおける結合操作はどれか。",
    "choices": {
      "ア": "表から，特定の条件を満たすレコードを抜き出した表を作る。",
      "イ": "表から，特定のフィールドを抜き出した表を作る。",
      "ウ": "二つの表から，同じ値をもつレコードを抜き出した表を作る。",
      "エ": "二つの表から，フィールドの値によって関連付けした表を作る。"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 1,
    "category": "ストラテジ系",
    "body": "マーケティングオートメーション（MA）に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "企業内に蓄積された大量のデータを分析して，事業戦略などに有効活用する。",
      "イ": "小売業やサービス業において，販売した商品単位の情報の収集・蓄積及び分析を行う。",
      "ウ": "これまで人間が手作業で行っていた定型業務を，AIや機械学習などを取り入れたソフトウェアのロボットが代行することによって自動化や効率化を図る。",
      "エ": "見込み顧客の抽出，獲得，育成などの営業活動を効率化する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 2,
    "category": "ストラテジ系",
    "body": "情報システムに不正に侵入し，サービスを停止させて社会的混乱を生じさせるような行為に対して，国全体で体系的に防御施策を講じるための基本理念を定め，国の責務などを明らかにした法律はどれか。",
    "choices": {
      "ア": "公益通報者保護法",
      "イ": "サイバーセキュリティ基本法",
      "ウ": "不正アクセス禁止法",
      "エ": "プロバイダ責任制限法"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 3,
    "category": "ストラテジ系",
    "body": "未来のある時点に目標を設定し，そこを起点に現在を振り返り，目標実現のために現在すべきことを考える方法を表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "PoC (Proof of Concept)",
      "イ": "PoV (Proof of Value)",
      "ウ": "バックキャスティング",
      "エ": "フォアキャスティング"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 4,
    "category": "ストラテジ系",
    "body": "従来の金融情報システムは堅ろう性が高い一方，柔軟性に欠け，モバイル技術などの情報革新に追従したサービスの迅速な提供が難しかった。これを踏まえて，インターネット関連技術の取込みやそれらを活用するベンチャー企業と組むなどして，新たな価値や革新的なサービスを提供していく潮流を表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "オムニチャネル",
      "イ": "フィンテック",
      "ウ": "ブロックチェーン",
      "エ": "ワントゥワンマーケティング"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 5,
    "category": "ストラテジ系",
    "body": "ベンチャーキャピタルに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "新しい技術の獲得や，規模の経済性の追求などを目的に，他の企業と共同出資会社を設立する手法",
      "イ": "株式売却による利益獲得などを目的に，新しい製品やサービスを武器に市場に参入しようとする企業に対して出資などを行う企業",
      "ウ": "新サービスや技術革新などの創出を目的に，国や学術機関，他の企業など外部の組織と共創関係を結び，積極的に技術や資源を交換し，自社に取り込む手法",
      "エ": "特定された課題の解決を目的に，一定の期間を定めて企業内に立ち上げられ，構成員を関連部門から招集し，目的が達成された時点で解散する組織"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 6,
    "category": "ストラテジ系",
    "body": "技術戦略の策定や技術開発の推進といった技術経営に直接の責任をもつ役職はどれか。",
    "choices": {
      "ア": "CEO",
      "イ": "CFO",
      "ウ": "COO",
      "エ": "CTO"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 7,
    "category": "ストラテジ系",
    "body": "システム開発の上流工程において，業務プロセスのモデリングを行う目的として，最も適切なものはどれか。",
    "choices": {
      "ア": "業務プロセスで取り扱う大量のデータを，統計的手法やAI手法などを用いて分析し，データ間の相関関係や隠れたパターンなどを見いだすため",
      "イ": "業務プロセスを可視化することによって，適切なシステム設計のベースとなる情報を整備し，関係者間で解釈を共有できるようにするため",
      "ウ": "個々の従業員がもっている業務に関する知識・経験やノウハウを社内全体で共有し，創造的なアイディアを生み出すため",
      "エ": "プロジェクトに必要な要員を調達し，チームとして組織化して，プロジェクトの目的の達成に向けて一致団結させるため"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 8,
    "category": "ストラテジ系",
    "body": "表はA社の期末の損益計算書から抜粋した資料である。当期純利益が800百万円であるとき，販売費及び一般管理費は何百万円か。",
    "choices": {
      "ア": "850",
      "イ": "900",
      "ウ": "1,000",
      "エ": "1,200"
    },
    "answer": "ウ",
    "image": "img/2024r06_q08.png"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 9,
    "category": "ストラテジ系",
    "body": "企業の戦略立案やマーケティングなどで使用されるフェルミ推定に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "正確に算出することが極めて難しい数量に対して，把握している情報と論理的な思考プロセスによって概数を求める手法である。",
      "イ": "特定の集団と活動を共にしたり，人々の動きを観察したりすることによって，慣習や嗜好，地域や組織を取り巻く文化を類推する手法である。",
      "ウ": "入力データと出力データから，その因果関係を統計的に推定する手法である。",
      "エ": "有識者のグループに繰り返し同一のアンケート調査とその結果のフィードバックを行うことによって，ある分野の将来予測に関する総意を得る手法である。"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 10,
    "category": "ストラテジ系",
    "body": "不正競争防止法で規定されている限定提供データに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "特定の第三者に対し，1回に限定して提供する前提で保管されている技術上又は営業上の情報は限定提供データである。",
      "イ": "特定の第三者に提供する情報として電磁的方法によって相当量蓄積され管理されている技術上又は営業上の情報（秘密として管理されているものを除く）は限定提供データである。",
      "ウ": "特定の第三者に提供するために，金庫などで物理的に管理されている技術上又は営業上の情報は限定提供データである。",
      "エ": "不正競争防止法に定めのある営業秘密は限定提供データである。"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 11,
    "category": "ストラテジ系",
    "body": "品質に関する組織やプロセスの運営管理を標準化し，マネジメントの質や効率の向上を目的とした方策として，適切なものはどれか。",
    "choices": {
      "ア": "ISMSの導入",
      "イ": "ISO 9001の導入",
      "ウ": "ITILの導入",
      "エ": "プライバシーマークの取得"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 12,
    "category": "ストラテジ系",
    "body": "AIに関するガイドラインの一つである\"人間中心のAI社会原則\"に定められている七つの\"AI社会原則\"のうち，\"イノベーションの原則\"に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "AIの発展によって人も併せて進化するように，国際化や多様化を推進し，大学，研究機関，企業など，官民における連携と，柔軟な人材の移動を促進する。",
      "イ": "AIの利用がもたらす結果については，問題の特性に応じて，AIの開発，提供，利用に携わった関係者が分担して責任を負う。",
      "ウ": "サービスの提供者は，AIを利用している事実やデータの取得方法や使用方法，結果の適切性について，利用者に対する適切な説明を行う。",
      "エ": "情報弱者を生み出さないために，幼児教育や初等中等教育において，AI活用や情報リテラシーに関する教育を行う。"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 13,
    "category": "ストラテジ系",
    "body": "金融機関では，同一の顧客で複数の口座をもつ個人や法人について，氏名又は法人名，生年月日又は設立年月日，電話番号，住所又は所在地などを手掛かりに集約し，顧客ごとの預金の総額を正確に把握する作業が行われる。このように顧客がもつ複数の口座を，顧客ごとに取りまとめて一元管理する手続を表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "アカウントアグリゲーション",
      "イ": "キーマッピング",
      "ウ": "垂直統合",
      "エ": "名寄せ"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 14,
    "category": "ストラテジ系",
    "body": "ある商品の販売量と気温の関係が一次式で近似できるとき，予測した気温から商品の販売量を推定する手法として，適切なものはどれか。",
    "choices": {
      "ア": "回帰分析",
      "イ": "線形計画法",
      "ウ": "デルファイ法",
      "エ": "パレート分析"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 15,
    "category": "ストラテジ系",
    "body": "必要な時期に必要な量の原材料や部品を調達することによって，工程間の在庫をできるだけもたないようにする生産方式はどれか。",
    "choices": {
      "ア": "BPO",
      "イ": "CIM",
      "ウ": "JIT",
      "エ": "OEM"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 16,
    "category": "ストラテジ系",
    "body": "RPAが適用できる業務として，最も適切なものはどれか。",
    "choices": {
      "ア": "ゲームソフトのベンダーが，ゲームソフトのプログラムを自動で改善する業務",
      "イ": "従業員の交通費精算で，交通機関利用区間情報と領収書データから精算伝票を作成する業務",
      "ウ": "食品加工工場で，産業用ロボットを用いて冷凍食品を自動で製造する業務",
      "エ": "通信販売業で，膨大な購買データから顧客の購買行動に関する新たな法則を見つける業務"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 17,
    "category": "ストラテジ系",
    "body": "技術開発戦略において作成されるロードマップを説明しているものはどれか。",
    "choices": {
      "ア": "技術の競争力レベルと技術のライフサイクルを2軸としたマトリックス上に，自社の技術や新しい技術をプロットする。",
      "イ": "研究開発への投資とその成果を2軸とした座標上に，技術の成長過程をグラフ化し，旧技術から新技術への転換状況を表す。",
      "ウ": "市場面からの有望度と技術面からの有望度を2軸としたマトリックス上に，技術開発プロジェクトをプロットする。",
      "エ": "横軸に時間，縦軸に市場，商品，技術などを示し，研究開発成果の商品化，事業化の方向性をそれらの要素間の関係で表す。"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 18,
    "category": "ストラテジ系",
    "body": "コーポレートガバナンスを強化した事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "女性が活躍しやすくするために労務制度を拡充した。",
      "イ": "迅速な事業展開のために，他社の事業を買収した。",
      "ウ": "独立性の高い社外取締役の人数を増やした。",
      "エ": "利益が得られにくい事業から撤退した。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 19,
    "category": "ストラテジ系",
    "body": "ある銀行では，システムの接続仕様を外部に公開し，あらかじめ契約を結んだ外部事業者のアクセスを認めることによって，利便性の高い，高度なサービスを展開しやすくしている。このような取組を表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "BPO",
      "イ": "RPA",
      "ウ": "オープンAPI",
      "エ": "技術経営"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 20,
    "category": "ストラテジ系",
    "body": "A社では，1千万円を投資して営業支援システムを再構築することを検討している。現状の営業支援システムの運用費が5百万円／年，再構築後の営業支援システムの運用費が4百万円／年，再構築による新たな利益の増加が2百万円／年であるとき，この投資の回収期間は何年か。ここで，これら以外の効果，費用などは考慮しないものとし，計算結果は小数点以下第2位を四捨五入するものとする。",
    "choices": {
      "ア": "2.5",
      "イ": "3.3",
      "ウ": "5.0",
      "エ": "10.0"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 21,
    "category": "ストラテジ系",
    "body": "あるソフトウェアは，定額の料金や一定の期間での利用ができる形態で提供されている。この利用形態を表す用語として，適切なものはどれか。",
    "choices": {
      "ア": "アクティベーション",
      "イ": "アドウェア",
      "ウ": "サブスクリプション",
      "エ": "ボリュームライセンス"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 22,
    "category": "ストラテジ系",
    "body": "インターネットを介して個人や企業が保有する住宅などの遊休資産の貸出しを仲介するサービスや仕組みを表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "シェアードサービス",
      "イ": "シェアウェア",
      "ウ": "シェアリングエコノミー",
      "エ": "ワークシェアリング"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 23,
    "category": "ストラテジ系",
    "body": "A社はRPAソフトウェアを初めて導入するに当たり，計画策定フェーズ，先行導入フェーズ，本格導入フェーズの3段階で進めようと考えている。次のうち，計画策定フェーズで実施する作業として，適切なものだけを全て挙げたものはどれか。\n\na RPAソフトウェアの適用可能性を見極めるための概念検証を実施する。\nb RPAソフトウェアを全社展開するための導入と運用の手順書を作成する。\nc 部門，業務を絞り込んでRPAソフトウェアを導入し，効果を実測する。",
    "choices": {
      "ア": "a",
      "イ": "a, c",
      "ウ": "b",
      "エ": "b, c"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 24,
    "category": "ストラテジ系",
    "body": "式は定期発注方式で原料の発注量を求める計算式である。a～cに入れる字句の適切な組合せはどれか。\n\n発注量＝（[a]＋調達期間）×毎日の使用予定量＋[b]－現在の在庫量－[c]",
    "choices": {
      "ア": "a:営業日数 b:安全在庫量 c:現在の発注残",
      "イ": "a:営業日数 b:現在の発注残 c:安全在庫量",
      "ウ": "a:発注間隔 b:安全在庫量 c:現在の発注残",
      "エ": "a:発注間隔 b:現在の発注残 c:安全在庫量"
    },
    "answer": "ウ",
    "image": "img/2024r06_q24.png"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 25,
    "category": "ストラテジ系",
    "body": "史跡などにスマートフォンを向けると，昔あった建物の画像や説明情報を現実の風景と重ねるように表示して，観光案内をできるようにした。ここで活用した仕組みを表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "AR",
      "イ": "GUI",
      "ウ": "VR",
      "エ": "メタバース"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 26,
    "category": "ストラテジ系",
    "body": "データサイエンティストの役割に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "機械学習や統計などの手法を用いてビッグデータを解析することによって，ビジネスに活用するための新たな知見を獲得する。",
      "イ": "企業が保有する膨大なデータを高速に検索できるように，パフォーマンスの高いデータベースを運用するためのシステム基盤を構築する。",
      "ウ": "企業における情報システムに関するリスクを評価するために，現場でのデータの取扱いや管理についての実態を調査する。",
      "エ": "企業や組織における安全な情報システムの企画，設計，開発，運用を，サイバーセキュリティに関する専門的な知識や技能を活用して支援する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 27,
    "category": "ストラテジ系",
    "body": "個人情報保護法では，あらかじめ本人の同意を得ていなくても個人データの提供が許される行為を規定している。この行為に該当するものだけを，全て挙げたものはどれか。\n\na 事故で意識不明の人がもっていた本人の社員証を見て，搬送先の病院が本人の会社に電話してきたので，総務の担当者が本人の自宅電話番号を教えた。\nb 新規加入者を勧誘したいと保険会社の従業員に頼まれたので，総務の担当者が新入社員の名前と所属部門のリストを渡した。\nc 不正送金等の金融犯罪被害者に関する個人情報を，類似犯罪の防止対策を進める捜査機関からの法令に基づく要請に応じて，総務の担当者が提供した。",
    "choices": {
      "ア": "a",
      "イ": "a, c",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 28,
    "category": "ストラテジ系",
    "body": "次の事例のうち，AIを導入することによって業務の作業効率が向上したものだけを全て挙げたものはどれか。\n\na 食品専門商社のA社が，取引先ごとに様式が異なる手書きの請求書に記載された文字を自動で読み取ってデータ化することによって，事務作業時間を削減した。\nb 繊維製造会社のB社が，原材料を取引先に発注する定型的なPCの操作を自動化するツールを導入し，事務部門の人員を削減した。\nc 損害保険会社のC社が，自社のコールセンターへの問合せに対して，オペレーターにつなげる前に音声チャットボットでヒアリングを行うことによって，オペレーターの対応時間を短縮した。\nd 物流会社のD社が，配送荷物に電子タグを装着して出荷時に配送先を電子タグに書き込み，配送時にそれを確認することによって，誤配送を削減した。",
    "choices": {
      "ア": "a, c",
      "イ": "b, c",
      "ウ": "b, d",
      "エ": "c, d"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 29,
    "category": "ストラテジ系",
    "body": "ある企業が，顧客を引き付ける優れたUX（User Experience）やビジネスモデルをデジタル技術によって創出し，業界における従来のサービスを駆逐してしまうことによって，その業界の既存の構造が破壊されるような現象を表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "デジタルサイネージ",
      "イ": "デジタルディスラプション",
      "ウ": "デジタルディバイド",
      "エ": "デジタルトランスフォーメーション"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 30,
    "category": "ストラテジ系",
    "body": "上司から自社の当期の損益計算書を渡され，\"我が社の収益性分析をしなさい\"と言われた。経営に関する指標のうち，この損益計算書だけから計算できるものだけを全て挙げたものはどれか。\n\na 売上高増加率\nb 売上高利益率\nc 自己資本利益率",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "a, b, c",
      "エ": "b"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 31,
    "category": "ストラテジ系",
    "body": "顧客との個々のつながりを意識して情報を頻繁に更新するSNSなどのシステムとは異なり，会計システムのように高い信頼性と安定稼働が要求される社内情報を扱うシステムの概念を示す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "IoT (Internet of Things)",
      "イ": "PoC (Proof of Concept)",
      "ウ": "SoE (Systems of Engagement)",
      "エ": "SoR (Systems of Record)"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 32,
    "category": "ストラテジ系",
    "body": "労働者派遣における派遣労働者の雇用関係に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "派遣先との間に雇用関係があり，派遣元との間には存在しない。",
      "イ": "派遣元との間に雇用関係があり，派遣先との間には存在しない。",
      "ウ": "派遣元と派遣先のいずれの間にも雇用関係が存在する。",
      "エ": "派遣元と派遣先のいずれの間にも雇用関係は存在しない。"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 33,
    "category": "ストラテジ系",
    "body": "次の記述のうち，業務要件定義が曖昧なことが原因で起こり得る問題だけを全て挙げたものはどれか。\n\na 企画プロセスでシステム化構想がまとまらず，システム化の承認を得られない。\nb コーディングのミスによって，システムが意図したものと違う動作をする。\nc システムの開発中に仕様変更による手戻りが頻発する。\nd システムを受け入れるための適切な受入れテストを設計できない。",
    "choices": {
      "ア": "a, b",
      "イ": "b, c",
      "ウ": "b, d",
      "エ": "c, d"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 34,
    "category": "ストラテジ系",
    "body": "顧客の特徴に応じたきめ細かい対応を行うことによって，顧客と長期的に良好な関係を築き，顧客満足度の向上や取引関係の継続につなげる仕組みを構築したい。その仕組みの構成要素の一つとして，営業活動で入手した顧客に関する属性情報や顧客との交渉履歴などを蓄積し，社内で共有できるシステムを導入することにした。この目的を達成できるシステムとして，最も適切なものはどれか。",
    "choices": {
      "ア": "CAEシステム",
      "イ": "MRPシステム",
      "ウ": "SCMシステム",
      "エ": "SFAシステム"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 35,
    "category": "ストラテジ系",
    "body": "実用新案に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "今までにない製造方法は，実用新案の対象となる。",
      "イ": "自然法則を利用した技術的思想の創作で高度なものだけが，実用新案の対象となる。",
      "ウ": "新規性の審査に合格したものだけが実用新案として登録される。",
      "エ": "複数の物品を組み合わせて考案した新たな製品は，実用新案の対象となる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 36,
    "category": "マネジメント系",
    "body": "プロジェクトに該当する事例として，適切なものだけを全て挙げたものはどれか。\n\na 会社合併に伴う新組織への移行\nb 社内システムの問合せや不具合を受け付けるサービスデスクの運用\nc 新規の経理システム導入に向けたプログラム開発\nd 毎年度末に実施する会計処理",
    "choices": {
      "ア": "a, c",
      "イ": "b, c",
      "ウ": "b, d",
      "エ": "c"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 37,
    "category": "マネジメント系",
    "body": "システム開発プロジェクトを終結する時に，プロジェクト統合マネジメントで実施する活動として，最も適切なものはどれか。",
    "choices": {
      "ア": "工程の進捗の予定と実績の差異を分析する。",
      "イ": "作成した全ての成果物の一覧を確認する。",
      "ウ": "総費用の予算と実績の差異を分析する。",
      "エ": "知識や教訓を組織の資産として登録する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 38,
    "category": "マネジメント系",
    "body": "あるシステムの運用において，利用者との間でSLAを交わし，利用可能日を月曜日から金曜日，1日の利用可能時間を7時から22時まで，稼働率を98%以上で合意した。1週間の運用において，障害などでシステムの停止を許容できる時間は最大何時間か。",
    "choices": {
      "ア": "0.3",
      "イ": "1.5",
      "ウ": "1.8",
      "エ": "2.1"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 39,
    "category": "マネジメント系",
    "body": "サービスデスクを評価するためには適切なKPIを定めて評価する必要がある。顧客満足度を高めるために値が小さい方が良いKPIとして，適切なものだけを全て挙げたものはどれか。\n\na SLAで合意された目標時間内に対応が完了したインシデント件数の割合\nb 1回の問合せで解決ができたインシデント件数の割合\nc 二次担当へエスカレーションされたインシデント件数の割合\nd 利用者がサービスデスクの担当者につながるまでに費やした時間",
    "choices": {
      "ア": "a, b",
      "イ": "a, d",
      "ウ": "b, c",
      "エ": "c, d"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 40,
    "category": "マネジメント系",
    "body": "アジャイル開発に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "開発する機能を小さい単位に分割して，優先度の高いものから短期間で開発とリリースを繰り返す。",
      "イ": "共通フレームを適用して要件定義，設計などの工程名及び作成する文書を定義する。",
      "ウ": "システム開発を上流工程から下流工程まで順番に進めて，全ての開発工程が終了してからリリースする。",
      "エ": "プロトタイプを作成して利用者に確認を求め，利用者の評価とフィードバックを行いながら開発を進めていく。"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 41,
    "category": "マネジメント系",
    "body": "あるプロジェクトの作業間の関係と所要時間がアローダイアグラムで示されている。このアローダイアグラムのBからEの四つの結合点のうち，工程全体の完了時間に影響を与えることなく，その結合点から始まる全ての作業の開始を最も遅らせることができるものはどれか。ここで，各結合点から始まる作業はその結合点に至る作業が全て完了するまで開始できず，作業から次の作業への段取り時間は考えないものとする。",
    "choices": {
      "ア": "B",
      "イ": "C",
      "ウ": "D",
      "エ": "E"
    },
    "answer": "イ",
    "image": "img/2024r06_q41.png"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 42,
    "category": "マネジメント系",
    "body": "システム監査人の役割として，適切なものだけを全て挙げたものはどれか。\n\na 監査手続の種類，実施時期，適用範囲などについて，監査計画を立案する。\nb 監査の目的に応じた監査報告書を作成し，社内に公開する。\nc 監査報告書にある改善提案に基づく改善の実施を監査対象部門に指示する。\nd 監査報告書にある改善提案に基づく改善の実施状況をモニタリングする。",
    "choices": {
      "ア": "a, b",
      "イ": "a, d",
      "ウ": "b, c",
      "エ": "c, d"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 43,
    "category": "マネジメント系",
    "body": "情報システムに関する施設や設備を維持・保全するために行うリスク対策のうち，ファシリティマネジメントの観点から行う対策として，適切なものだけを全て挙げたものはどれか。\n\na コンピュータ室への入室を，認可した者だけに限定する。\nb コンピュータの設置場所を示す標識を掲示しない。\nc 利用者のPCにマルウェア対策ソフトを導入する。",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "a, c",
      "エ": "b, c"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 44,
    "category": "マネジメント系",
    "body": "提供しているITシステムが事業のニーズを満たせるように，人材，プロセス，情報技術を適切に組み合わせ，継続的に改善して管理する活動として，最も適切なものはどれか。",
    "choices": {
      "ア": "ITサービスマネジメント",
      "イ": "システム監査",
      "ウ": "ヒューマンリソースマネジメント",
      "エ": "ファシリティマネジメント"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 45,
    "category": "マネジメント系",
    "body": "本番稼働後の業務遂行のために，業務別にサービス利用方法の手順を示した文書として，最も適切なものはどれか。",
    "choices": {
      "ア": "FAQ",
      "イ": "サービスレベル合意書",
      "ウ": "システム要件定義書",
      "エ": "利用者マニュアル"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 46,
    "category": "マネジメント系",
    "body": "ITサービスマネジメントの管理プロセスに関する記述a～cと用語の適切な組合せはどれか。\n\na ITサービスの変更を実装するためのプロセス\nb インシデントの根本原因を突き止めて解決策を提供するためのプロセス\nc 組織が所有しているIT資産を把握するためのプロセス",
    "choices": {
      "ア": "a:構成管理 b:問題管理 c:リリース及び展開管理",
      "イ": "a:構成管理 b:リリース及び展開管理 c:問題管理",
      "ウ": "a:問題管理 b:リリース及び展開管理 c:構成管理",
      "エ": "a:リリース及び展開管理 b:問題管理 c:構成管理"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 47,
    "category": "マネジメント系",
    "body": "ソフトウェアの開発におけるDevOpsに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "開発側が重要な機能のプロトタイプを作成し，顧客とともにその性能を実測して妥当性を評価する。",
      "イ": "開発側では，開発の各工程でその工程の完了を判断した上で次工程に進み，総合テストで利用者が参加して操作性の確認を実施した後に運用側に引き渡す。",
      "ウ": "開発側と運用側が密接に連携し，自動化ツールなどを活用して機能の導入や更新などを迅速に進める。",
      "エ": "システム開発において，機能の拡張を図るために，固定された短期間のサイクルを繰り返しながらプログラムを順次追加する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 48,
    "category": "マネジメント系",
    "body": "システム監査で用いる判断尺度の選定方法に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "システム監査ではシステム管理基準の全項目をそのまま使用しなければならない。",
      "イ": "システム監査のテーマに応じて，システム管理基準以外の基準を使用してもよい。",
      "ウ": "システム監査のテーマによらず，システム管理基準以外の基準は使用すべきでない。",
      "エ": "アジャイル開発では，システム管理基準は使用すべきでない。"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 49,
    "category": "マネジメント系",
    "body": "ソフトウェア開発プロジェクトにおける，コストの見積手法には，積み上げ法，ファンクションポイント法，類推見積法などがある。見積りで使用した手法とその特徴に関する記述a～cの適切な組合せはどれか。\n\na プロジェクトに必要な個々の作業を洗い出し，その作業ごとの工数を見積もって集計する。\nb プロジェクトの初期段階で使用する手法で，過去の事例を活用してコストを見積もる。\nc データ入出力や機能に着目して，ソフトウェア規模を見積もり，係数を乗ずるなどしてコストを見積もる。",
    "choices": {
      "ア": "積み上げ法:a ファンクションポイント法:c 類推見積法:b",
      "イ": "積み上げ法:b ファンクションポイント法:a 類推見積法:c",
      "ウ": "積み上げ法:c ファンクションポイント法:a 類推見積法:b",
      "エ": "積み上げ法:c ファンクションポイント法:b 類推見積法:a"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 50,
    "category": "マネジメント系",
    "body": "ソフトウェア製品の品質特性を，移植性，機能適合性，互換性，使用性，信頼性，性能効率性，セキュリティ，保守性に分類したとき，RPAソフトウェアの使用性に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "RPAが稼働するPCのOSが変わっても動作する。",
      "イ": "RPAで指定した時間及び条件に基づき，適切に自動処理が実行される。",
      "ウ": "RPAで操作対象となるアプリケーションソフトウェアがバージョンアップされても，簡単な設定変更で対応できる。",
      "エ": "RPAを利用したことがない人でも，簡単な教育だけで利用可能になる。"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 51,
    "category": "マネジメント系",
    "body": "システム開発プロジェクトにおいて，テスト中に発見された不具合の再発防止のために不具合分析を行うことにした。テスト結果及び不具合の内容を表に記入し，不具合ごとに根本原因を突き止めた後に，根本原因ごとに集計を行い発生頻度の多い順に並べ，主要な根本原因の特定を行った。ここで利用した図表のうち，根本原因を集計し，発生頻度順に並べて棒グラフで示し，累積値を折れ線グラフで重ねて示したものはどれか。",
    "choices": {
      "ア": "散布図",
      "イ": "チェックシート",
      "ウ": "特性要因図",
      "エ": "パレート図"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 52,
    "category": "マネジメント系",
    "body": "システム開発プロジェクトにおいて，新機能の追加要求が変更管理委員会で認可された後にプロジェクトスコープマネジメントで実施する活動として，適切なものはどれか。",
    "choices": {
      "ア": "新機能を追加で開発するためにWBSを変更し，コストの詳細な見積りをするための情報として提供する。",
      "イ": "新機能を追加で開発するためのWBSのアクティビティの実行に必要なスキルを確認し，必要に応じてプロジェクトチームの能力向上を図る。",
      "ウ": "変更されたWBSに基づいてスケジュールを作成し，完了時期の見通しを提示する。",
      "エ": "変更されたWBSに基づいて要員の充足度を確認し，必要な場合は作業の外注を検討する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 53,
    "category": "マネジメント系",
    "body": "ITガバナンスに関する次の記述中のaに入れる字句として，最も適切なものはどれか。\n\n経営者は，[a]の事業の目的を支援する観点で，効果的，効率的かつ受容可能な[a]のITの利用について評価する。",
    "choices": {
      "ア": "過去と現在",
      "イ": "現在",
      "ウ": "現在と将来",
      "エ": "将来"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 54,
    "category": "マネジメント系",
    "body": "事業活動に関わる法令の遵守などを目的の一つとして，統制環境，リスクの評価と対応，統制活動，情報と伝達，モニタリング，ITへの対応から構成される取組はどれか。",
    "choices": {
      "ア": "CMMI",
      "イ": "ITIL",
      "ウ": "内部統制",
      "エ": "リスク管理"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 55,
    "category": "マネジメント系",
    "body": "システム監査の目的に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "開発すべきシステムの具体的な用途を分析し，システム要件を明らかにすること",
      "イ": "情報システムが設置されている施設とその環境を総合的に企画，管理，活用すること",
      "ウ": "情報システムに係るリスクに適切に対応しているかどうかを評価することによって，組織体の目標達成に寄与すること",
      "エ": "知識，スキル，ツール及び技法をプロジェクト活動に適用することによって，プロジェクトの要求事項を満足させること"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 56,
    "category": "テクノロジ系",
    "body": "PCにおいて，電力供給を断つと記憶内容が失われるメモリ又は記憶媒体はどれか。",
    "choices": {
      "ア": "DVD-RAM",
      "イ": "DRAM",
      "ウ": "ROM",
      "エ": "フラッシュメモリ"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 57,
    "category": "テクノロジ系",
    "body": "暗号化方式の特徴について記した表において，表中のa～dに入れる字句の適切な組合せはどれか。",
    "choices": {
      "ア": "a:共通鍵暗号方式 b:公開鍵暗号方式 c:遅い d:速い",
      "イ": "a:共通鍵暗号方式 b:公開鍵暗号方式 c:速い d:遅い",
      "ウ": "a:公開鍵暗号方式 b:共通鍵暗号方式 c:遅い d:速い",
      "エ": "a:公開鍵暗号方式 b:共通鍵暗号方式 c:速い d:遅い"
    },
    "answer": "ウ",
    "image": "img/2024r06_q57.png"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 58,
    "category": "テクノロジ系",
    "body": "文書作成ソフトや表計算ソフトなどにおいて，一連の操作手順をあらかじめ定義しておき，実行する機能はどれか。",
    "choices": {
      "ア": "オートコンプリート",
      "イ": "ソースコード",
      "ウ": "プラグアンドプレイ",
      "エ": "マクロ"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 59,
    "category": "テクノロジ系",
    "body": "OCRの役割として，適切なものはどれか。",
    "choices": {
      "ア": "10cm程度の近距離にある機器間で無線通信する。",
      "イ": "印刷文字や手書き文字を認識し，テキストデータに変換する。",
      "ウ": "デジタル信号処理によって，人工的に音声を作り出す。",
      "エ": "利用者の指先などが触れたパネル上の位置を検出する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 60,
    "category": "テクノロジ系",
    "body": "関係データベースを構成する要素の関係を表す図において，図中のa～cに入れる字句の適切な組合せはどれか。",
    "choices": {
      "ア": "a:表 b:フィールド c:レコード",
      "イ": "a:表 b:レコード c:フィールド",
      "ウ": "a:フィールド b:表 c:レコード",
      "エ": "a:レコード b:表 c:フィールド"
    },
    "answer": "イ",
    "image": "img/2024r06_q60.png"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 61,
    "category": "テクノロジ系",
    "body": "cookieを説明したものはどれか。",
    "choices": {
      "ア": "Webサイトが，Webブラウザを通じて訪問者のPCにデータを書き込んで保存する仕組み又は保存されるデータのこと",
      "イ": "Webブラウザが，アクセスしたWebページをファイルとしてPCのハードディスクに一時的に保存する仕組み又は保存されるファイルのこと",
      "ウ": "Webページ上で，Webサイトの紹介などを目的に掲載されている画像のこと",
      "エ": "ブログの機能の一つで，リンクを張った相手に対してその旨を通知する仕組みのこと"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 62,
    "category": "テクノロジ系",
    "body": "関数convertは，整数型の配列を一定のルールで文字列に変換するプログラムである。関数convertをconvert(arrayInput)として呼び出したときの戻り値が\"AABAB\"になる引数arrayInputの値はどれか。ここで，arrayInputの要素数は1以上とし，配列の要素番号は1から始まる。",
    "choices": {
      "ア": "{0, 0, 1, 2, 1}",
      "イ": "{0, 1, 2, 1, 1}",
      "ウ": "{1, 0, 1, 2, 0}",
      "エ": "{1, 1, 2, 1, 0}"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 63,
    "category": "テクノロジ系",
    "body": "SSDの全てのデータを消去し，復元できなくする方法として用いられているものはどれか。",
    "choices": {
      "ア": "Secure Erase",
      "イ": "磁気消去",
      "ウ": "セキュアブート",
      "エ": "データクレンジング"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 64,
    "category": "テクノロジ系",
    "body": "情報セキュリティのリスクマネジメントにおけるリスクへの対応を，リスク共有，リスク回避，リスク保有及びリスク低減の四つに分類するとき，リスク共有の例として，適切なものはどれか。",
    "choices": {
      "ア": "災害によるシステムの停止時間を短くするために，遠隔地にバックアップセンターを設置する。",
      "イ": "情報漏えいによって発生する損害賠償や事故処理の損失補填のために，サイバー保険に加入する。",
      "ウ": "電子メールによる機密ファイルの流出を防ぐために，ファイルを添付した電子メールの送信には上司の許可を必要とする仕組みにする。",
      "エ": "ノートPCの紛失や盗難による情報漏えいを防ぐために，HDDを暗号化する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 65,
    "category": "テクノロジ系",
    "body": "AIにおける機械学習の学習方法に関する次の記述中のa～cに入れる字句の適切な組合せはどれか。\n\n教師あり学習は，正解を付けた学習データを入力することによって，[a]と呼ばれる手法で未知のデータを複数のクラスに分けたり，[b]と呼ばれる手法でデータの関係性を見つけたりすることができるようになる学習方法である。教師なし学習は，正解を付けない学習データを入力することによって，[c]と呼ばれる手法などで次第にデータを正しくグループ分けできるようになる学習方法である。",
    "choices": {
      "ア": "a:回帰 b:分類 c:クラスタリング",
      "イ": "a:クラスタリング b:分類 c:回帰",
      "ウ": "a:分類 b:回帰 c:クラスタリング",
      "エ": "a:分類 b:クラスタリング c:回帰"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 66,
    "category": "テクノロジ系",
    "body": "PKIにおけるCA（Certificate Authority）の役割に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "インターネットと内部ネットワークの間にあって，内部ネットワーク上のコンピュータに代わってインターネットにアクセスする。",
      "イ": "インターネットと内部ネットワークの間にあって，パケットフィルタリング機能などを用いてインターネットから内部ネットワークへの不正アクセスを防ぐ。",
      "ウ": "利用者に指定されたドメイン名を基にIPアドレスとドメイン名の対応付けを行い，利用者を目的のサーバにアクセスさせる。",
      "エ": "利用者の公開鍵に対する公開鍵証明書の発行や失効を行い，鍵の正当性を保証する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 67,
    "category": "テクノロジ系",
    "body": "図に示す2台のWebサーバと1台のデータベースサーバから成るWebシステムがある。Webサーバの稼働率はともに0.8とし，データベースサーバの稼働率は0.9とすると，このシステムの小数第3位を四捨五入した稼働率は幾らか。ここで，2台のWebサーバのうち少なくとも1台が稼働していて，かつ，データベースサーバが稼働していれば，システムとしては稼働しているとみなす。また，それぞれのサーバはランダムに故障が起こるものとする。",
    "choices": {
      "ア": "0.04",
      "イ": "0.58",
      "ウ": "0.86",
      "エ": "0.96"
    },
    "answer": "ウ",
    "image": "img/2024r06_q67.png"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 68,
    "category": "テクノロジ系",
    "body": "情報デザインで用いられる概念であり，部屋のドアノブの形で開閉の仕方を示唆するというような，人間の適切な行動を誘発する知覚可能な手掛かりのことを何と呼ぶか。",
    "choices": {
      "ア": "NUI (Natural User Interface)",
      "イ": "ウィザード",
      "ウ": "シグニファイア",
      "エ": "マルチタッチ"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 69,
    "category": "テクノロジ系",
    "body": "障害に備えるために，4台のHDDを使い，1台分の容量をパリティ情報の記録に使用するRAID5を構成する。1台のHDDの容量が1Tバイトのとき，実効データ容量はおよそ何Tバイトか。",
    "choices": {
      "ア": "2T",
      "イ": "3T",
      "ウ": "4T",
      "エ": "5T"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 70,
    "category": "テクノロジ系",
    "body": "ESSIDをステルス化することによって得られる効果として，適切なものはどれか。",
    "choices": {
      "ア": "アクセスポイントと端末間の通信を暗号化できる。",
      "イ": "アクセスポイントに接続してくる端末を認証できる。",
      "ウ": "アクセスポイントへの不正接続リスクを低減できる。",
      "エ": "アクセスポイントを介さず，端末同士で直接通信できる。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 71,
    "category": "テクノロジ系",
    "body": "インターネットで使用されているドメイン名の説明として，適切なものはどれか。",
    "choices": {
      "ア": "Web閲覧や電子メールを送受信するアプリケーションが使用する通信規約の名前",
      "イ": "コンピュータやネットワークなどを識別するための名前",
      "ウ": "通信を行うアプリケーションを識別するための名前",
      "エ": "電子メールの宛先として指定する相手の名前"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 72,
    "category": "テクノロジ系",
    "body": "次の記述のうち，バイオメトリクス認証の例だけを全て挙げたものはどれか。\n\na Webページに歪んだ文字の列から成る画像を表示し，読み取った文字列を利用者に入力させることによって，認証を行う。\nb キーボードで特定文字列を入力させ，そのときの打鍵の速度やタイミングの変化によって，認証を行う。\nc タッチパネルに手書きで氏名を入力させ，そのときの筆跡，筆圧，運筆速度などによって，認証を行う。\nd タッチパネルに表示された複数の点をあらかじめ決められた順になぞらせることによって，認証を行う。",
    "choices": {
      "ア": "a, b",
      "イ": "a, d",
      "ウ": "b, c",
      "エ": "c, d"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 73,
    "category": "テクノロジ系",
    "body": "IoT機器のセキュリティ対策のうち，ソーシャルエンジニアリング対策として，最も適切なものはどれか。",
    "choices": {
      "ア": "IoT機器とサーバとの通信は，盗聴を防止するために常に暗号化通信で行う。",
      "イ": "IoT機器の脆弱性を突いた攻撃を防止するために，機器のメーカーから最新のファームウェアを入手してアップデートを行う。",
      "ウ": "IoT機器へのマルウェア感染を防止するためにマルウェア対策ソフトを導入する。",
      "エ": "IoT機器を廃棄するときは，内蔵されている記憶装置からの情報漏えいを防止するために物理的に破壊する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 74,
    "category": "テクノロジ系",
    "body": "トランザクション処理に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "コミットとは，トランザクションが正常に処理されなかったときに，データベースをトランザクション開始前の状態に戻すことである。",
      "イ": "排他制御とは，トランザクションが正常に処理されたときに，データベースの内容を確定させることである。",
      "ウ": "ロールバックとは，複数のトランザクションが同時に同一データを更新しようとしたときに，データの矛盾が起きないようにすることである。",
      "エ": "ログとは，データベースの更新履歴を記録したファイルのことである。"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 75,
    "category": "テクノロジ系",
    "body": "情報セキュリティの3要素である機密性，完全性及び可用性と，それらを確保するための対策の例a～cの適切な組合せはどれか。\n\na アクセス制御\nb デジタル署名\nc ディスクの二重化",
    "choices": {
      "ア": "a:可用性 b:完全性 c:機密性",
      "イ": "a:可用性 b:機密性 c:完全性",
      "ウ": "a:完全性 b:機密性 c:可用性",
      "エ": "a:機密性 b:完全性 c:可用性"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 76,
    "category": "テクノロジ系",
    "body": "スマートフォンなどのタッチパネルで広く採用されている方式であり，指がタッチパネルの表面に近づいたときに，その位置を検出する方式はどれか。",
    "choices": {
      "ア": "感圧式",
      "イ": "光学式",
      "ウ": "静電容量方式",
      "エ": "電磁誘導方式"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 77,
    "category": "テクノロジ系",
    "body": "出所が不明のプログラムファイルの使用を避けるために，その発行元を調べたい。このときに確認する情報として，最も適切なものはどれか。",
    "choices": {
      "ア": "そのプログラムファイルのアクセス権",
      "イ": "そのプログラムファイルの所有者情報",
      "ウ": "そのプログラムファイルのデジタル署名",
      "エ": "そのプログラムファイルのハッシュ値"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 78,
    "category": "テクノロジ系",
    "body": "利用者がスマートスピーカーに向けて話し掛けた内容に対して，スマートスピーカーから音声で応答するための処理手順が（1）～（4）のとおりであるとき，音声認識に該当する処理はどれか。\n\n（1）利用者の音声をテキストデータに変換する。\n（2）テキストデータを解析して，その意味を理解する。\n（3）応答する内容を決定して，テキストデータを生成する。\n（4）生成したテキストデータを読み上げる。",
    "choices": {
      "ア": "(1)",
      "イ": "(2)",
      "ウ": "(3)",
      "エ": "(4)"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 79,
    "category": "テクノロジ系",
    "body": "企業などの内部ネットワークとインターネットとの間にあって，セキュリティを確保するために内部ネットワークのPCに代わって，インターネット上のWebサーバにアクセスするものはどれか。",
    "choices": {
      "ア": "DNSサーバ",
      "イ": "NTPサーバ",
      "ウ": "ストリーミングサーバ",
      "エ": "プロキシサーバ"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 80,
    "category": "テクノロジ系",
    "body": "OSS（Open Source Software）に関する記述として，適切なものだけを全て挙げたものはどれか。\n\na OSSを利用して作成したソフトウェアを販売することができる。\nb ソースコードが公開されたソフトウェアは全てOSSである。\nc 著作権が放棄されているソフトウェアである。",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 81,
    "category": "テクノロジ系",
    "body": "一つの表で管理されていた受注データを，受注に関する情報と商品に関する情報に分割して，正規化を行った上で関係データベースの表で管理する。正規化を行った結果の表の組合せとして，最も適切なものはどれか。ここで，同一商品で単価が異なるときは商品番号も異なるものとする。また，発注者名には同姓同名はいないものとする。",
    "choices": {
      "ア": "受注番号,発注者名 / 商品番号,商品名,個数,単価",
      "イ": "受注番号,発注者名,商品番号 / 商品番号,商品名,個数,単価",
      "ウ": "受注番号,発注者名,商品番号,個数,単価 / 商品番号,商品名",
      "エ": "受注番号,発注者名,商品番号,個数 / 商品番号,商品名,単価"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 82,
    "category": "テクノロジ系",
    "body": "ISMSクラウドセキュリティ認証に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "一度認証するだけで，複数のクラウドサービスやシステムなどを利用できるようにする認証の仕組み",
      "イ": "クラウドサービスについて，クラウドサービス固有の管理策が実施されていることを認証する制度",
      "ウ": "個人情報について適切な保護措置を講ずる体制を整備しているクラウド事業者などを評価して，事業活動に関してプライバシーマークの使用を認める制度",
      "エ": "利用者がクラウドサービスへログインするときの環境，IPアドレスなどに基づいて状況を分析し，リスクが高いと判断された場合に追加の認証を行う仕組み"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 83,
    "category": "テクノロジ系",
    "body": "1から6までの六つの目をもつサイコロを3回投げたとき，1回も1の目が出ない確率は幾らか。",
    "choices": {
      "ア": "1/216",
      "イ": "5/72",
      "ウ": "91/216",
      "エ": "125/216"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 84,
    "category": "テクノロジ系",
    "body": "IoTエリアネットワークでも利用され，IoTデバイスからの無線通信をほかのIoTデバイスが中継することを繰り返し，リレー方式で通信をすることによって，広範囲の通信を実現する技術はどれか。",
    "choices": {
      "ア": "GPS",
      "イ": "MIMO",
      "ウ": "キャリアアグリゲーション",
      "エ": "マルチホップ"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 85,
    "category": "テクノロジ系",
    "body": "関数binaryToIntegerは，1桁以上の符号なし2進数を文字列で表した値を引数binaryStrで受け取り，その値を整数に変換した結果を戻り値とする。例えば，引数として\"100\"を受け取ると，4を返す。プログラム中のa, bに入れる字句の適切な組合せはどれか。",
    "choices": {
      "ア": "a:(2のi乗)－1 b:integerNum × digitNum × exponent",
      "イ": "a:(2のi乗)－1 b:integerNum + digitNum × exponent",
      "ウ": "a:2の(i－1)乗 b:integerNum × digitNum × exponent",
      "エ": "a:2の(i－1)乗 b:integerNum + digitNum × exponent"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 86,
    "category": "テクノロジ系",
    "body": "PDCAモデルに基づいてISMSを運用している組織において，C（Check）で実施することの例として，最も適切なものはどれか。",
    "choices": {
      "ア": "業務内容の監査結果に基づいた是正処置として，サーバの監視方法を変更する。",
      "イ": "具体的な対策と目標を決めるために，サーバ室内の情報資産を洗い出す。",
      "ウ": "サーバ管理者の業務内容を第三者が客観的に評価する。",
      "エ": "定められた運用手順に従ってサーバの動作を監視する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 87,
    "category": "テクノロジ系",
    "body": "通常の検索エンジンでは検索されず匿名性が高いので，サイバー攻撃や違法商品の取引などにも利用されることがあり，アクセスするには特殊なソフトウェアが必要になることもあるインターネット上のコンテンツの総称を何と呼ぶか。",
    "choices": {
      "ア": "RSS",
      "イ": "SEO",
      "ウ": "クロスサイトスクリプティング",
      "エ": "ダークウェブ"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 88,
    "category": "テクノロジ系",
    "body": "JavaScriptに関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "Webブラウザ上に，動的な振る舞いなどを組み込むことができる。",
      "イ": "Webブラウザではなく，Webサーバ上だけで動作する。",
      "ウ": "実行するためには，あらかじめコンパイルする必要がある。",
      "エ": "名前のとおり，Javaのスクリプト版である。"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 89,
    "category": "テクノロジ系",
    "body": "システムの利用者認証に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "1回の認証で，複数のサーバやアプリケーションなどへのログインを実現する仕組みを，チャレンジレスポンス認証という。",
      "イ": "指紋や声紋など，身体的な特徴を利用して本人認証を行う仕組みを，シングルサインオンという。",
      "ウ": "情報システムが利用者の本人確認のために用いる，数字列から成る暗証番号のことを，PINという。",
      "エ": "特定の数字や文字の並びではなく，位置についての情報を覚えておき，認証時には画面に表示された表の中で，自分が覚えている位置に並んでいる数字や文字をパスワードとして入力する方式を，多要素認証という。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 90,
    "category": "テクノロジ系",
    "body": "セキュリティ対策として使用されるWAFの説明として，適切なものはどれか。",
    "choices": {
      "ア": "ECなどのWebサイトにおいて，Webアプリケーションソフトウェアの脆弱性を突いた攻撃からの防御や，不審なアクセスのパターンを検知する仕組み",
      "イ": "インターネットなどの公共のネットワークを用いて，専用線のようなセキュアな通信環境を実現する仕組み",
      "ウ": "情報システムにおいて，機密データを特定して監視することによって，機密データの紛失や外部への漏えいを防止する仕組み",
      "エ": "ファイアウォールを用いて，インターネットと企業の内部ネットワークとの間に緩衝領域を作る仕組み"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 91,
    "category": "テクノロジ系",
    "body": "職場で不要になったPCを廃棄する場合の情報漏えい対策として，最も適切なものはどれか。",
    "choices": {
      "ア": "OSが用意しているファイル削除の機能を使って，PC内のデータファイルを全て削除する。",
      "イ": "PCにインストールされているアプリケーションを，全てアンインストールする。",
      "ウ": "PCに内蔵されている全ての記憶装置を論理フォーマットする。",
      "エ": "専用ソフトなどを使って，PCに内蔵されている全ての記憶装置の内容を消去するために，ランダムなデータを規定回数だけ上書きする。"
    },
    "answer": "エ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 92,
    "category": "テクノロジ系",
    "body": "インターネットに接続されているサーバが，1台でメール送受信機能とWebアクセス機能の両方を提供しているとき，端末のアプリケーションプログラムがそのどちらの機能を利用するかをサーバに指定するために用いるものはどれか。",
    "choices": {
      "ア": "IPアドレス",
      "イ": "ドメイン",
      "ウ": "ポート番号",
      "エ": "ホスト名"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 93,
    "category": "テクノロジ系",
    "body": "関係データベースで管理している\"従業員\"表から，氏名が\"%葉_\"に該当する従業員を抽出した。抽出された従業員は何名か。ここで，\"_\"は任意の1文字を表し，\"%\"は0文字以上の任意の文字列を表すものとする。",
    "choices": {
      "ア": "1",
      "イ": "2",
      "ウ": "3",
      "エ": "4"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 94,
    "category": "テクノロジ系",
    "body": "企業において情報セキュリティポリシー策定で行う作業のうち，次の作業の実施順序として，適切なものはどれか。\n\na 策定する責任者や担当者を決定する。\nb 情報セキュリティ対策の基本方針を策定する。\nc 保有する情報資産を洗い出し，分類する。\nd リスクを分析する。",
    "choices": {
      "ア": "a→b→c→d",
      "イ": "a→b→d→c",
      "ウ": "b→a→c→d",
      "エ": "b→a→d→c"
    },
    "answer": "ア"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 95,
    "category": "テクノロジ系",
    "body": "AIの関連技術であるディープラーニングに用いられる技術として，最も適切なものはどれか。",
    "choices": {
      "ア": "ソーシャルネットワーク",
      "イ": "ニューラルネットワーク",
      "ウ": "フィージビリティスタディ",
      "エ": "フォールトトレラント"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 96,
    "category": "テクノロジ系",
    "body": "Aさんは次のように宛先を指定して電子メールを送信した。この電子メールの受信者に関する記述のうち，適切なものだけを全て挙げたものはどれか。\n\n[宛先]\nTo:Bさんのメールアドレス\nCc:Cさんのメールアドレス\nBcc:Dさんのメールアドレス，Eさんのメールアドレス\n\n（1）CさんはDさんのメールアドレスを知ることができる。\n（2）DさんはCさんのメールアドレスを知ることができる。\n（3）EさんはDさんのメールアドレスを知ることができる。",
    "choices": {
      "ア": "(1)",
      "イ": "(1), (3)",
      "ウ": "(2)",
      "エ": "(2), (3)"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 97,
    "category": "テクノロジ系",
    "body": "次のOSのうち，OSS（Open Source Software）として提供されるものだけを全て挙げたものはどれか。\n\na Android\nb FreeBSD\nc iOS\nd Linux",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, d",
      "ウ": "b, d",
      "エ": "c, d"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 98,
    "category": "テクノロジ系",
    "body": "ランサムウェアに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "PCに外部から不正にログインするための侵入路をひそかに設置する。",
      "イ": "PCのファイルを勝手に暗号化し，復号のためのキーを提供することなどを条件に金銭を要求する。",
      "ウ": "Webブラウザを乗っ取り，オンラインバンキングなどの通信に割り込んで不正送金などを行う。",
      "エ": "自らネットワークを経由して感染を広げる機能をもち，まん延していく。"
    },
    "answer": "イ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 99,
    "category": "テクノロジ系",
    "body": "GPSの電波を捕捉しにくいビルの谷間や狭い路地などでも位置を計測することができるように，特定の地域の上空に比較的長く留まる軌道をとり，GPSと併用することによって，より高い測位精度を実現するものはどれか。",
    "choices": {
      "ア": "アシストGPS",
      "イ": "ジャイロセンサー",
      "ウ": "準天頂衛星",
      "エ": "プローブカー"
    },
    "answer": "ウ"
  },
  {
    "exam": "2024r06",
    "examLabel": "R06",
    "number": 100,
    "category": "テクノロジ系",
    "body": "正しいURLを指定してインターネット上のWebサイトへアクセスしようとした利用者が，偽装されたWebサイトに接続されてしまうようになった。原因を調べたところ，ドメイン名とIPアドレスの対応付けを管理するサーバに脆弱性があり，攻撃者によって，ドメイン名とIPアドレスを対応付ける情報が書き換えられていた。このサーバが受けた攻撃はどれか。",
    "choices": {
      "ア": "DDoS攻撃",
      "イ": "DNSキャッシュポイズニング",
      "ウ": "ソーシャルエンジニアリング",
      "エ": "ドライブバイダウンロード"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 1,
    "category": "ストラテジ系",
    "body": "A社がB社に作業の一部を請負契約で委託している。作業形態a～cのうち，いわゆる偽装請負とみなされる状態だけを全て挙げたものはどれか。\n\na B社の従業員が，A社内において，A社の責任者の指揮命令の下で，請負契約で取り決めた作業を行っている。\nb B社の従業員が，A社内において，B社の責任者の指揮命令の下で，請負契約で取り決めた作業を行っている。\nc B社の従業員が，B社内において，A社の責任者の指揮命令の下で，請負契約で取り決めた作業を行っている。",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "a, c",
      "エ": "b, c"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 2,
    "category": "ストラテジ系",
    "body": "従来の情報セキュリティマネジメントシステム規格を基礎に追加で制定されたもので，クラウドサービスに対応した情報セキュリティ管理体制を構築するためのガイドライン規格として，最も適切なものはどれか。",
    "choices": {
      "ア": "ISO 14001",
      "イ": "JIS Q 15001",
      "ウ": "ISO/IEC 27017",
      "エ": "ISO 9001"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 3,
    "category": "ストラテジ系",
    "body": "政府は，官民データ活用推進基本法に定められた\"官民データ活用推進基本計画\"を策定し，官民データの公開や活用の促進に取り組んでいる。次の組織体のうち，官民データを所有しているものだけを全て挙げたものはどれか。\n\na 県庁\nb 大学\nc 電力事業者\nd 独立行政法人",
    "choices": {
      "ア": "a, b, c",
      "イ": "a, b, c, d",
      "ウ": "a, b, d",
      "エ": "a, c, d"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 4,
    "category": "ストラテジ系",
    "body": "投資の優先度などの経営の戦略を策定するために，経済価値，希少性，模倣困難性及び組織の四つの要素で評価することによって，自社のもつ資源を分析する手法として，最も適切なものはどれか。",
    "choices": {
      "ア": "4P",
      "イ": "PPM",
      "ウ": "SWOT分析",
      "エ": "VRIO分析"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 5,
    "category": "ストラテジ系",
    "body": "A社ではB商品の仕入れと販売を行っている。ある期のB商品の仕入単価は期首から上昇し続け，期末が最も高くなった。当該期の売上原価を\"期首棚卸高＋当期商品仕入高－期末棚卸高\"で計算するとき，期末棚卸高の計算に期末の仕入単価を用いると，B商品の期末棚卸高及び売上原価は，期中の仕入単価の平均値を用いる場合に比べてどのようになるか。",
    "choices": {
      "ア": "期末棚卸高，売上原価ともに上がる。",
      "イ": "期末棚卸高，売上原価ともに変わらない。",
      "ウ": "期末棚卸高は上がり，売上原価は下がる。",
      "エ": "期末棚卸高は下がり，売上原価は上がる。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 6,
    "category": "ストラテジ系",
    "body": "特定電子メール法は，電子メールによる一方的な広告宣伝メールの送信を規制する法律である。企業担当者が行った次の電子メールの送信事例のうち，特定電子メール法の規制対象となり得るものはどれか。",
    "choices": {
      "ア": "広告宣伝メールの受信を拒否する旨の意思表示がないことを確認したのち，公表されている企業のメールアドレス宛てに広告宣伝メールを送信した。",
      "イ": "受信者から拒否通知があった場合には，それ以降の送信を禁止すればよいと考え，広告宣伝メールを送信した。",
      "ウ": "内容は事務連絡と料金請求なので問題ないと考え，受信者本人の同意なく，メールを送信した。",
      "エ": "長年の取引関係にある企業担当者に対して，これまで納入してきた製品の新バージョンが完成したので，その製品に関する広告宣伝メールを送信した。"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 7,
    "category": "ストラテジ系",
    "body": "新しい概念やアイディアの実証を目的とした，開発の前段階における検証を表す用語はどれか。",
    "choices": {
      "ア": "CRM",
      "イ": "PoC",
      "ウ": "RAS",
      "エ": "SLA"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 8,
    "category": "ストラテジ系",
    "body": "AIの機械学習で利用するデータの取扱いに関する記述のうち，バイアスの低減やデータの品質を確保するために考えられる対策として，適切なものだけを全て挙げたものはどれか。\n\na 学習の目的に適したデータであることを確認する。\nb データの入手元・作成来歴を確認する。\nc データへのアノテーションの付与は学習目的に合わせて実施する。\nd 人間の目でも同定が困難と考えられる画像認識用のデータは除外する。",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, c, d",
      "ウ": "a, d",
      "エ": "b, c, d"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 9,
    "category": "ストラテジ系",
    "body": "ハッカソンに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "定められたルールの下，ある主題について，肯定派と否定派といった異なる立場に分かれて議論する。",
      "イ": "情報セキュリティ分野で活躍したいという意志をもった若者が，合宿形式で情報セキュリティに関する実践的な知識を学ぶ。",
      "ウ": "プログラマーやデザイナーなどから成る複数の参加チームが，与えられたテーマに関するプロトタイプを短期間で作成し，その成果を発表して競い合う。",
      "エ": "問題解決や利用者獲得などゲーム的な要素のない分野に，デジタル技術を活用したゲームの要素を取り入れることによって，利用者の参加を動機づける。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 10,
    "category": "ストラテジ系",
    "body": "生成AIにおいて，もっともらしいが事実とは異なる内容が出力されることを表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "エコーチェンバー",
      "イ": "シンギュラリティ",
      "ウ": "ディープフェイク",
      "エ": "ハルシネーション"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 11,
    "category": "ストラテジ系",
    "body": "スマートファクトリーにおいても使用されている，FMS（Flexible Manufacturing System）に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "技術革新を効果的に自社の経営に取り入れることによって，企業の成長を図る。",
      "イ": "生産工程の各段階で，原材料から完成製品までの資材の流れを適時・適量に管理する。",
      "ウ": "生産時に必要となる部品などを必要な分だけ供給することによって，生産リードタイムを短縮する。",
      "エ": "複数の工作機械や産業用ロボットなどを有機的に結合し，生産プロセス全体を統括的に制御・管理する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 12,
    "category": "ストラテジ系",
    "body": "商標法におけるサービスマークを説明したものはどれか。",
    "choices": {
      "ア": "企業が，企業そのものを他社と区別するために表示する商標である。",
      "イ": "製造業者，販売業者が提供する商品を，他社の商品と区別するために表示する商標である。",
      "ウ": "大規模小売業者が開発したプライベートブランドの商品を，他社の商品と区別するために表示する商標である。",
      "エ": "輸送業者，金融業者などが提供する役務を，他社の役務と区別するために表示する商標である。"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 13,
    "category": "ストラテジ系",
    "body": "新しいITソリューションの活用の是非を判断するために，そのITソリューションの提供者に，活用事例や技術情報などの提供を依頼する文書として，最も適切なものはどれか。",
    "choices": {
      "ア": "EDI",
      "イ": "KPI",
      "ウ": "RFI",
      "エ": "RFP"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 14,
    "category": "ストラテジ系",
    "body": "事業，経営情報に知財情報を組み込んで分析し，現状の俯瞰や将来展望などの分析結果を事業責任者，経営者と共有し，事業戦略又は経営戦略に反映させることを表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "CVC（Corporate Venture Capital）",
      "イ": "IPランドスケープ（Intellectual Property Landscape）",
      "ウ": "MOT（Management of Technology）",
      "エ": "SWOT分析"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 15,
    "category": "ストラテジ系",
    "body": "事業運営における意思決定の迅速化，組織の独立採算の推進を目的とし，一つの企業の中に事業領域ごとに独立した組織を設置する組織形態はどれか。",
    "choices": {
      "ア": "カンパニー制組織",
      "イ": "機能別組織",
      "ウ": "プロジェクト組織",
      "エ": "マトリックス組織"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 16,
    "category": "ストラテジ系",
    "body": "他人の電子メールの利用者IDとパスワードの取扱いに関する記述のうち，不正アクセス禁止法で規制されている行為だけを全て挙げたものはどれか。\n\na 正当な理由なく本人に無断で第三者に提供する。\nb 他人の電子メールの利用者IDとパスワードを無効にするマルウェアを作成する。\nc 本人に無断で使用して，メールサーバ上の電子メールを閲覧する。",
    "choices": {
      "ア": "a, b, c",
      "イ": "a, c",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 17,
    "category": "ストラテジ系",
    "body": "プロセスマイニングに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "一連の業務で実際に遂行したシステムの操作ログなどを収集し，現行の業務プロセスの可視化，分析，モニタリングによって業務の課題を特定して改善を図る手法やツールである。",
      "イ": "業務プロセスをそれまでの習慣などにとらわれず，抜本的に再構築して業務効率の改善を図る手法である。",
      "ウ": "コンタクトセンターへの問合せ内容やSNSの投稿内容の分析などの業務プロセスで用いられる，膨大な文章データから必要な情報を抽出して分析する手法である。",
      "エ": "大量の計算処理で正しい値を算出する一連のプロセスを通じて，暗号資産を取得する手段である。"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 18,
    "category": "ストラテジ系",
    "body": "ITにおけるアクセシビリティに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "高齢者や障害者などを含め，様々な能力や特性をもつ幅広い層の人が等しく利用できるように配慮したソフトウェア製品の設計",
      "イ": "顧客データを基に顧客を識別し，コールセンターやインターネットなどの様々なチャネルを用いて顧客との関係を深める手法",
      "ウ": "製品，システム，サービスなどにおいて，それらを使用する場面をイメージしたり実際に利用したりすることで得られる人の感じ方や反応",
      "エ": "特定のファイルやデータベースなどの情報資産に対し，参照や更新などの権限の認可や制限を確実にする手段"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 19,
    "category": "ストラテジ系",
    "body": "仮想環境を用いた技術であるAR又はVRの活用事例のうち，VRの活用事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "顔を覆うように頭部にゴーグルを装着し，そのゴーグル内に投影された仮想空間に広がる火災や地震の映像を見ながら避難方法をイメージすることによって，防災訓練が行える。",
      "イ": "家具をオンラインで購入するときに，スマートフォンのカメラを通して画面に映っている現実の自分の部屋に，購入したい家具をリアルタイムに重ねて試し置きできる。",
      "ウ": "史跡などにスマートフォンを向けることによって，昔あった建物の画像や説明情報が現実の風景と重なって画面に表示される。",
      "エ": "図鑑にスマートフォンをかざすことによって，図鑑の絵や写真に重なって生物の動画が見られる。"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 20,
    "category": "ストラテジ系",
    "body": "ソフトウェアライフサイクルを企画プロセス，要件定義プロセス，開発プロセス，保守プロセスに分けたとき，企画プロセスのシステム化構想の立案時にベンダー企業から収集する情報として，最も適切なものはどれか。",
    "choices": {
      "ア": "システム化計画に基づいた開発コストの見積り",
      "イ": "システム化する業務の分野に関する情報技術動向",
      "ウ": "システム構築を進めるに当たっての発注元企業の役割",
      "エ": "ベンダー企業の技術者が保有している技術資格"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 21,
    "category": "ストラテジ系",
    "body": "基本的な機能やサービスは無償で提供し，追加の機能やサービスを有償で提供することで利益を上げるビジネスモデルを表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "フリーウェア",
      "イ": "フリーミアム",
      "ウ": "フリーライド",
      "エ": "フリーランス"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 22,
    "category": "ストラテジ系",
    "body": "営業部のAさんは，営業担当者10人の営業成績が一目で分かるように，各営業担当者が提出する営業見込みと実績を毎月集約してグラフ化したいと考えている。この問題を解決するために適用する技術やツールとして，最も適切なものはどれか。",
    "choices": {
      "ア": "データを学習し，分析するAI",
      "イ": "データを自動収集し，データベースに蓄積するIoT",
      "ウ": "入力したデータを，加工して見せるオフィスツール",
      "エ": "ビッグデータを，様々な手法で分析するデータサイエンス"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 23,
    "category": "ストラテジ系",
    "body": "コーポレートガバナンスの強化に有効な施策だけを全て挙げたものはどれか。\n\na 株式公開買付けによる企業の買収\nb 執行役員制度の導入による経営と執行の分離\nc 独立性の高い社外取締役の選任",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, c",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 24,
    "category": "ストラテジ系",
    "body": "RPAに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "企業の一部の業務を外部の組織に委託することによって，自社のリソースを重要な領域に集中したり，コストの最適化や業務の高効率化などを実現したりする。",
      "イ": "組立てや搬送などにハードウェアのロボットを用いることによって，工場の生産活動の自動化を実現する。",
      "ウ": "システムの利用者が，主体的にシステム管理や運用を行うことによって，利用者のITリテラシーの向上や，システムベンダーへの依存の軽減などを実現する。",
      "エ": "ホワイトカラーの定型的な事務作業を，ソフトウェアのロボットに代替させることによって，自動化や効率化を図る。"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 25,
    "category": "ストラテジ系",
    "body": "ブロックチェーンを適用した事例として，最も適切なものはどれか。",
    "choices": {
      "ア": "証券会社が，取引の改ざんや不整合の発生を防止することを目的として，従来の社債に代わり電子的手段を用いたデジタル社債を発行した。",
      "イ": "商品先物取引所を運営する認可法人が，取引量を拡大することを目的として，現在およそ1秒以上要している注文受付の応答時間を，1秒未満に改善した。",
      "ウ": "ビジネス路線を中心に運航する航空会社が，顧客の利便性向上と競合他社に対する競争力強化を目的として，出発1時間前まで何回でも予約の変更を可能とする新しいサービスを開始した。",
      "エ": "服飾雑貨製造会社が，自社の商品企画に活用することを目的として，過去の全ての自社商品に関する大量の画像及び社内会議の音声データをデータベースに保存し，従業員がいつでも検索できるようにした。"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 26,
    "category": "ストラテジ系",
    "body": "4月1日から5月31日までに，取引①から取引⑤があった。各取引の受注，売上計上，現金回収の状況が表のとおりであるとき，この取引先に対する5月31日時点の売掛金は何万円か。ここで，4月1日時点で売掛金残高はないものとする。\n\n取引①: 4月2日受注800万，4月10日売上計上800万，4月30日現金回収800万\n取引②: 4月5日受注500万，4月15日売上計上500万，4月30日現金回収500万\n取引③: 5月1日受注1,300万，5月10日売上計上1,300万，6月30日回収予定\n取引④: 5月6日受注1,000万，5月15日売上計上1,000万，回収予定日未定\n取引⑤: 5月20日受注400万",
    "choices": {
      "ア": "1,000",
      "イ": "1,400",
      "ウ": "2,300",
      "エ": "2,700"
    },
    "answer": "ウ",
    "image": "img/2025r07_q26.png"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 27,
    "category": "ストラテジ系",
    "body": "業務と情報システムを最適にすることを目的として，業務と情報システムの現状の把握と目標とする理想像の設定から現状と理想との乖離を明確にし，目標に向けた改善活動を移行計画として定義したい。このときに用いられる手法として，最も適切なものはどれか。",
    "choices": {
      "ア": "BI（Business Intelligence）",
      "イ": "EA（Enterprise Architecture）",
      "ウ": "MOT（Management of Technology）",
      "エ": "SOA（Service Oriented Architecture）"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 28,
    "category": "ストラテジ系",
    "body": "生成AIに関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "一切の学習を必要とせずに，新しいコンテンツを生成する。",
      "イ": "過去のデータから項目間の相関などを学習したモデルを用いて，現在のデータから将来の値を予測して出力する。",
      "ウ": "作成したシナリオに基づいて動作するソフトウェアロボットによって，業務を自動化する。",
      "エ": "自然言語で指示された内容に従って，事前に学習したデータを基に，新しいコンテンツを生成する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 29,
    "category": "ストラテジ系",
    "body": "企業経営の中核となる考え方を，ミッション，ビジョン，バリューの三つに分けて示す場合，ビジョンとして示すものとして，最も適切なものはどれか。",
    "choices": {
      "ア": "企業の存在意義や使命",
      "イ": "企業の存在意義や使命をふまえた，ある時点でのありたい姿",
      "ウ": "戦略を実現するために重要となる業績管理指標",
      "エ": "戦略を実現するために重要となる成功要因"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 30,
    "category": "ストラテジ系",
    "body": "著作権に関して，次の記述中のa，bに入れる字句の適切な組合せはどれか。\n\n[ a ]は著作権法による保護の対象になるが，[ b ]は対象にならない。",
    "choices": {
      "ア": "a: アルゴリズム / b: 操作マニュアル",
      "イ": "a: アルゴリズム / b: 通信プロトコル",
      "ウ": "a: ソースプログラム / b: 操作マニュアル",
      "エ": "a: ソースプログラム / b: 通信プロトコル"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 31,
    "category": "ストラテジ系",
    "body": "ERPシステムの説明として，適切なものはどれか。",
    "choices": {
      "ア": "企業内の個人がもつ営業に関する知識やノウハウを収集し，共有することによって，効率的，効果的な営業活動を支援するシステム",
      "イ": "経理や人事，生産，販売などの基幹業務と関連する情報を一元管理し，経営資源を最適配分することによって，効率的な経営の実現を支援するシステム",
      "ウ": "原材料の調達から生産，販売に関する情報を，企業間で共有・管理することによって，ビジネスプロセスの全体最適を目指すシステム",
      "エ": "個々の顧客に関する情報や対応履歴などを管理することによって，きめ細かい顧客対応を実施し，顧客満足度の向上を支援するシステム"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 32,
    "category": "ストラテジ系",
    "body": "公共交通機関での移動履歴，Webサイトでの商品検索履歴，SNSやブログで発信したデータなど，個人の活動を記録する技術，又は記録そのものを表す用語として，最も適切なものはどれか。",
    "choices": {
      "ア": "アクティビティ",
      "イ": "トランザクション",
      "ウ": "ライフログ",
      "エ": "レコードキーピング"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 33,
    "category": "ストラテジ系",
    "body": "自動運転の水準は，一般的に\"レベル1\"から\"レベル5\"に分けられている。\"条件付運転自動化\"と呼ばれる\"レベル3\"が示す自動運転の水準に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "運転の主体はシステムであり，人間が運転する必要はないが，システムによる自動運転の継続が難しい場合は，人間が運転しなければならない。",
      "イ": "運転の主体はシステムであり，人間が運転する必要はないので，ハンドルやペダルなどの運転装置は不要だが，自動運転できる地域は限られる。",
      "ウ": "運転の主体は人間であり，高速道路で車線を維持しながら前の自動車に付いて走る機能のように，ハンドルと加減速の操作をシステムが支援する。",
      "エ": "運転の主体は人間であり，自動ブレーキや急発進防止システムのように，前方又は後方の状況によって，システムが運転の一部を支援する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 34,
    "category": "ストラテジ系",
    "body": "ある商品を5,000個販売したところ，売上げが6,000万円，利益が400万円となった。商品1個当たりの変動費が7,000円であるとき，利益を1,000万円以上にするためには，少なくともあと何個販売すればよいか。",
    "choices": {
      "ア": "500",
      "イ": "1,200",
      "ウ": "6,200",
      "エ": "7,500"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 35,
    "category": "ストラテジ系",
    "body": "マーケティング戦略の策定プロセスのうち，自社製品の差別化ポイントを明確化するものはどれか。",
    "choices": {
      "ア": "セグメンテーション",
      "イ": "ターゲティング",
      "ウ": "プロモーション",
      "エ": "ポジショニング"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 36,
    "category": "マネジメント系",
    "body": "合意したサービス提供時間帯のうち，実際に顧客がITサービスを利用できた時間の割合で表されるものはどれか。",
    "choices": {
      "ア": "可用性",
      "イ": "機能性",
      "ウ": "効率性",
      "エ": "使用性"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 37,
    "category": "マネジメント系",
    "body": "ITサービスマネジメントに関して，次の記述中のa，bに入れる字句の適切な組合せはどれか。\n\n[ a ]はサービス提供者と顧客との間で合意されたサービス品質に関する合意書である。[ a ]の遵守状況を確認し，ITサービスの品質を維持・改善させるための活動が[ b ]である。",
    "choices": {
      "ア": "a: NDA / b: SCM",
      "イ": "a: NDA / b: SLM",
      "ウ": "a: SLA / b: SCM",
      "エ": "a: SLA / b: SLM"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 38,
    "category": "マネジメント系",
    "body": "情報セキュリティ監査の説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "一定の基準に基づいてITシステムの利用に係る検証・評価を行い，ガバナンスの適切性などに対する保証や改善のための助言を行うもの",
      "イ": "コンピュータの盗難や不正な持出しを物理的に防止し，情報セキュリティを確保するためのツール",
      "ウ": "組織体の価値及び組織体への信頼を向上させるために，組織体におけるITシステムの利活用のあるべき姿を示すIT戦略と方針の策定及びその実現のための活動",
      "エ": "組織の情報資産に関わるリスクマネジメントが効果的に実施されているかどうかの検証又は評価"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 39,
    "category": "マネジメント系",
    "body": "ソフトウェア開発モデルであるアジャイルモデルの特徴に関して，次の記述中のa，bに入れる字句の適切な組合せはどれか。\n\nアジャイルモデルとは，要件を確定してから開発を実施するウォーターフォールモデルの[ a ]する形で提唱された，[ b ]できるようにソフトウェアを開発するための手法の総称である。",
    "choices": {
      "ア": "a: 課題を改善 / b: 開発工程で生じる種々の変更に迅速に対応",
      "イ": "a: 課題を改善 / b: 開発工程を順に実施",
      "ウ": "a: 特徴を継承 / b: 開発工程で生じる種々の変更に迅速に対応",
      "エ": "a: 特徴を継承 / b: 開発工程を順に実施"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 40,
    "category": "マネジメント系",
    "body": "変更管理委員会が設置されているプロジェクトで変更要求が発生した場合の記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "変更管理委員会では，プロジェクトに関わるステークホルダ以外の第三者によって変更要求が審議される。",
      "イ": "変更管理委員会は，コストの増加や期日の延期を理由に変更要求を却下してよい。",
      "ウ": "変更管理委員会は，スコープに変更が発生しない範囲で変更要求を受け付けなければならない。",
      "エ": "変更要求は，全てプロジェクトマネージャが承認した後に変更管理委員会で審議される。"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 41,
    "category": "マネジメント系",
    "body": "システム開発プロジェクトで使用される技法のうち，スケジュール作成に用いる技法として，適切なものだけを全て挙げたものはどれか。\n\na DFD（Data Flow Diagram）\nb 回帰分析\nc クリティカルパス法\nd プレシデンスダイアグラム法",
    "choices": {
      "ア": "a, b",
      "イ": "a, d",
      "ウ": "b, c",
      "エ": "c, d"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 42,
    "category": "マネジメント系",
    "body": "床下にネットワーク配線などのために一定の高さの空間をとり，容易に取り外しが可能なパネルを床板として並べたものはどれか。",
    "choices": {
      "ア": "フリーアクセスフロア",
      "イ": "フリーアドレス",
      "ウ": "フリースペース",
      "エ": "フリースポット"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 43,
    "category": "マネジメント系",
    "body": "営業部門の営業員が出張する際の出張旅費の手続に関して，組織間でけん制を日常的に実施している状況の記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "営業員が出張後に経理部門に提出した旅費精算の書類と証票類について，経理担当者が適切な内容であることを審査し，経理課長が承認する。",
      "イ": "営業員が出張後に旅費の精算を行い，上長が承認を行う。経理部門では承認済みであるので支払を行う。",
      "ウ": "営業員は出張の事前申請を行って上長の承認を得た後に，切符や宿泊施設の手配を旅行会社に依頼する。",
      "エ": "会計年度における営業部門の旅費精算の書類と証票類から，監査人がサンプリングして，営業員の処理内容の適切性を確認する。"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 44,
    "category": "マネジメント系",
    "body": "システム開発の早い段階で，目に見える形で利用者の要求が確認できるように確認用のソフトウェアを作成するソフトウェア開発モデルとして，最も適切なものはどれか。",
    "choices": {
      "ア": "アジャイル",
      "イ": "ウォーターフォール",
      "ウ": "スパイラル",
      "エ": "プロトタイピング"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 45,
    "category": "マネジメント系",
    "body": "計画時の予算が2,000万円で，40日間で100本のプログラムを作成するプロジェクトがある。プロジェクトが20日経過した時点で全体の40%である40本のプログラムが完成し，1,000万円のコストが掛かった。プロジェクトの指標を次の評価式で算出する場合，プロジェクトの指標として適切な組合せはどれか。ここで，各プログラムの作成に必要な日数及びコストは全て同一で，プロジェクト期間中は常に同じ量の作業が実施されるものとする。\n\n〔評価式〕\nスケジュール（%）:（完成したプログラム本数÷評価時点での完成見込みプログラム本数）×100\nコスト（%）:（完成したプログラムに掛かったコスト÷完成したプログラム分として計画したコスト）×100",
    "choices": {
      "ア": "スケジュール: 80% / コスト: 125%",
      "イ": "スケジュール: 80% / コスト: 100%",
      "ウ": "スケジュール: 90% / コスト: 125%",
      "エ": "スケジュール: 90% / コスト: 100%"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 46,
    "category": "マネジメント系",
    "body": "開発が完了したソフトウェアを本番環境にインストールする手順を明確にし，それを実施する工程として，適切なものはどれか。",
    "choices": {
      "ア": "ソフトウェア統合",
      "イ": "ソフトウェア導入",
      "ウ": "妥当性確認",
      "エ": "利用者教育"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 47,
    "category": "マネジメント系",
    "body": "利用者が銀行のATMのパネルを操作して入金処理を行う。この操作の要件を定義するときに，ソフトウェア開発の品質特性である使用性を考慮すべきインタフェースとして，最も適切なものはどれか。",
    "choices": {
      "ア": "OSとパネルのインタフェース",
      "イ": "ソフトウェア間のインタフェース",
      "ウ": "ハードウェアとOSのインタフェース",
      "エ": "利用者とパネルのインタフェース"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 48,
    "category": "マネジメント系",
    "body": "顧客から委託されたシステム開発プロジェクトのスコープの対象として，適切なものだけを全て挙げたものはどれか。\n\na プロジェクトで作成する成果物\nb プロジェクトで使用する市販のスケジュール管理ツール\nc プロジェクトの要求事項を顧客が記載した文書",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 49,
    "category": "マネジメント系",
    "body": "クラウドサービスを提供するA社では，操作に関する質問に対して，サービスデスクのオペレーターが電話で対応するだけでなく，ホームページ上にFAQを公開している。サービスデスクの受付時間は午前9時から午後6時までである。このたびサービスデスクのサービスレベルを向上させるために，顧客向けのチャットボットを導入することにした。チャットボット導入の効果として，最も適切なものはどれか。",
    "choices": {
      "ア": "オペレーターのチャットのスキルが向上する。",
      "イ": "オペレーターの電話対応のスキルが向上する。",
      "ウ": "問合せの受付時間を拡大することが可能になる。",
      "エ": "ホームページ上に掲載しているFAQの内容が充実する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 50,
    "category": "マネジメント系",
    "body": "チャットボットの説明として，最も適切なものはどれか。",
    "choices": {
      "ア": "質問に対して，ソフトウェアがリアルタイムで自動応答する仕組み",
      "イ": "センサーを搭載した機器や制御装置が直接インターネットにつながり，お互いに情報をやり取りする仕組み",
      "ウ": "人間に代わって荷物を運ぶなどの作業を行う機械的な仕組み",
      "エ": "ルール化された定型的な操作を人間の代わりにソフトウェアが自動で行う仕組み"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 51,
    "category": "マネジメント系",
    "body": "社内で開発及び運用を行っている経理システムの内部監査を実施するとき，システム監査人として，最も適切なものはどれか。",
    "choices": {
      "ア": "経理システムの運用担当者",
      "イ": "経理システムの開発を担当した委託会社の従業員",
      "ウ": "経理システムの利用者である経理担当者",
      "エ": "経理とITの知識を有する経営者直轄組織の従業員"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 52,
    "category": "マネジメント系",
    "body": "A社は会計システムの再構築のプロジェクトを立ち上げ，システム開発をB社に外部委託している。B社から納品される成果物の検収において，プロジェクトの品質管理に係る手続を遵守しているかどうかのシステム監査を行う監査人として，適切な者は誰か。",
    "choices": {
      "ア": "会計システムの再構築に関与しないA社の管理部門のリーダー",
      "イ": "会計システムの再構築を担当するA社のプロジェクトマネージャ",
      "ウ": "会計システムの再構築を担当するB社のシステム開発リーダー",
      "エ": "会計システムの再構築を担当するB社の品質管理責任者"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 53,
    "category": "マネジメント系",
    "body": "内部統制の基本的要素の一つである\"ITへの対応\"に関する記述として，最も適切なものはどれか。",
    "choices": {
      "ア": "ITを活用すると業務処理を迅速化でき，不注意によるミスを全て防止できる。",
      "イ": "既存のITの利用者の拡大や，使い方の変更などで組織目標を達成できるのであれば，新たなITシステムの導入やITシステムの更新を強いるものではない。",
      "ウ": "全ての業務プロセスをITで自動化することによって，業務プロセスを大幅に修正することが容易になる。",
      "エ": "組織の業務がITに大きく依存すると，内部統制の目的を達成することが難しくなる。"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 54,
    "category": "マネジメント系",
    "body": "あるコールセンターでは，顧客からの電話による問合せに対応するオペレーターを支援するシステムに，顧客とオペレーターの会話の音声を認識し，顧客の問合せに対する回答の候補をオペレーターのPCの画面に表示するAIを導入した。1日の対応件数は1,000件であり，問合せ内容によって二つのグループA，Bに分けた。AI導入前後の各グループの対応件数，対応時間が表のとおりであるとき，AI導入後に，1,000件の問合せに対応する時間は何%短縮できたか。\n\nグループA: 対応件数800件，AI導入前の対応時間は全体の60%，AI導入後はAI導入前と比べて50%短縮\nグループB: 対応件数200件，AI導入前の対応時間は全体の40%，AI導入後はAI導入前と同じ時間",
    "choices": {
      "ア": "30",
      "イ": "40",
      "ウ": "50",
      "エ": "60"
    },
    "answer": "ア",
    "image": "img/2025r07_q54.png"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 55,
    "category": "マネジメント系",
    "body": "システム開発プロジェクトの開始に当たり，人的資源に関する計画書を作成することにした。この計画において，要員を適切に配置し，より良いパフォーマンスを得るために考慮すべき事項として，適切なものだけを全て挙げたものはどれか。\n\na プロジェクトに必要なスキルが要員に不足している場合は，トレーニングを計画する。\nb プロジェクトに必要なスキルよりも，要員の確保を常に優先するように計画する。\nc 要員をフレキシブルに配置するために，要員の役割と責任は，プロジェクトの計画段階では明確にせず，プロジェクトの開始後に定める。",
    "choices": {
      "ア": "a",
      "イ": "a, b, c",
      "ウ": "a, c",
      "エ": "c"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 56,
    "category": "テクノロジ系",
    "body": "Bluetoothに追加された仕様の一つであり，省電力性に優れているので，IoTシステムを長期間運用でき，送受信デバイス間の距離を知ることにも使われているものはどれか。",
    "choices": {
      "ア": "BLE",
      "イ": "IrDA",
      "ウ": "NFC",
      "エ": "PLC"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 57,
    "category": "テクノロジ系",
    "body": "HTTPプロキシサーバの機能に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "IPアドレス割当て要求をPCから受け付けて，割り当てるグローバルIPアドレスを返す。",
      "イ": "PCから，インターネット上のWebサーバへの接続要求を中継役として受けて，PCに代わって当該のWebサーバに接続し，送受信データを中継する。",
      "ウ": "WebサーバのURLに対応するIPアドレスを求める要求をPCから受け付けて，そのIPアドレスを返す。",
      "エ": "Webサーバのコンテンツが検索結果の上位に表示されるように，そのWebサーバが管理するコンテンツを書き換える。"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 58,
    "category": "テクノロジ系",
    "body": "DNSの説明として，適切なものはどれか。",
    "choices": {
      "ア": "IPネットワークに接続しようとするコンピュータに，IPアドレスなどを自動的に割り当てるプロトコルである。",
      "イ": "ブラウザとWebサーバ間の通信を暗号化して，セキュリティを高めるために利用されるプロトコルである。",
      "ウ": "ホスト名やドメイン名と，IPアドレスを対応付ける仕組みである。",
      "エ": "ホスト名やドメイン名と，MACアドレスを対応付ける仕組みである。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 59,
    "category": "テクノロジ系",
    "body": "ISMSにおける内部監査に関する記述のうち，適切なものはどれか。",
    "choices": {
      "ア": "JIS Q 27001の要求事項及び組織自体が規定した要求事項によって定める監査基準への適合性だけでなく，ISMS活動の組織に対する有効性も判定する。",
      "イ": "JIS Q 27001の要求事項ではなく，組織自体が規定した要求事項を監査基準とする。",
      "ウ": "内部監査の実施のためのプログラムを確立するときには，前回の内部監査の結果は考慮しない。",
      "エ": "不定期かつ抜き打ちでの実施を原則とする。"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 60,
    "category": "テクノロジ系",
    "body": "TCP/IPネットワークで用いられるプロトコルであるFTPの役割として，適切なものはどれか。",
    "choices": {
      "ア": "正確な現在時刻を取得する。",
      "イ": "電子メールを転送する。",
      "ウ": "ネットワーク接続に必要なIPアドレスなどの情報を自動的に割り当てる。",
      "エ": "ファイルをPC間で転送する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 61,
    "category": "テクノロジ系",
    "body": "DBMSのトランザクションに関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "あるデータベースの内容を他のデータベースに複製し，内容の同期をとる。",
      "イ": "データベースに対して行った操作を，順次記録する。",
      "ウ": "データベースに対する一連の処理が全て成功したら変更結果を確定し，途中で失敗したら処理前の状態に戻す。",
      "エ": "データベースの表の索引を作成し，検索時には索引を使用する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 62,
    "category": "テクノロジ系",
    "body": "OSの仮想記憶方式に関する次の記述中のa～cに入れる字句の適切な組合せはどれか。\n\nプログラムの実行時に，コンピュータの[ a ]装置の[ b ]な容量に制約されない，[ c ]なアドレス空間を提供する。",
    "choices": {
      "ア": "a: 主記憶 / b: 物理的 / c: 論理的",
      "イ": "a: 主記憶 / b: 論理的 / c: 物理的",
      "ウ": "a: 補助記憶 / b: 物理的 / c: 論理的",
      "エ": "a: 補助記憶 / b: 論理的 / c: 物理的"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 63,
    "category": "テクノロジ系",
    "body": "データの尺度を名義尺度，順序尺度，間隔尺度，比例尺度の四つに分類したとき，間隔尺度に該当するものはどれか。",
    "choices": {
      "ア": "学年",
      "イ": "血液型",
      "ウ": "時刻",
      "エ": "睡眠時間"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 64,
    "category": "テクノロジ系",
    "body": "WebサイトなどでRSSの表記を見かけることがある。このRSSの説明として，適切なものはどれか。",
    "choices": {
      "ア": "Webページの統一的なデザインやレイアウトを定義するための規格",
      "イ": "Webページの見出しやリンク，要約などを記述するフォーマット",
      "ウ": "ネットワーク上にブックマークを登録することによって，利用価値の高いWebサイト情報を他の利用者と共有するサービス",
      "エ": "ブラウザとWebサーバ間で，データを暗号化して安全に送受信するためのプロトコル"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 65,
    "category": "テクノロジ系",
    "body": "DBMSにおいて，データの検索を高速に行う目的で，必要に応じて設定して利用する情報はどれか。",
    "choices": {
      "ア": "インデックス",
      "イ": "外部キー",
      "ウ": "主キー",
      "エ": "スキーマ"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 66,
    "category": "テクノロジ系",
    "body": "関係データベースで管理している次の\"ログイン記録\"表及び\"部署\"表において，ログイン結果が失敗となったことのある，又は，2022年4月10日09:00:00以前にログイン結果が成功となったことのある従業員が所属する部署名だけを全て挙げたものはどれか。\n\nログイン記録表:\n2022-04-10 08:50:42, 従業員10004, 部署003, 失敗\n2022-04-10 08:53:15, 従業員10004, 部署003, 成功\n2022-04-10 08:55:48, 従業員10002, 部署002, 成功\n2022-04-10 09:00:15, 従業員10001, 部署001, 成功\n2022-04-10 09:01:05, 従業員10012, 部署002, 成功\n2022-04-10 09:03:01, 従業員10008, 部署003, 成功\n2022-04-10 09:10:28, 従業員10007, 部署001, 成功\n2022-04-10 09:32:19, 従業員10002, 部署002, 成功\n2022-04-10 09:39:22, 従業員10005, 部署003, 失敗\n2022-04-10 10:00:02, 従業員10011, 部署001, 失敗\n2022-04-10 10:05:51, 従業員10011, 部署001, 成功\n2022-04-10 10:30:45, 従業員10009, 部署002, 成功\n\n部署表: 001=営業部, 002=システム部, 003=人事部",
    "choices": {
      "ア": "営業部，システム部",
      "イ": "営業部，システム部，人事部",
      "ウ": "営業部，人事部",
      "エ": "システム部，人事部"
    },
    "answer": "イ",
    "image": "img/2025r07_q66.png"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 67,
    "category": "テクノロジ系",
    "body": "3次元画像処理の高速化や，動画をなめらかにするなどの機能をもつ，描画処理のためのハードウェアはどれか。",
    "choices": {
      "ア": "CGI",
      "イ": "GPU",
      "ウ": "GUI",
      "エ": "UPS"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 68,
    "category": "テクノロジ系",
    "body": "CSIRTとして行う活動の例として，最も適切なものはどれか。",
    "choices": {
      "ア": "OSやアプリケーションソフトウェアのセキュリティパッチを定期的に適用する。",
      "イ": "地震や洪水などの自然災害を想定し，情報資産を守るために全社的な事業継続計画を策定する。",
      "ウ": "セキュリティ事故の発生時に影響範囲を調査して，被害拡大を防止するための対策実施を支援する。",
      "エ": "保守業者がサーバ室で作業した日に，作業員の入退出が適切に記録されていたことを監査する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 69,
    "category": "テクノロジ系",
    "body": "バイオメトリクス認証の他人受入率と本人拒否率に関する次の記述中のa，bに入れる字句の適切な組合せはどれか。\n\nバイオメトリクス認証の認証精度において，他人受入率を低く抑えようとすると[ a ]が高くなり，本人拒否率を低く抑えようとすると[ b ]が高くなる。",
    "choices": {
      "ア": "a: 安全性 / b: 可用性",
      "イ": "a: 安全性 / b: 利便性",
      "ウ": "a: 利便性 / b: 安全性",
      "エ": "a: 利便性 / b: 可用性"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 70,
    "category": "テクノロジ系",
    "body": "情報セキュリティにおける脅威のうち，脆弱性を是正するセキュリティパッチをソフトウェアに適用することが最も有効な対策になるものはどれか。",
    "choices": {
      "ア": "総当たり攻撃",
      "イ": "ソーシャルエンジニアリング",
      "ウ": "パスワードリスト攻撃",
      "エ": "バッファオーバーフロー"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 71,
    "category": "テクノロジ系",
    "body": "携帯電話で用いられる電波に関する次の記述中のa，bに入れる字句の適切な組合せはどれか。\n\n電波には，周波数が[ a ]ほど回り込みやすくなり障害物の裏にも届きやすいという性質がある。日本国内の携帯電話で使用される周波数のうち，700帯～900[ b ]帯の周波数帯域はこの性質をもちつながりやすいことなどから，プラチナバンドと呼ばれている。",
    "choices": {
      "ア": "a: 高い / b: GHz",
      "イ": "a: 高い / b: MHz",
      "ウ": "a: 低い / b: GHz",
      "エ": "a: 低い / b: MHz"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 72,
    "category": "テクノロジ系",
    "body": "見る人に意図が伝わりやすいデザインにするための四つの原則に関する次の記述中のa，bに入れる字句の適切な組合せはどれか。\n\n〔四つの原則〕\n近接: 互いに関連する要素は近づけてグループにする。\n[ a ]: 要素を意図したルールに基づき配置する。\n反復: 要素ごとにデザインルールを繰り返す。\n[ b ]: 要素ごとの大小や強弱などの違いを明確にする。",
    "choices": {
      "ア": "a: 整列 / b: 価値",
      "イ": "a: 整列 / b: 対比",
      "ウ": "a: 操作 / b: 価値",
      "エ": "a: 操作 / b: 対比"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 73,
    "category": "テクノロジ系",
    "body": "Webサービスを狙った攻撃に関する記述と攻撃の名称の適切な組合せはどれか。\n\na Webサービスが利用しているソフトウェアに脆弱性の存在が判明したとき，その修正プログラムが提供される前に，この脆弱性を突いて攻撃する。\nb 複数のコンピュータから大量のパケットを一斉に送り付けることによって，Webサービスを正常に提供できなくさせる。\nc 理論的にあり得るパスワードのパターンを順次試すことによって，正しいパスワードを見つけ，攻撃対象のWebサービスに侵入する。",
    "choices": {
      "ア": "a: DDoS攻撃 / b: ゼロデイ攻撃 / c: ブルートフォース攻撃",
      "イ": "a: DDoS攻撃 / b: ブルートフォース攻撃 / c: ゼロデイ攻撃",
      "ウ": "a: ゼロデイ攻撃 / b: DDoS攻撃 / c: ブルートフォース攻撃",
      "エ": "a: ゼロデイ攻撃 / b: ブルートフォース攻撃 / c: DDoS攻撃"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 74,
    "category": "テクノロジ系",
    "body": "デジタルフォレンジックスの説明として，適切なものはどれか。",
    "choices": {
      "ア": "コンピュータに関する犯罪や法的紛争が生じた際に，コンピュータから削除された電子メールを復元するなどして，証拠を収集し保全すること",
      "イ": "システムを実際に攻撃して脆弱性の有無を調べること",
      "ウ": "通信経路を暗号化するなどして，公衆回線をあたかも専用回線であるかのように利用すること",
      "エ": "電子メールやファイルなどのハッシュデータを本人の秘密鍵で暗号化すること"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 75,
    "category": "テクノロジ系",
    "body": "次の記憶媒体のうち，記憶素子として半導体メモリを用いているものだけを全て挙げたものはどれか。\n\na CD-ROM\nb DVD-RAM\nc RAM\nd SSD\ne USBメモリ",
    "choices": {
      "ア": "a, b, c",
      "イ": "a, b, e",
      "ウ": "c, d, e",
      "エ": "c, e"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 76,
    "category": "テクノロジ系",
    "body": "商品の税込価格を計算する表計算のワークシートがある。セルB1には消費税率が入力されており，セルB4～B6には税抜価格が入力されている。セルC4～C6に税込価格を表示するために，セルC4に式を入力し，セルC5，C6に複写する。セルC4に入力する式はどれか。ここで，セルB1は，パーセント形式で表示している。\n\nA1: 消費税率, B1: 10%\nA3: 商品名, B3: 税抜価格（円）, C3: 税込価格（円）\nA4: 商品X, B4: 200\nA5: 商品Y, B5: 500\nA6: 商品Z, B6: 100",
    "choices": {
      "ア": "B$4*(1+B$1)",
      "イ": "B$4*(1+B1)",
      "ウ": "B4*(1+B$1)",
      "エ": "B4*(1+B1)"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 77,
    "category": "テクノロジ系",
    "body": "ネットワークやホストを監視することによって，不正アクセスや不審な通信を発見し，報告する仕組みはどれか。",
    "choices": {
      "ア": "DMZ",
      "イ": "IDS",
      "ウ": "アンチパスバック",
      "エ": "ボット"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 78,
    "category": "テクノロジ系",
    "body": "手続calcMod3を呼び出したときの出力はどれか。\n\n〔プログラム〕\n○calcMod3()\n  整数型: totalValue, i\n  totalValue ← 0\n  for (iを1から7まで1ずつ増やす)\n    if (i÷3の余りが0と等しい)\n      totalValue ← totalValue + i\n    endif\n  endfor\n  totalValueを出力する",
    "choices": {
      "ア": "2",
      "イ": "3",
      "ウ": "7",
      "エ": "9"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 79,
    "category": "テクノロジ系",
    "body": "サムネイルの説明として，適切なものはどれか。",
    "choices": {
      "ア": "画像や文書ファイルの内容を縮小して表示したもの",
      "イ": "処理の内容や対象が分かる小さな絵や記号のこと",
      "ウ": "ネット上で利用者の分身として動作するキャラクターのこと",
      "エ": "複数のファイルを一つのファイルにまとめたもの"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 80,
    "category": "テクノロジ系",
    "body": "AIにおいて，広範囲かつ大量のデータで訓練されたものであり，ファインチューニングなどによって文章生成AIのような様々な用途に適応できる特徴をもつものを何というか。",
    "choices": {
      "ア": "アノテーション",
      "イ": "エキスパートシステム",
      "ウ": "基盤モデル",
      "エ": "畳み込みニューラルネットワーク"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 81,
    "category": "テクノロジ系",
    "body": "イメージスキャナーで読み取った紙の書類の画像から，印刷文字や手書きの文字を読み取り，テキストデータに変換する技術を何と呼ぶか。",
    "choices": {
      "ア": "CCD",
      "イ": "DVI",
      "ウ": "GPU",
      "エ": "OCR"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 82,
    "category": "テクノロジ系",
    "body": "あるコンピュータのデータベースの内容を他のコンピュータのデータベースに複製して，両者の内容が一致するように同期させるDBMSの機能はどれか。",
    "choices": {
      "ア": "アーカイブ",
      "イ": "バックアップ",
      "ウ": "レプリケーション",
      "エ": "ロールバック"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 83,
    "category": "テクノロジ系",
    "body": "ISMSの運用にPDCAモデルを採用している組織において，サーバ監視に関する次の作業を実施する。各作業とPDCAモデルの各フェーズの組合せとして，適切なものはどれか。\n\n〔作業〕\n(1) サーバ監視の具体的な目的及び手順を定める。\n(2) サーバ監視の作業内容を第三者が客観的に評価する。\n(3) 定められている手順に従ってサーバを監視する。\n(4) 発見された問題点の是正処置として，サーバの監視方法を変更する。",
    "choices": {
      "ア": "P=(1), D=(2), C=(3), A=(4)",
      "イ": "P=(1), D=(2), C=(4), A=(3)",
      "ウ": "P=(1), D=(3), C=(2), A=(4)",
      "エ": "P=(1), D=(3), C=(4), A=(2)"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 84,
    "category": "テクノロジ系",
    "body": "ISMSにおける情報セキュリティ方針に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "機密事項が記載されているので，伝達する範囲を社内に限定する必要がある。",
      "イ": "情報セキュリティ対策は一度実施したら終わりではないので，ISMSを継続的に改善するコミットメントを含める必要がある。",
      "ウ": "部門の特性に応じて最適化するので，ISMSを適用する組織全体ではなく，部門ごとに定める必要がある。",
      "エ": "ボトムアップを前提としているので，各職場の管理者によって承認される必要がある。"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 85,
    "category": "テクノロジ系",
    "body": "問題を解いて解答群の中から正解を選ぶ，あるAIシステムがある。このシステムは，1回の学習の過程を経るごとに，学習の過程の前後の比較において，誤り率が5%低下する（前回の誤り率の95%になる）。現在の正解率が30%であるとき，正解率が35%を超えるためには，少なくともあと何回の学習の過程が必要か。",
    "choices": {
      "ア": "1",
      "イ": "2",
      "ウ": "3",
      "エ": "4"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 86,
    "category": "テクノロジ系",
    "body": "動物が写っている大量の画像から犬や猫などの特徴を自動的に抽出して，動物の種類を識別できるようにするAIの技術はどれか。",
    "choices": {
      "ア": "e-ラーニング",
      "イ": "アクティブラーニング",
      "ウ": "アダプティブラーニング",
      "エ": "ディープラーニング"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 87,
    "category": "テクノロジ系",
    "body": "PKIにおいて，ある条件に当てはまるデジタル証明書の情報が公開されているリストとしてCRLがある。このリストに掲載される条件として，適切なものはどれか。",
    "choices": {
      "ア": "有効期間が満了している。",
      "イ": "有効期間が無期限である。",
      "ウ": "有効期間内に失効している。",
      "エ": "有効期間を延長している。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 88,
    "category": "テクノロジ系",
    "body": "情報セキュリティ対策を，\"技術的セキュリティ対策\"，\"人的セキュリティ対策\"及び\"物理的セキュリティ対策\"に分類したとき，\"物理的セキュリティ対策\"の例として，適切なものはどれか。",
    "choices": {
      "ア": "業務に関係のない掲示板やSNSなどへの従業員による書込み，閲覧を防止するために，Webサーバへのアクセスログを取得し，必要に応じて通信を遮断する。",
      "イ": "サーバ室，執務室などの場所ごとにセキュリティレベルを設定し，従業員ごとのアクセス権が付与されたICカードで入退室管理を行う。",
      "ウ": "従業員の採用時には，守秘義務に関する契約書を取り交わし，在籍中は機密情報の取扱いに関する教育，啓発を実施する。",
      "エ": "退職者が，在籍中のアカウントを用いた不正アクセスを行わないように，従業員の退職時にアカウントを削除する。"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 89,
    "category": "テクノロジ系",
    "body": "AさんはBさんから次の4種類のメッセージを受け取った。Aさんが，受け取ったメッセージを復号して読むことができるものだけを全て挙げたものはどれか。\n\na AさんとBさんとの共通鍵で暗号化したメッセージ\nb Aさんの公開鍵で暗号化したメッセージ\nc Bさんの公開鍵で暗号化したメッセージ\nd Bさんの秘密鍵で暗号化したメッセージ",
    "choices": {
      "ア": "a, b, d",
      "イ": "a, c, d",
      "ウ": "b, d",
      "エ": "c, d"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 90,
    "category": "テクノロジ系",
    "body": "無線LANのセキュリティ対策に関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "APIは，複数のアクセスポイントをグループ化して管理するIDである。",
      "イ": "SSHは，アクセスポイントをステルス化することで無線LANネットワークを隠蔽する機能である。",
      "ウ": "VPNは，アクセスポイントに登録したMACアドレスをもつ機器以外からの接続を拒否する機能である。",
      "エ": "WPA2は，WEPよりも高い信頼性をもつ，無線通信の暗号化技術である。"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 91,
    "category": "テクノロジ系",
    "body": "情報セキュリティのリスクマネジメントにおけるリスク対応を，リスク移転，リスク回避，リスク低減及びリスク保有の四つに分けて実施することにしたとき，これらに関する記述として，適切なものはどれか。",
    "choices": {
      "ア": "リスク対応の実施手順であり，リスク回避，リスク移転，リスク低減，リスク保有の順番で進める。",
      "イ": "リスク対応の実施手順であり，リスク保有，リスク低減，リスク移転，リスク回避の順番で進める。",
      "ウ": "リスク対応の選択肢であり，管理対象としたリスクの顕在化に備えて保険を掛けておくことは，リスク回避に該当する。",
      "エ": "リスク対応の選択肢であり，ノートPCの紛失や盗難に備えて社外への持出しをより厳重に管理することは，リスク低減に該当する。"
    },
    "answer": "エ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 92,
    "category": "テクノロジ系",
    "body": "従業員が使用するPCがランサムウェアに感染した場合の損害を軽減する対策例として，適切なものはどれか。",
    "choices": {
      "ア": "PCが接続するファイルサーバのHDDのバックアップデータを定期的に取得し，ネットワークから切り離して保管する。",
      "イ": "PCに多要素認証の仕組みを導入する。",
      "ウ": "PCのHDDを暗号化する。",
      "エ": "PCへのログイン時に，パスワードを複数回間違えたら，当該IDをロックする。"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 93,
    "category": "テクノロジ系",
    "body": "情報セキュリティにおける脅威の説明として，適切なものはどれか。",
    "choices": {
      "ア": "攻撃者が付け込むことのできる情報システムの弱点",
      "イ": "情報資産が被害に遭う確率と被害規模の組合せ",
      "ウ": "情報資産に損害を与える原因となるもの",
      "エ": "情報システムの弱点を利用した攻撃によって被害を受ける可能性"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 94,
    "category": "テクノロジ系",
    "body": "稼働率0.9の装置で並列システムを構成したい。このシステムの稼働率を0.999とするためには，最低何台の装置で並列システムを構成する必要があるか。ここで，並列システムを構成したときに，少なくとも1台の装置が稼働していればシステムは正常に稼働しているものとする。",
    "choices": {
      "ア": "2",
      "イ": "3",
      "ウ": "4",
      "エ": "5"
    },
    "answer": "イ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 95,
    "category": "テクノロジ系",
    "body": "データベース設計におけるデータ分析で行うこととして，適切なものはどれか。",
    "choices": {
      "ア": "データウェアハウスから業務ごとに必要な情報を抽出する。",
      "イ": "データ項目の内容が，指定された条件を満足する行だけを抽出する。",
      "ウ": "必要なデータ項目を洗い出し，項目間の関連を整理する。",
      "エ": "膨大な情報から統計的手法などを用いて，ビジネスに活用できる情報を探索する。"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 96,
    "category": "テクノロジ系",
    "body": "OSS（Open Source Software）に関する次の記述のうち，適切なものだけを全て挙げたものはどれか。\n\na 個人だけではなく，企業や団体が開発したソフトウェアもある。\nb 著作権が放棄されている。\nc 入手したソフトウェアは，自由に再配布してもよい。",
    "choices": {
      "ア": "a, b",
      "イ": "a, b, c",
      "ウ": "a, c",
      "エ": "b, c"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 97,
    "category": "テクノロジ系",
    "body": "情報セキュリティにおいて，可用性が損なわれた事象だけを全て挙げたものはどれか。\n\na 関連取引先との電子決済システムがDoS攻撃を受け，処理ができなくなった。\nb 顧客情報管理システムの顧客情報が誤った内容のまま運用されていた。\nc 社内のサーバに不正侵入されて，社外秘の情報が漏えいした。",
    "choices": {
      "ア": "a",
      "イ": "a, b",
      "ウ": "b, c",
      "エ": "c"
    },
    "answer": "ア"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 98,
    "category": "テクノロジ系",
    "body": "4個の要素から成るデータの並びを，次の手順を繰り返して昇順に整列するとき，整列が終了するまでに(1)から(3)の一連の手順は，何回実行されるか。ここで，最初はデータの並び全体を整列対象とする。\n\nデータの並び: [27, 42, 33, 12]\n\n〔手順〕\n(1) 整列対象中の要素の最大の値を選び，最後の要素と入れ替える。\n(2) 最後の要素を整列対象から外す。\n(3) 整列対象に要素が1個以上残っていれば，(1)から(3)の一連の手順を実行する。残っていなければ，整列完了なので終了する。",
    "choices": {
      "ア": "2",
      "イ": "3",
      "ウ": "4",
      "エ": "5"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 99,
    "category": "テクノロジ系",
    "body": "関数calculateAmountOfPrizeは，業務改善の効果における改善額と短縮期間を，それぞれimprovementとperiodで受け取り，賞金額を戻り値とする。改善額が20万円で短縮期間が3日の業務改善と，改善額が5万円で短縮期間が14日の業務改善があった。この二つの賞金額の合計は何円か。ここで，改善額と短縮期間の値はそれぞれ0以上とする。\n\n〔プログラム〕\n○整数型: calculateAmountOfPrize(整数型: improvement, 整数型: period)\n  整数型: prize\n  if (improvementが100000より小さい)\n    if (periodが7より小さい)\n      prize ← 500\n    else\n      prize ← 1000\n    endif\n  else\n    if (periodが7より小さい)\n      prize ← 2000\n    else\n      prize ← 5000\n    endif\n  endif\n  return prize",
    "choices": {
      "ア": "1,000",
      "イ": "1,500",
      "ウ": "3,000",
      "エ": "5,500"
    },
    "answer": "ウ"
  },
  {
    "exam": "2025r07",
    "examLabel": "R07",
    "number": 100,
    "category": "テクノロジ系",
    "body": "個人の認証に用いる要素を，知識，所有物及びバイオメトリクスの三つに分類したとき，所有物を要素として用いた認証の例はどれか。",
    "choices": {
      "ア": "SMSを用いた認証",
      "イ": "虹彩の特徴を用いた認証",
      "ウ": "筆跡や筆圧，スピードなど，文字を書くときの特徴を用いた認証",
      "エ": "本人が事前に設定した質問とそれに対する答えを用いた認証"
    },
    "answer": "ア"
  }
];
